[{"title":"About","slug":"about","url":"/post/about","tags":[],"description":"","thumbnail":null,"social":null,"comments":null,"relatedPosts":null,"body":"<h2 id=\"user-content-nexy-community\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#nexy-community\"><span></span></a>Nexy Community</h2>\n<blockquote>\n<p><em>Startups + Technology + Rationality + Creativity</em></p>\n</blockquote>\n<p>Nexy is a community of makers - startup founders, developers, designers, writers, all people who are interested in using technology to create cool things, build projects, and turn them into profitable businesses.</p>\n<p>I want it to become a place where smart and creative people share their knowledge, engage in thoughtful discussions, exchange feedback and advice, help each other to get better at their craft, showcase their projects, and grow their audience.</p>\n<p>Our purpose is to share insightful ideas and actionable advice which:</p>\n<ul>\n<li>Helps you to get better at your craft, and create cool things that make an impact on the world.</li>\n<li>Helps you to build an audience, grow your projects, and make money with what you create.</li>\n<li>Helps you to improve your reasoning and decision making skills, hold true beliefs, and be effective at accomplishing your goals.</li>\n<li>Gratifies your intellectual curiosity, deepens your understanding of the world.</li>\n<li>Sparks interesting conversations that lead to new ideas.</li>\n</ul>\n<h2 id=\"user-content-nexy-platform\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#nexy-platform\"><span></span></a>Nexy Platform</h2>\n<blockquote>\n<p>Publishing + Nuanced Discussion + Community</p>\n</blockquote>\n<p>Nexy's purpose is to:</p>\n<ul>\n<li>Help authors to publish and spread high-quality ideas, incentivize people to create content that is deeply interesting rather than fleeting and shallow.</li>\n<li>Help authors to grow their audience and draw attention to their projects.</li>\n<li>Support thoughtful and nuanced discussions.</li>\n</ul>\n<p>This platform is inspired by Hacker News, Indie Hackers, Less Wrong, Ghost, and Medium. I want to turn this project into a powerful tool enabling people to build and grow online publications and communities.</p>\n<p>For now this is still a very early beta, used mainly by myself (<a href=\"/@lumen\">lumen</a>).</p>\n<h2 id=\"user-content-become-an-author\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#become-an-author\"><span></span></a>Become an Author</h2>\n<h3 id=\"user-content-why-write-for-nexy\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#why-write-for-nexy\"><span></span></a>Why write for Nexy</h3>\n<p>Sharing your knowledge is rewarding in itself, it will help you to flesh out your ideas and clarify your thinking. You can also engage in interesting discussions with our community, receive feedback and advice from intelligent people, and build your reputation.</p>\n<p>On top of that, we want to help you spread your ideas and grow your audience:</p>\n<ul>\n<li>The best articles are sent out to our mailing list and shared on our social media accounts.</li>\n<li>Cross-posting is allowed. If you want to publish an article from your own website or a blog - it will have a prominent link (and a canonical url) pointing to the original post, which will send you traffic and help your search engine rankings.</li>\n<li>Calls to action are allowed. High quality articles can contain a CTA at the end, inviting people to check out your product, follow your blog, etc.</li>\n<li>Authors who consistently contribute quality content are allowed to make posts in our \"Showcase\" hub - you can write a post about your project, explain why it will be interesting to our community, and it will be shared with our readers.</li>\n</ul>\n<h3 id=\"user-content-how-to-publish-your-story\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#how-to-publish-your-story\"><span></span></a>How to publish your story</h3>\n<p>To ensure the quality of our content, posting here is invite-only. Write and submit a draft of your post, and it will be published once it has been checked by our editor. After you have successfully published 5 posts, you gain a \"trusted\" status and can publish posts on your own.</p>\n<p>If you want to participate in this project and have a post you think will be interesting to our readers - send me a link.</p>\n<h2 id=\"user-content-advertise\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#advertise\"><span></span></a>Advertise</h2>\n<p>If you want to share your project with a community of smart people interested in startups and technology - send me an email. Only very relevant ads to high-quality products are accepted.</p>\n<h2 id=\"user-content-contact\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#contact\"><span></span></a>Contact</h2>\n<p>If you have any questions, feedback, advice, or want to reach out to me for any reason - feel free to send me an email (<code>lumenwrites@gmail.com</code>), message me on Discord (<code>lumen#7925</code>), or on Twitter (<a href=\"https://twitter.com/lumenwrites\">@lumenwrites</a>).</p>"},{"title":"About","slug":"about","url":"/post/about","tags":[],"description":"","thumbnail":null,"social":null,"comments":null,"relatedPosts":null,"body":"<h1 id=\"user-content-about\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#about\"><span></span></a>About</h1>\n<p>Hi, I'm lumen. Inspired by <a href=\"https://astralcodexten.substack.com/\">Slate Star Codex</a> I'm going to write about things that <a href=\"https://news.ycombinator.com/newsguidelines.html\">gratify my intellectual curiosity</a>.</p>\n<p>I am curious and passionate about startups, technology, science, rationality, webdev, gamedev, digital art, writing (fiction and non-fiction), comedy, creativity, and table-top roleplaying games.</p>\n<h2 id=\"user-content-contact\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#contact\"><span></span></a>Contact</h2>\n<p>Feel free to shoot me a message for whatever reason, I'm not famous enough to be overwhelmed by emails =)</p>\n<p>Email: <code>lumenwrites@gmail.com</code><br>\nDiscord: <code>lumen#7925</code><br>\nTwitter: <a href=\"https://twitter.com/lumenwrites\">@lumenwrites</a></p>"},{"title":"Advertise","slug":"advertise","url":"/post/advertise","tags":[],"description":"","thumbnail":null,"social":null,"comments":null,"relatedPosts":null,"body":"<p>If you want to share your project with a community of smart people interested in startups and technology - send me an email to <a href=\"mailto:lumenwrites@gmail.com\">lumenwrites@gmail.com</a>. Only very relevant ads to high-quality products are accepted.</p>"},{"title":"Write For Us","slug":"write","url":"/post/write","tags":[],"description":"","thumbnail":null,"social":null,"comments":null,"relatedPosts":null,"body":"<h2 id=\"user-content-why-write-for-nexy\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#why-write-for-nexy\"><span></span></a>Why write for Nexy</h2>\n<p>Sharing your knowledge is rewarding in itself, it will help you to flesh out your ideas and clarify your thinking. You can also engage in interesting discussions with our community, receive feedback and advice from intelligent people, and build your reputation.</p>\n<p>On top of that, we want to help you spread your ideas and grow your audience:</p>\n<ul>\n<li>The best articles are sent out to our mailing list and shared on our social media accounts.</li>\n<li>Cross-posting is allowed. If you want to publish an article from your own website or a blog - it will have a prominent link (and a canonical url) pointing to the original post, which will send you traffic and help your search engine rankings.</li>\n<li>Calls to action are allowed. High quality articles can contain a CTA at the end, inviting people to check out your product, follow your blog, etc.</li>\n<li>Authors who consistently contribute quality content are allowed to make posts in our \"Showcase\" hub - you can write a post about your project, explain why it will be interesting to our community, and it will be shared with our readers.</li>\n</ul>\n<h2 id=\"user-content-how-to-publish-your-story\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#how-to-publish-your-story\"><span></span></a>How to publish your story</h2>\n<p>To ensure the quality of our content, posting here is invite-only. Write and submit a draft of your post, and it will be published once it has been checked by our editor. After you have successfully published 5 posts, you gain a \"trusted\" status and can publish posts on your own.</p>\n<p>If you have a story you want to share with our community - send an email to <strong>lumenwrites@gmail.com</strong></p>"},{"title":"Writing Streak Landing","slug":"writing-streak-landing","url":"/post/writing-streak-landing","tags":[],"description":"","thumbnail":null,"social":null,"comments":null,"relatedPosts":null,"body":"<p>Writing Streak is a tool that will help you to write more. It looks like this:</p>\n<p><img src=\"/landing/full-editor.png\" alt=\"\"></p>\n<h3 id=\"user-content-develop-your-daily-writing-habit\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#develop-your-daily-writing-habit\"><span></span></a>Develop your daily writing habit</h3>\n<p>The best way to become a successful writer is to develop a daily writing habit, and the best way to accomplish that is to take on a 30-Day Writing Challenge - commit to writing every day for the next 30 days.</p>\n<p>At the top-left corner of the app you see your Writing Streak:</p>\n<p><img src=\"/landing/writing-streak.png\" alt=\"\"></p>\n<p>It counts how many days in a row you successfully wrote enough words to achieve your writing goal. Your purpose is to make this number grow as high as possible by never breaking your streak.</p>\n<p>I recommend setting a challenging but attainable goal - write 5 days per week (Monday through Friday), at least 250 words evey day. Strive to do it at the same time every day and get into a routine. The app can automatically send you email reminders when it's time to write, and give you some writing prompts and writing lessons that will help you get started.</p>\n<p>Above the editor you see your timeline - a calendar of your last 30 writing days:</p>\n<p><img src=\"/landing/writing-day.png\" alt=\"\"></p>\n<p>Each day shows you how many words you wrote, how close you are to accomplishing your daily goal, and how many minutes you have spent in an uninterrupted flow.</p>\n<h3 id=\"user-content-focused-writing-with-writing-sprints\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#focused-writing-with-writing-sprints\"><span></span></a>Focused writing with Writing Sprints</h3>\n<p>The best way to become a productive writer is to learn how to get into the writing \"flow\" (a state where 100% of your attention is focused on writing), and stay in that state for uninterrupted stretches of time, with short breaks in-between.</p>\n<p>In the top-right corner you see a timer. Set it for 20 minutes, write without interruptions, then take a 10 minute break and repeat.\n<img src=\"/landing/timer.png\" alt=\"\"></p>\n<p>There are two biggest obstacles that the writers face when they try to enter the flow - overthinking and distractions. To overcome both, and turn the process of writing into a fun game, use the sprints feature:\n<img src=\"/landing/healthbar.png\" alt=\"\"></p>\n<p>When you start your timer, your health bar begins to decrease, and the only way to refill it is to keep typing. If you get distracted or stop to think or edit for too long - your health runs out and you lose the sprint. If you manage to keep writing for the whole duration of the sprint without running out of health - you win, and the time gets added to your \"focused time\" stat for the day.</p>\n<p>Strive to gradually increase your focused writing time, remember - you improve what you measure. Start with a 20 minute writing session every morning, once you get used to it - add one more. Keep striving for more daily focused writing sessions as long as it keeps you challenged, but not overwhelmed.</p>\n<h3 id=\"user-content-accountability\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#accountability\"><span></span></a>Accountability</h3>\n<p>Once you have committed to writing regularly, have set an attainable goal, and have all these powerful tools to help you keep going, the only way to fail is to lose motivation and quit. To prevent that - find someone who will keep you accountable.</p>\n<p>On your profile page you see a calendar that displays your writing stats for the whole year:\n<img src=\"/landing/profile.png\" alt=\"\"></p>\n<p>You can keep your posts private if you want, but the calendar is visible to everybody. I highly recommend that you share the link to your profile with your friends, and ask them to keep you accountable. If they notice that you started missing your writing days - have them give you a call or send you a message. You can even make a bet with your friend, say that you'll give them $50 if they notice that you've missed some days. That will motivate you to keep going.</p>\n<h3 id=\"user-content-community\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#community\"><span></span></a>Community</h3>\n<p>Once you're writing regularly, the next step is to increase your writing quality (notice that you should strive to increase quality only <strong>after</strong> you have learned to write regularly and gained some raw skill of just putting words on the page).</p>\n<p>The best things you can do to increase your writing quality are:</p>\n<ul>\n<li>Publishing your work, receiving feedback, and improving your writing based on it.</li>\n<li>Giving feedback to others to get better at editing, and to learn from the successes and mistakes of others.</li>\n</ul>\n<p>Publish your posts in our friendly and supportive community. Leave thoughtful, constructive, and helpful feedback for others. Remember the principle of reciprocity - the more you help other writers to improve their work, the more likely they will be to help you with yours. When someone left you some good feedback - give back, go to their profile and comment on one of their posts.</p>\n<h3 id=\"user-content-build-your-audience\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#build-your-audience\"><span></span></a>Build your audience</h3>\n<p>Like on Reddit, the posts in our community can get upvoted, and the most popular ones rise to the top. The best posts receive the most attention, discussion, and feedback. Keep publishing to build your reputation and grow your audience!</p>\n<p>If you already have a website - you can still write and publish here, your posts here will link to the posts on your website, sending you some traffic and a SEO boost. There's no better way to get your blog posts noticed than sharing them with the community of passionate writers.</p>\n<p>Share your work on social media as well. Our editor also has a feature that allows you to export your posts as images. Export your post, and publish it on Twitter:\n<img src=\"/landing/tweet.png\" alt=\"\"></p>\n<p>This will help you to grow your audience on social media, and start gathering a group of dedicated fans who love to read what you have to say.</p>\n<h3 id=\"user-content-start-writing-now\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#start-writing-now\"><span></span></a>Start writing now!</h3>\n<p>Now it's time to start writing - create an account, and begin your writing streak today!</p>\n<p>You can use this tool for free for the first month - that will be enough to write for 30 days and establish your writing habit. If you end up enjoying our app and community and want to continue - you can subscribe to the premium version for $20/mo.</p>\n<hr>\n<h3 id=\"user-content-discounts\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#discounts\"><span></span></a>Discounts</h3>\n<p>I am offering significant discounts to people who regularly post high quality articles in our community, give others great feedback that helps them to get better, or share this project with their own audience to help me to promote this app. Send me an email if you're interested.</p>\n<p>Get a 50% discount if:</p>\n<ul>\n<li>You publish 10 high quality articles about writing, and share them on social media.</li>\n<li>Your posts and comments gain 500 upvotes in total.</li>\n<li>You have an audience of more than 5000 people and you share with them an honest review of this project.</li>\n<li>You're a teacher and you want your students to use this app for your course - I can offer discounts for multiple student accounts.</li>\n</ul>\n<p>Also if you want to become an affiliate and make some money by helping me to promote this project - let me know.</p>\n<h3 id=\"user-content-contact-questions-and-feedback\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#contact-questions-and-feedback\"><span></span></a>Contact, questions, and feedback</h3>\n<p>If you have any questions or feedback - send me an email to <strong>lumenwrites@gmail.com</strong>.</p>\n<p>This project is still in active development. If you notice any issues - let me know about them, it will really help me to fix them quickly. If you can think of a feature that would make this tool more useful for you and others - it's likely that I'll be able to add it to the app. Don't hesitate to contact me!</p>\n<p>&#x3C;--\nviral incentives and quality content incentives.\n10 most active users of the month (leaderboard) get the next month for free.\nGet to the top 10 in our leaderboard? Get the app for free. Get 1000 karma - get a half price discount. Share it on social media to your community - same thing.\nfigure our how to quantify what I mean by \"quality posts\" or \"great feedback\".\nIf you post 10 high quality articles about writing, you get 50% discount.\nIf you post x and do y - you get a free lifetime account.\nIf you have an audience of more than 5000 people and share with them - an honest review of this project - you get a free lifetime account.\nI can also offer free lifetime accounts to people who are exceptionally helpful to this project, if you have good ideas - let me know.\n--></p>"}]