[{"title":"About Nexy","slug":"about-nexy","url":"/post/about-nexy","tags":[],"description":"","thumbnail":null,"social":null,"comments":null,"relatedPosts":null,"body":"# About\nI want Nexy to become a community of makers - startup founders, developers, designers, writers. I want it to become a place where smart and creative people share their knowledge, get to know each other, exchange feedback and advice, help each other to get better at their craft, and showcase their projects.\n\nFor now this is still a very early beta, used mostly by myself ([lumen](/lumen)). I write about things that I'm curious and passionate about - startups, technology, webdev, gamedev, rationality, creativity, and writing. I write about things that [gratify my intellectual curiosity](https://news.ycombinator.com/newsguidelines.html), and try to create articles that smart and creative people would find interesting.\n\nThis platform is inspired by Reddit, Hacker News, Indie Hackers, Less Wrong, Medium, Ghost, and Dev.to. If I'm successful, it will become a great tool empowering people to build communities like this one.\n\nIf you have any questions, feedback, advice, or want to reach out to me for any reason - feel free to send me an email (`lumenwrites@gmail.com`), message me on Discord (`lumen#7925`), or on Twitter [@lumenwrites](https://twitter.com/lumenwrites).\n\nFor now, posting here is invite-only. If you want to participate in this project and have a post you think will be interesting to our readers - send me a link.\n\n"},{"title":"About","slug":"about","url":"/post/about","tags":[],"description":"","thumbnail":null,"social":null,"comments":null,"relatedPosts":null,"body":"# About\nHi, I'm lumen. Inspired by [Slate Star Codex](https://astralcodexten.substack.com/) I'm going to write about things that [gratify my intellectual curiosity](https://news.ycombinator.com/newsguidelines.html).\n\nI am curious and passionate about startups, technology, science, rationality, webdev, gamedev, digital art, writing (fiction and non-fiction), comedy, creativity, and table-top roleplaying games.\n\n## Contact\nFeel free to shoot me a message for whatever reason, I'm not famous enough to be overwhelmed by emails =)\n\nEmail: `lumenwrites@gmail.com`  \nDiscord: `lumen#7925`  \nTwitter: [@lumenwrites](https://twitter.com/lumenwrites)"}]