[
  {
    "title": "Ways to Invent Endless Content Ideas",
    "slug": "endless-ideas",
    "url": "/post/endless-ideas",
    "tags": [
      {
        "name": "Writing",
        "slug": "writing"
      },
      {
        "name": "Ideas",
        "slug": "ideas"
      }
    ],
    "description": "This is my collection of ways to come up with an unlimited number of ideas for your blog posts, youtube videos, podcast episodes, articles, and so on.",
    "thumbnail": null,
    "social": "/illustrations/post/endless-ideas/social.png",
    "comments": "https://twitter.com/lumenwrites/status/1461555951035637765",
    "relatedPosts": [
      "value-arbitrage"
    ],
    "body": "<p>This is my collection of strategies for coming up with an unlimited number of content ideas. You can use them for your posts, youtube videos, podcast episodes, and so on.</p>\n<h3 id=\"user-content-project-based-ideas\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#project-based-ideas\"><span></span></a>Project-based ideas</h3>\n<p>Work on interesting projects, pursue challenging goals, and overcome obstacles on your path. Solving interesting challenges inevitably leads to original insights and epiphanies you can share with people.</p>\n<p>Create how-to's and step-by-step tutorials, guide people through building a similar project (or a feature of the project you've built).</p>\n<h3 id=\"user-content-learn-by-teaching\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#learn-by-teaching\"><span></span></a>Learn by teaching</h3>\n<p>You don't have to be an expert in order to teach - study a subject you're interested in, try to develop a skill, keep notes, and share everything you're learning. If the ideas you're learning are useful to you, they will be useful to other people.</p>\n<p>Many people even prefer to learn from the beginners, because as a beginner you will find it easier to relate to other beginners - you will be able to notice the most relevant problems and explain things in a more accessible way.</p>\n<h3 id=\"user-content-organize-your-notes\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#organize-your-notes\"><span></span></a>Organize your notes</h3>\n<p>You can simply organize your old notes. I keep a file where I write down all the interesting ideas I learn, insightful thoughts that occur to me, anything I want to be able to remember later.</p>\n<p>This is very helpful, because when I want to write - I don't have to invent anything on the spot, I can just organize my old notes. If I found an idea insightful enough to write down, it is probably worth sharing with people.</p>\n<h3 id=\"user-content-ideas-based-on-reading\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#ideas-based-on-reading\"><span></span></a>Ideas based on reading</h3>\n<p>Get used to consuming high quality content - read books, watch video courses, watch interviews with smart people, listen to podcasts.</p>\n<p>Write down the most interesting ideas in your own words, and organize them into <a href=\"/post/evergreen-atomic-notes\">Evergreen Atomic Notes</a>.</p>\n<p>Then you can curate the most useful takeaways from multiple sources, combine these notes into longer posts.</p>\n<p>For even more ideas, you can look at the book titles, course titles, and the chapter titles for inspiration - most of them are excellent topics for a post.</p>\n<h3 id=\"user-content-research-based-ideas\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#research-based-ideas\"><span></span></a>Research-based ideas</h3>\n<p>When you're consuming good content, you're doing it passively, going wherever your curiosity leads you, learning whatever the books teach you.</p>\n<p>But you can also pick a topic you're interested in, and deliberately research it - read wiki articles, blog posts, forum threads, and watch youtube videos. Write down the most insightful ideas, summarize them, and share them.</p>\n<h3 id=\"user-content-explain-complicated-subjects\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#explain-complicated-subjects\"><span></span></a>Explain complicated subjects</h3>\n<p>Look for ideas that are complex, difficult to understand, or explained in a very dry and boring way. If you go through the work of understanding them - you can make them accessible, concise, engaging, and fun. This will be very valuable to people.</p>\n<h3 id=\"user-content-make-connections\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#make-connections\"><span></span></a>Make connections</h3>\n<p>Develop an expertise in different areas that aren't usually connected, and find ways to <a href=\"/post/value-arbitrage\">value arbitrage</a> between them - make interesting associations, apply useful ideas from one field to another.</p>\n<p>This often leads to original insights and interesting inventions. Every time you learn a new idea, ask yourself - how does it apply to the fields I already know, does it solve any problems that I'm aware of?</p>\n<p>For example, my post on <a href=\"/post/writing-like-product\">how writing is similar to startups</a>. Another example - coming up with ideas for Godot tutorials by browsing popular tutorials made for other game engines (like Unity).</p>\n<h3 id=\"user-content-copy-what-already-works\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#copy-what-already-works\"><span></span></a>Copy what already works</h3>\n<p>If you're looking to create popular content, you can just find what already works well, and copy it.</p>\n<p>Find the most popular blogs, subreddits, and youtube channels in your niche.</p>\n<p>Browse their most popular posts and videos.</p>\n<ul>\n<li>Use the <a href=\"https://analytics.moz.com/pro/link-explorer/top-pages\">Moz Link Explorer</a> tool to find the most popular pages on a website.</li>\n<li>Enter <code>site:thewebsite.com</code> into Reddit's search function and sort by top to find the most popular posts submitted to Reddit (and the communities where you can submit your own posts later on).</li>\n<li>Sort youtube channel's videos (or the search results) by the number of views.</li>\n</ul>\n<p>See if you can come up with your own take on these ideas, or do them better. Combine the best ideas and turns of phrase from multiple sources, add some insights they're missing, correct some mistakes and misconceptions they have.</p>\n<h3 id=\"user-content-inaccessible-sources\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#inaccessible-sources\"><span></span></a>Inaccessible Sources</h3>\n<p>Teach what you're learning from sources not easily accessible to others.</p>\n<ul>\n<li>Invest in expensive high quality courses, and teach what you've learned from them.</li>\n<li>Attend real-life courses and live events, take notes, and report what happened there.</li>\n<li>Teach what you're learning from your school, bootcamp, or a university.</li>\n<li>If you're bilingual - teach what you've learned from the resources available only in a different language.</li>\n<li>Find interesting gems of information in unpopular, obscure, old, forgotten, boring, or controversial sources. Make them popular, accessible, easy to discover.</li>\n</ul>\n<h3 id=\"user-content-summarize\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#summarize\"><span></span></a>Summarize</h3>\n<p>Take large amounts of content and summarize them. For example - <a href=\"https://www.jaakkoj.com/blog/graham\">Paul Graham 101</a>, a guy who has read all of the PG's essays and summarized them.</p>\n<h3 id=\"user-content-answer-community-questions\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#answer-community-questions\"><span></span></a>Answer Community Questions</h3>\n<p>Help people in online communities.</p>\n<p>Find the popular communities in your niche. Go to Discord servers, subreddits, forums in your niche, StackExchange sites, and see what problems people are dealing with, look for frequently asked questions.</p>\n<p>Answer their questions using your own expertise or research, and share your answers with your audience.</p>\n<p>As a side benefit, this will help you to promote your content - you can always write down your answer as a blog post or create a video tutorial, and share it as a reply to the question - people will appreciate it.</p>\n<p>You can also do an AMA. If you're doing something interesting - create \"Ask me Anything\" threads on subreddits or twitter, or encourage people to email you their questions. Share your best answers.</p>\n<h3 id=\"user-content-answer-your-own-questions\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#answer-your-own-questions\"><span></span></a>Answer Your Own Questions</h3>\n<p>Keep the list of your own questions you're confused about, things you would like to learn, concepts you don't understand, and the problems you're facing.</p>\n<p>Make posts in communities, and ask people for help. Every time you find a solution - summarize the most useful replies, or explain what you figured out on your own.</p>\n<h3 id=\"user-content-target-the-general-audience\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#target-the-general-audience\"><span></span></a>Target the general audience</h3>\n<p>What aspects of the topic you're an expert in could you make interesting and accessible to a layman?</p>\n<p>Share what you find interesting about those things, educate people, explain why these topics are important, get other people excited about them.</p>\n<p>Once they're interested in your subject, you can explain to them how to get started with it:</p>\n<h3 id=\"user-content-create-content-for-beginners\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#create-content-for-beginners\"><span></span></a>Create content for beginners</h3>\n<p>Think about the difference between you now, and the version of yourself from 10 years ago. What are the most important things you'd like to tell yourself?</p>\n<ul>\n<li>How would you help yourself to learn what you know now?</li>\n<li>What are some things you wish you'd learn sooner?</li>\n<li>What are some common mistakes and pitfalls you wish you could avoid?</li>\n</ul>\n<h3 id=\"user-content-educate-a-different-niche\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#educate-a-different-niche\"><span></span></a>Educate a different niche</h3>\n<p>Find a group of people who would benefit from the ideas in your field, who aren't already in your field. Make posts like \"UI Design for Developers\", \"Sales for Developers\", or \"Math for Digital Artists\", or \"Social Skills for Engineers\".</p>\n<h3 id=\"user-content-build-in-public-devlogs\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#build-in-public-devlogs\"><span></span></a>Build in public, devlogs</h3>\n<p>Work on something cool and share your progress. Game developers create devlogs about the projects they're working on, see if you can apply something like that to your own niche.</p>\n<h3 id=\"user-content-behind-the-scenes\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#behind-the-scenes\"><span></span></a>Behind the scenes</h3>\n<p>Do postmortems, retrospectives, share success stories.</p>\n<ul>\n<li>Once you have finished a big project you're proud of - share what you've learned from it.</li>\n<li>If your project has failed - share your mistakes.</li>\n<li>Explain how you've managed to achieve some unusual result (made money with a simple project, grew your project quickly, found a life hack that improved your life, etc.)</li>\n<li>Share any interesting or unexpected details that went into building your project.</li>\n</ul>\n<h3 id=\"user-content-case-studies\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#case-studies\"><span></span></a>Case Studies</h3>\n<p>Go on forums and offer people to give them feedback on their projects, articles, landing pages, portfolios, etc.</p>\n<p>Create posts where you combine multiple case studies and show common patterns - what did these people do well, what kind of mistakes do they make.</p>\n<h3 id=\"user-content-personal-experiments\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#personal-experiments\"><span></span></a>Personal Experiments</h3>\n<p>Create \"I did x for a month and here's what happened.\" type posts.</p>\n<h3 id=\"user-content-new-small-or-rapidly-evolving-niches\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#new-small-or-rapidly-evolving-niches\"><span></span></a>New, small, or rapidly evolving niches</h3>\n<p>Be on the cutting edge of rapidly evolving fields like webdev, gamedev, VR, AI, crypto, digital art, etc.</p>\n<p>These fields change rapidly, new ideas, frameworks, and tools appear every month. You can research them, discover better ways to use them, or just help other people to stay up to date.</p>\n<p>The new subjects often don't have a lot of content written about them (not much competition), and have a lot of interest and hype around them - perfect combination for creating popular content.</p>\n<p>They also often have a lot of low-hanging-fruit ideas - ways you can contribute to the development of the field with your own original ideas and research (which you can also share).</p>\n<p>All of the above also applies to novel or niche interests and weird hobbies, like sharing clever strategies for a new video game that just came out. Look for new cool things to be interested in, get excited about them, participate in small but passionate communities, share what you've discovered.</p>\n<h3 id=\"user-content-keep-the-snippets-file\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#keep-the-snippets-file\"><span></span></a>Keep the Snippets file</h3>\n<p>If you're a programmer or a technical writer - keep the file where you collect the useful code snippets.</p>\n<p>Notice when you're googling the same subject multiple times, or finding yourself copy-pasting similar code over and over again. Organize the related snippets into a post.</p>\n<p>List all the cool tricks and little hacks that may not be obvious to other people.</p>\n<h3 id=\"user-content-artifacts-and-assets\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#artifacts-and-assets\"><span></span></a>Artifacts and Assets</h3>\n<p>Share the things you've developed as a side effect of working on your projects. Share Figma design systems, models you've made for your game, pitch deck for your startup. Maybe even open source your code entirely.</p>\n<h3 id=\"user-content-interview-people\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#interview-people\"><span></span></a>Interview people</h3>\n<p>Find people who are more experienced or successful than you, send them cold emails or tweets, ask if they would like to do an interview and answer some questions.</p>\n<p>This will be easier to do when your blog/channel/podcast becomes somewhat popular, because then you are offering people to share their ideas with a larger audience, which is more appealing.</p>\n<p>While your audience is small - you can talk to your peers, bloggers, people you met on social media, anyone on your level who's worth learning from. Normal people often appreciate if you invite them to an interview and ask them questions about their area of expertise.</p>\n<h3 id=\"user-content-analyze-successful-products-and-people\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#analyze-successful-products-and-people\"><span></span></a>Analyze successful products (and people)</h3>\n<p>Take an already existing and successful product and explain how it's been made. Find people who are succeeding at some challenging task, and try to figure out how they're doing it, explain what makes them successful.</p>\n<p>For example <a href=\"https://www.youtube.com/c/everyframeapainting\">Every Frame a Painting</a> makes video essays analyzing movies, <a href=\"https://www.youtube.com/c/MarkBrownGMT/videos?view=0&#x26;sort=p&#x26;flow=grid\">Game Maker's Toolkit</a> analyzes the mechanics of popular games, <a href=\"https://www.youtube.com/c/Charismaoncommand\">Charisma on Command</a> explains what makes popular characters and celebrities charismatic.</p>\n<h3 id=\"user-content-make-predictions\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#make-predictions\"><span></span></a>Make Predictions</h3>\n<p>Do you have any useful insights about what will happen in several months or years? Register your predictions of things to come by writing about it, analyze the data, make an argument for your case.</p>\n<p>As a side benefit this will help you to sharpen your prediction and decision making skills - you will be motivated to try to figure out in advance what will happen, and will be easily able to see and analyze your mistakes, improving your world model.</p>\n<h3 id=\"user-content-industry-news\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#industry-news\"><span></span></a>Industry news</h3>\n<p>Do a summary of the most important things that happened in your niche during the last week or month. New cool features in your game engine, new cool startups that have been launched, new research papers that have been published.</p>\n<p>Some good examples - <a href=\"https://www.youtube.com/c/gamefromscratch/videos?view=0&#x26;sort=p&#x26;flow=grid\">GameFromScratch</a> makes videos about the news in gamedev industry, <a href=\"https://www.youtube.com/c/K%C3%A1rolyZsolnai/videos?view=0&#x26;sort=p&#x26;flow=grid\">TwoMinutePapers</a> summarizes the new and exciting AI research papers.</p>\n<h3 id=\"user-content-useful-lists-and-resources\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#useful-lists-and-resources\"><span></span></a>Useful Lists and Resources</h3>\n<p>Compile the lists of the best tools, books, courses, youtube channels, links, places to promote your startup, etc. Describe them briefly, make recommendations, explain why people should check them out. For example, my <a href=\"https://godotacademy.io/best-godot-engine-tutorials\">top godot youtube channels</a> project.</p>\n<h3 id=\"user-content-keyword-research\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#keyword-research\"><span></span></a>Keyword Research</h3>\n<p>Use SEO keyword research tools or the auto-suggestions you get when you type something into a youtube search bar.</p>\n<p>They will help you to understand what people are actively looking for, and help you to create content you know will be in demand.</p>\n<h3 id=\"user-content-reviews\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#reviews\"><span></span></a>Reviews</h3>\n<p>Review popular books, courses, products, tools. Create \"X vs Y\" posts where you compare two alternatives and share pros and cons of each.</p>\n<h3 id=\"user-content-reactions\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#reactions\"><span></span></a>Reactions</h3>\n<p>Keep an eye for things that are popular but incorrect, common mistakes, misconceptions, false beliefs.</p>\n<p>Look for articles, books, or videos that you disagree with. Explain why they are wrong, make a good argument.</p>\n<p>As a side benefit, this will encourage you to challenge your beliefs and look for good counter arguments. If they change your opinion - even better, explain why you used to have a false belief and share what you've learned.</p>\n<h3 id=\"user-content-strong-opinions\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#strong-opinions\"><span></span></a>Strong Opinions</h3>\n<p>Share strong opinions. Even if you invent an opinion for the sole sake of argument, boldly sharing a strong opinion is <a href=\"https://sive.rs/d1u\">very useful</a> to others. Those who were undecided or ambivalent can just adopt your stance, but those who disagree can solidify their stance by arguing against yours.</p>\n<h3 id=\"user-content-thinking-on-paper\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#thinking-on-paper\"><span></span></a>Thinking on Paper</h3>\n<p>When you have some question that confuses you or inspires your curiosity - write an essay about it. Try to organize your thoughts and come up with an answer as you go, use the process of writing to help you organize and clarify your thoughts.</p>\n<h3 id=\"user-content-share-more-ideas\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#share-more-ideas\"><span></span></a>Share more ideas</h3>\n<p>Did I miss anything? Share your approaches and strategies in the comments!</p>"
  },
  {
    "title": "Business advice for software developers",
    "slug": "business-advice-for-software-developers",
    "url": "/post/business-advice-for-software-developers",
    "tags": [
      {
        "name": "Startup",
        "slug": "startup"
      }
    ],
    "description": "My favorite takeaways from an amazing Ask HN thread where technical founders shared the most important things they have learned from building a business.",
    "thumbnail": null,
    "social": "/illustrations/post/business-advice-for-software-developers/social.png",
    "comments": "https://twitter.com/lumenwrites/status/1461491884325494793",
    "relatedPosts": [
      "invent-the-future-from-the-future"
    ],
    "body": "<p>Today I want to share with you my favorite takeaways from an amazing <a href=\"https://news.ycombinator.com/item?id=14146850\">Ask HN thread</a> where technical founders have shared the most important things they have learned from building a business.</p>\n<h3 id=\"user-content-understand-your-customers\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#understand-your-customers\"><span></span></a>Understand your customers</h3>\n<blockquote>\n<p>Most companies fail because they build something no one wants.</p>\n</blockquote>\n<p>Figure out who you are selling to and what problem you’re solving for them <strong>before</strong> you build anything. Forget the code, find the market first. <strong>Talk to your customers</strong>. Ideally, <strong>solve your own problem</strong>, but if you are not the target market - you need to find a domain expert who will join your team prior to the MVP creation.</p>\n<h3 id=\"user-content-build-an-mvp\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#build-an-mvp\"><span></span></a>Build an MVP</h3>\n<p>Build the smallest viable version of your product and test it as early as possible, get it in front of customers as quickly as you can, and get them to pay you.</p>\n<p>Often all you need is a landing page to measure the interest. Create a static website describing the problem and the solution, add a signup form, drive traffic to it with Facebook or Google ads, see how many people will sign up.</p>\n<p>Skip everything nonessential at the start. Focus on the key features that customers will pay for. It will feel broken, but it’s only broken if you can’t get any customers. When you find the right product formula and need to scale, you’ll probably need to refactor or rewrite large parts of it anyway.</p>\n<p>Do things that don’t scale. Don’t future proof your MVP, just make it so you can validate that your product has a market.</p>\n<h3 id=\"user-content-master-marketing\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#master-marketing\"><span></span></a>Master marketing</h3>\n<p><strong>Only 20–40% of running a successful software development business consists of developing software.</strong> A developer with marketing skills can build products and achieve revenues far in excess of their skill set.</p>\n<blockquote>\n<p>A software developer with complete code and no customers is just a software developer. A business person with tons of customers and no software/product is in business.</p>\n</blockquote>\n<p>Your brand, reputation, and intellectual property are 100x more valuable than any software or technical feat. Software and technical work is relatively cheap. It cannot be the basis of your business because someone can come in and clone your product after you’ve done the hard work of introducing an innovative product and establishing/educating the market. If another product has only half of your functionality, but more substantive marketing, it’s more than enough for them to win.</p>\n<h3 id=\"user-content-do-not-be-seduced-by-the-technology\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#do-not-be-seduced-by-the-technology\"><span></span></a>Do not be seduced by the technology</h3>\n<p>Customers don’t care about the shiny new tech, what matters is solving their problem. Often it is much easier to do with an old and proven technology, because new tech changes rapidly, is less stable, has fewer learning resources and developers.</p>\n<blockquote>\n<p>Sometimes devs don’t realize that the hardest parts of starting and growing a business have nothing to do with code or the tech stack you choose. Marketing, getting and retaining customers and everything else in between is way harder than writing code.</p>\n</blockquote>\n<p>Focus on your differentiation and competitive advantages, going stock with <em>everything</em> else.</p>\n<h3 id=\"user-content-delegate\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#delegate\"><span></span></a>Delegate</h3>\n<p>Your time is valuable, the time you spend doing a task is the time you can’t spend doing anything else. So focus on doing the things you’re best at, and outsource everything else.</p>\n<blockquote>\n<p>Write a job application from yourself for each of the jobs your startup needs to get done. Contemplate why on earth you would ever hire yourself for the job.</p>\n</blockquote>\n<p>Work out exactly what tasks there are in running your business that you are not an expert at, such as accounting, sales, copywriting, etc. and hire people to do those parts for you.</p>\n<h3 id=\"user-content-set-revenue-targets\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#set-revenue-targets\"><span></span></a>Set revenue targets</h3>\n<p>Plan for profitability, set goals, and be realistic about whether you are successfully accomplishing them. If you don’t, you might have built a good side project, but not a startup.</p>\n<blockquote>\n<p>Aim to get your company to 10k USD monthly product revenue within three months after launch (that’s basically a limit of ramen profitability for a small team of 2–4, plus a little bit of extra to run the business).</p>\n</blockquote>\n<p>If you can’t, then either the product, the target market, or the team needs to be revised drastically. This is a great way to frame the product launch by forcing you to ask hard questions about what you’re doing.</p>\n<p>It’s also useful as a pricing yardstick early on. If you have very few customers, they need to be paying enough that you reach $10k almost immediately. If your product isn’t worth that much, then you need to scale out. It’s best to figure this out right from the start.</p>\n<p>If it feels like you can’t do $10k MRR in three months on your own, then you need to find a cofounder who can do it together with you… So it’s a good way to calibrate cofounder expectations as well.</p>\n<h3 id=\"user-content-other-great-points\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#other-great-points\"><span></span></a>Other great points</h3>\n<ul>\n<li>Being good at talking to people and networking is important.</li>\n<li>A good reputation and word-of-mouth is better than buying the #1 spot on Adwords.</li>\n<li><strong>Fire bad clients</strong>. They aren’t worth the stress, frustration, and opportunity cost.</li>\n<li>Learn to say “no” to feature requests that don’t fit.</li>\n<li>Don’t forget to <strong>take care of yourself</strong>. It’s a marathon, not a sprint. Sleep, exercise, eat healthy food.</li>\n<li>Be patient. It will take longer than you think.</li>\n<li><strong>Work on your process</strong>. Doing an hour of client works earns you one hour of revenue. Improving your agency processes can earn you a large multiple of that.</li>\n<li>Figure out how to <strong>sell again and again to the same customers</strong>, otherwise you will have a high cost of customer acquisition.</li>\n<li>Don’t let a single customer account for more than 10% of your revenue. If that customer leaves, you’ll be in a painful situation.</li>\n<li>Banks will loan you money when you don’t need it and won’t loan money when you do need it. Apply for a loan or line of credit when you’re flush with cash in case of a rainy day.</li>\n<li>Don’t hire too quickly. Payroll + benefits can eat through profits like crazy in a software business.</li>\n<li><strong>Build simple products that do one thing well</strong>.</li>\n<li>Don’t take money from anyone who can’t afford to lose it</li>\n<li>Don’t hire a ‘marketing’ firm. They will charge 10’s of thousands of dollars to ask you questions like ‘What do you think we should do?’ and then feed it back to you. If the product is positioned well with customers, you know more than the marketing company ever will.</li>\n<li><strong>Failures (at least small ones) are not a problem. Failing to recover is.</strong></li>\n<li>Start now, you’ll never feel ready. Just go, learn, and repeat. <strong>Action is king.</strong></li>\n</ul>"
  },
  {
    "title": "Format your writing for Readability",
    "slug": "format-your-writing-for-readability",
    "url": "/post/format-your-writing-for-readability",
    "tags": [
      {
        "name": "Writing",
        "slug": "writing"
      }
    ],
    "description": "My small collection of formatting tips that will make your posts more engaging and easy to read.",
    "thumbnail": null,
    "social": "/illustrations/post/format-your-writing-for-readibility/social.jpg",
    "comments": "https://twitter.com/lumenwrites/status/1468655764743016451",
    "relatedPosts": [
      "on-writing-well"
    ],
    "body": "<h3 id=\"user-content-divide-things-into-small-chunks\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#divide-things-into-small-chunks\"><span></span></a>Divide things into small chunks</h3>\n<p>Nobody likes walls of text.</p>\n<ul>\n<li>Split your post into sections, use headings to make them skimmable.</li>\n<li>For very long posts, split your sections into subsections.</li>\n<li>Split your paragraphs into smaller paragraphs.</li>\n<li>Use bulleted lists when possible.</li>\n</ul>\n<blockquote>\n<p>People are much happier to read a long thing if they can be tricked into thinking it’s a series of small things.</p>\n</blockquote>\n<p>Small sections are easy to read, easy to remember, and finishing each one gives readers a satisfying sense of accomplishment.</p>\n<h3 id=\"user-content-add-variety\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#add-variety\"><span></span></a>Add variety</h3>\n<p>People get bored when they focus on the same thing for too long.</p>\n<p><strong>Break up the monotony</strong> - vary the sentence and paragraph lengths to create rhythm, use illustrations, diagrams, links, and quotes. <strong>Bold</strong> or <em>italicize</em> some words to simulate intonation.</p>\n<p><strong>Vary the tone and types of content</strong>: explain an abstract concept, give an interesting concrete example, discuss a case study, make a silly joke, use a metaphor, ask a question, address a counterargument, tell a story.</p>\n<h3 id=\"user-content-make-ideas-flow-into-each-other\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#make-ideas-flow-into-each-other\"><span></span></a>Make ideas flow into each other</h3>\n<p>The purpose of each sentence is to get people to read the next sentence. Use words like <em>“and”</em>, <em>“so”</em>, <em>“therefore”</em>, <em>“for example”</em>, <em>“but”</em>, <em>“also”</em> to connect the paragraphs and prompt people to continue reading. For example:</p>\n<blockquote>\n<p><em>It’s pretty obvious that X is true, and we have lots of evidence for this: First, [A]. Second, [B]. Third, [C].</em></p>\n<p><em>Now, some people say X, but that’s wrong. It only looks like X, because Y. And yet,</em> we continue to Z_, for example R. So_, what you need is…</p>\n</blockquote>\n<h3 id=\"user-content-read-your-post-aloud\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#read-your-post-aloud\"><span></span></a>Read your post aloud</h3>\n<p>And remove everything that’s difficult to read, makes you stumble, or doesn’t sound like something you’d say in a conversation.</p>"
  },
  {
    "title": "Invent the Future from the Future",
    "slug": "invent-the-future-from-the-future",
    "url": "/post/invent-the-future-from-the-future",
    "tags": [
      {
        "name": "Startup",
        "slug": "startup"
      },
      {
        "name": "Ideas",
        "slug": "ideas"
      }
    ],
    "description": "My key takeaways from “How to Invent the Future”, a brilliant lecture by Alan Kay at Startup School.",
    "thumbnail": null,
    "social": "/illustrations/post/invent-the-future-from-the-future/social.png",
    "comments": "https://twitter.com/lumenwrites/status/1463250099438555151",
    "relatedPosts": [
      "value-arbitrage",
      "business-advice-for-software-developers"
    ],
    "body": "<p>My key takeaways from “<a href=\"https://www.youtube.com/watch?v=id1WShzzMCQ\">How to Invent the Future</a>”, a brilliant lecture by Alan Kay at Startup School:</p>\n<p>Focus not just on problem solving, but on <strong>problem finding</strong>. You can be sure that 95% of everything we do is wrong, inefficient, and will be changed in the future, but it’s hard to see that from now.</p>\n<p>Instead of innovating out from the present, invent the future from the future. <strong>Imagine the world 30 years from now</strong>. Think “Wouldn’t it be ridiculous if we didn’t have this?”. Take this initial glimmer of an idea so far out that you don’t have to worry how you get there. Then bring it back closer to the present, <strong>identify an achievable and realistic step towards it</strong>.</p>\n<p>Try to see technology of today as the punch card machines in the 70s, and try to replace them with Apple II.</p>\n<p>Strive to really advance something very important. Something worth dedicating your life to. Pursue grand visions, not goals.</p>\n<p>Because it is difficult, <strong>focus on milestones, not deadlines</strong>. Deadlines can be missed, and are hard to set up realistically when you’re doing something that’s never been done before. Milestones are inspiring to reach, and it’s more encouraging to go from one milestone to another in pursuit of a long term goal.</p>\n<p>Don’t worry about having the perfect batting average. Total number of successes matters, not success/failure ratio. Failure is just overhead — an expected cost of trying to do hard things.</p>"
  },
  {
    "title": "On Writing Well",
    "slug": "on-writing-well",
    "url": "/post/on-writing-well",
    "tags": [
      {
        "name": "Writing",
        "slug": "writing"
      }
    ],
    "description": "My key takeaways from \"On Writing Well\".",
    "thumbnail": null,
    "social": "/illustrations/post/on-writing-well/social.jpg",
    "comments": "https://twitter.com/lumenwrites/status/1468318655851155463",
    "relatedPosts": [
      "evergreen-atomic-notes"
    ],
    "body": "<h3 id=\"user-content-write-like-you-speak\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#write-like-you-speak\"><span></span></a>Write like you speak</h3>\n<p>Write the way you talk - naturally. \"Finding your writing voice\" is a waste of time, you already have your voice - the one you use every day. Never say in writing what you wouldn’t comfortably say in a conversation.</p>\n<p>Avoid fakeness, don’t be ornate or pretentious, <strong>don’t try to impress people with your vocabulary - impress them with your ideas</strong>.</p>\n<h3 id=\"user-content-keep-it-simple\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#keep-it-simple\"><span></span></a>Keep it simple</h3>\n<p>Use simple language. Explain the concepts in a way that a smart 8th grader could understand. If you can’t explain it simply - you don’t understand it.</p>\n<h3 id=\"user-content-be-brief\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#be-brief\"><span></span></a>Be Brief</h3>\n<p>Use short words, short sentences, short paragraphs. Cut the words that serve no function. Avoid fluff, get to the point. 99% of the books should be blog posts, 99% of the blog posts should be tweets.</p>\n<h3 id=\"user-content-be-clear\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#be-clear\"><span></span></a>Be Clear</h3>\n<p>Know what you want to express and then express it. Know your audience, find the shortest path taking them from where you are to where you want them to be. Use it as your outline.</p>\n<h3 id=\"user-content-write-with-conviction\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#write-with-conviction\"><span></span></a>Write With Conviction</h3>\n<p>Strong opinions are very useful to others. People who are undecided can just adopt your stance, people who disagree can solidify their stance by arguing against yours.</p>\n<h3 id=\"user-content-read-it-aloud\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#read-it-aloud\"><span></span></a>Read it Aloud</h3>\n<p>When you’re done writing - wait to publish until the next morning. Read everything aloud before you publish it: simplify the awkward phrases, cut boring parts, fix everything that doesn't sound like conversation.</p>"
  },
  {
    "title": "Value Arbitrage",
    "slug": "value-arbitrage",
    "url": "/post/value-arbitrage",
    "tags": [
      {
        "name": "Startup",
        "slug": "startup"
      },
      {
        "name": "Ideas",
        "slug": "ideas"
      }
    ],
    "description": "Generate value and ideas by cross-applying patterns between the different fields.",
    "thumbnail": null,
    "social": "/illustrations/post/value-arbitrage/social.png",
    "comments": "https://twitter.com/lumenwrites/status/1463250944821538819",
    "relatedPosts": [],
    "body": "<p>This is an extremely useful idea that I've learned just recently. In finance, \"arbitrage\" means buying and selling things in different markets to take the advantage of difference in price. Like buying a toy in India for $15, and then selling it for $25 in the US.</p>\n<p>Turns out, you can arbitrage not just products, but also information, knowledge, skill, or even human relationships.</p>\n<p>For example, let's say you have met two amazing people who don't know each other. When you introduce them to each other, you generate a massive amount of value for both of them essentially out of nothing - you have given each of them a gift of knowing someone great.</p>\n<p>Another example, is arbitraging information. Eliezer Yudkowsky have learned a lot about rationality and human biases from the books he has read, and then parlayed it into his blog, and later a Harry Potter fanfiction - and that has generated a huge amount of value to the people on the internet, who would never have been exposed to these ideas otherwise.</p>\n<p>You can also arbitrage skills. That simply means applying good ideas you have learned in one field to a completely different one. I'm constantly applying the skills and ideas I've learned as a 3D artist to my programming process, and, surprisingly, the ideas I've learned from programming are making me a much better artist.</p>\n<p>Finally, an unexpected idea that I have discovered, is that you can arbitrage fiction tropes. You can take a trope you have seen in one story, apply it to a completely different genre, and it will create a new and interesting idea. You can take a scifi trope and set it in a fantasy world, or you can take a plot structure from a dramatic tv show and use it in your comedy script.</p>\n<p>Smart ideas are often universal. Learn a mental pattern in one field - and apply it elsewhere. Every time I have an epiphany in one of my crafts, I intentionally go through each of the other fields I'm interested in and apply it there. This has helped me to generate a lot of very interesting ideas.</p>"
  },
  {
    "title": "Write Evergreen Atomic Notes",
    "slug": "evergreen-atomic-notes",
    "url": "/post/evergreen-atomic-notes",
    "tags": [
      {
        "name": "Writing",
        "slug": "writing"
      },
      {
        "name": "Obsidian",
        "slug": "obsidian"
      }
    ],
    "description": "Turn your notes into posts that are useful, easy to write, easy to discover,  fun to read, and add up to productive output.",
    "thumbnail": null,
    "social": "/illustrations/post/evergreen-atomic-posts/social.png",
    "comments": "https://twitter.com/lumenwrites/status/1461358100657545227",
    "relatedPosts": [
      "writing-like-product"
    ],
    "body": "<p>Most people take only transient notes - simply jotting down things they want to remember. This is very ineffective. The problem is that such notes are disorganized, difficult to search through and discover later on. You will never <em>actually</em> get around to rereading most of your notes, so they will never be useful to you (or anybody else) again. They are also unlikely to lead to creating valuable output.</p>\n<p>The solution - <strong>Write Evergreen Atomic Notes</strong>:</p>\n<ul>\n<li><strong>Evergreen</strong> - organize your notes into posts which are designed to evolve and accumulate over time.</li>\n<li><strong>Atomic</strong> - each post is brief (under 300 words), and focused on one specific idea, trying to encapsulate the entirety of that idea as well as possible.</li>\n<li><strong>Posts</strong> - posts are published on your blog, organized using tags, easy to search through, and useful for other people.</li>\n</ul>\n<h4 id=\"user-content-good-evergreen-atomic-posts\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#good-evergreen-atomic-posts\"><span></span></a>Good Evergreen Atomic Posts:</h4>\n<ul>\n<li>Have <strong>Strong Titles</strong> - a good title is an abstraction of the post itself. Use a succinct phrase which aims to make a clear claim that captures the entirety of the note's ideas. That enables you to use titles as an \"API\", making it easy to refer to your posts (see <a href=\"https://publish.obsidian.md/andymatuschak/Andy+Matuschak/Concept+handles%2C+after+Alexander\">Concept handles</a>).</li>\n<li>Are <strong>Modular</strong> - apply the programming principle of <em>separation of concerns</em>, each post should only be “about” one thing, making them easy to recombine and interlink later on  (like Wikipedia articles).</li>\n<li>Are meant to <strong>Evolve</strong> - don't try to make the note complete or perfect right away, don't over-edit it. Develop a practice of looking through your posts, and making incremental improvements every time you read through them.</li>\n<li>Are <strong>Well Interlinked</strong>  - strive to make links between the posts, they make posts easier to discover and help you to see the connections between different ideas (leading to new insights). Interlinking posts also motivates you to revisit and update your old posts.</li>\n</ul>\n<h4 id=\"user-content-benefits\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#benefits\"><span></span></a>Benefits:</h4>\n<p>Atomic Posts are easy to write:</p>\n<ul>\n<li>They're based on the notes you're already taking, so you don't have to stare at a blank page searching for ideas.</li>\n<li>They're brief, so you're less likely to get overwhelmed and procrastinate out of fear of doing the work.</li>\n<li>Daily posts contribute to your writing habit, posting a micro essay every day is an easier habit to develop than working on big long-term projects.</li>\n<li>Publishing regularly is satisfying and gives you instant feedback from your readers, so you can get better at writing by interacting with your audience.</li>\n<li>They help you to avoid perfectionism. Since they're meant to evolve, your first version of the post doesn't have to be perfect. The first version of the post is just your first attempt at expressing your idea, which will improve overtime as your knowledge and skill grows.</li>\n</ul>\n<p>Atomic Posts are easy to read:</p>\n<ul>\n<li>It's easier and more satisfying to read something short and insightful than to struggle through a long article.</li>\n<li>Since they're interlinked, they can lead your readers down the rabbithole of your writing. Somehow reading through a lot of easily digestible and insightful posts feels more engaging.</li>\n</ul>\n<p>Atomic Posts make you prolific because they add up to larger projects. You can create value in small unintimidating chunks (atomic posts), and then assemble multiple posts into longer articles, books, or courses.</p>\n<p>Finally, Atomic Posts are better for social media marketing - multiple short posts tend to do better than one big one.</p>\n<h2 id=\"user-content-resources\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#resources\"><span></span></a>Resources</h2>\n<p>Learn more at <a href=\"https://publish.obsidian.md/andymatuschak/Andy+Matuschak/Evergreen+notes\">Andy Matuschak's blog</a>.</p>\n<p>There's a similar idea of creating <a href=\"https://www.ship30for30.com/post/how-to-start-writing-online-the-ship-30-for-30-ultimate-guide\">Atomic Essays</a>, which I also found very helpful and useful.</p>"
  },
  {
    "title": "Writing Like Product",
    "slug": "writing-like-product",
    "url": "/post/writing-like-product",
    "tags": [
      {
        "name": "Writing",
        "slug": "writing"
      }
    ],
    "description": "When you're writing blog posts or courses, think of yourself as a startup founder building a product.",
    "thumbnail": null,
    "social": "/illustrations/post/writing-like-product/social.png",
    "comments": "https://twitter.com/lumenwrites/status/1461464185364172804",
    "relatedPosts": [
      "evergreen-atomic-notes"
    ],
    "body": "<p>When you're writing blog posts or courses, think of yourself as a startup founder building a product.</p>\n<p><strong>Understand your target audience.</strong> Learn to see the world from the perspective of your readers, understand their problems and desires.</p>\n<p>Write your posts to <strong>solve a specific problem for your target audience.</strong> Clearly identify a problem your readers have, in the title and introduction promise your readers to solve that problem, use the rest of the post to solve it. Take them from A to B, from where they are to where they want to be.</p>\n<p>Create an MVP (Minimum Viable Product), the <strong>most basic solution to your audience's problem</strong>, and then <strong>launch early</strong> - as soon as your post coherently conveys what you want it to convey, you can show it to people and get some feedback. Then <strong>iterate based on that feedback</strong> to improve your product.</p>\n<p><strong>Do things that don't scale</strong> - talk to your users (readers), respond to their comments, listen to what they have to say, ask them what they would like to read next.</p>\n<p>You can think of your whole blog as a product (not just individual posts). Quickly create short posts on various topics, share them, gauge people's reaction, and <strong>double down on what works best</strong>.</p>\n<p>One level of abstraction higher, you can also think of your <strong>writing system</strong> as a product. Analyze your writing, develop a repeatable process that enables you to be prolific and create successful posts. Tweak this process and make gradual improvements. Think about becoming a better writer as optimizing your writing system, improving your process.</p>\n<p>Competently <strong>market your writing</strong>, actively promote what you wrote. In startups, marketing is just as important as building a good product. Learn to find people interested in your product, create titles and thumbnails that make people want to read what you wrote. Develop an article launching/marketing plan, a post promotion system you can gradually tweak and improve, and then proactively follow these steps (as opposed to haphazardly sharing your stuff on social media).</p>\n<p><strong>Care about the design</strong>. The design of your posts is important, make it beautiful, attractive, readable. Do everything in your power to avoid wasting your readers' time (that would be equivalent to building a good UX for your product).</p>\n<h1 id=\"user-content-references\"><a aria-hidden=\"true\" tabindex=\"-1\" href=\"#references\"><span></span></a>References</h1>\n<p><a href=\"https://twitter.com/dickiebush/status/1384160201457037314\">Very helpful thread by Dickie Bush</a></p>"
  }
]