{"introduction":{"title":"Introduction","slug":"introduction","chapters":{"welcome":{"title":"Welcome","slug":"welcome","description":"","thumbnail":null,"preview":true,"draft":false,"url":"/introduction/welcome","compiledMdx":{"compiledSource":"var c=Object.defineProperty,p=Object.defineProperties;var m=Object.getOwnPropertyDescriptors;var n=Object.getOwnPropertySymbols;var s=Object.prototype.hasOwnProperty,r=Object.prototype.propertyIsEnumerable;var h=(t,a,o)=>a in t?c(t,a,{enumerable:!0,configurable:!0,writable:!0,value:o}):t[a]=o,e=(t,a)=>{for(var o in a||(a={}))s.call(a,o)&&h(t,o,a[o]);if(n)for(var o of n(a))r.call(a,o)&&h(t,o,a[o]);return t},l=(t,a)=>p(t,m(a));var d=typeof require!=\"undefined\"?require:t=>{throw new Error('Dynamic require of \"'+t+'\" is not supported')};var u=(t,a)=>{var o={};for(var i in t)s.call(t,i)&&a.indexOf(i)<0&&(o[i]=t[i]);if(t!=null&&n)for(var i of n(t))a.indexOf(i)<0&&r.call(t,i)&&(o[i]=t[i]);return o};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(o){var i=o,{components:t}=i,a=u(i,[\"components\"]);return mdx(MDXLayout,l(e(e({},layoutProps),a),{components:t,mdxType:\"MDXLayout\"}),mdx(\"h1\",e({},{id:\"getting-the-most-out-of-this-course\"}),mdx(\"a\",e({parentName:\"h1\"},{className:\"header-link\",href:\"#getting-the-most-out-of-this-course\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Getting the Most out of this Course\"),mdx(\"p\",null,\"Welcome to the Adventure Academy! Thanks for joining! I hope you're excited about this course, and I'm really looking forward to seeing what you will create using the things you will learn here!\"),mdx(\"p\",null,\"First, I want to give you a few general tips that will help you to get the most out of this course.\"),mdx(\"h2\",e({},{id:\"learn-by-doing\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#learn-by-doing\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Learn by Doing\"),mdx(\"p\",null,\"For you to get the most value out of this course, it is important that you take action and apply what you're learning right away - you will learn much better if you immediately apply the ideas you're learning into practice. Don't just read through the course in one sitting - commit to writing an adventure, read one lesson at a time, and make sure to take the Action Steps listed at the end of each lesson before moving on.\"),mdx(\"p\",null,\"If you successfully complete all the action steps outlined in this course, at the end you will have created a fun one-shot adventure you can run for your players or publish.\"),mdx(\"h2\",e({},{id:\"set-an-attainable-goal\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#set-an-attainable-goal\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Set an Attainable Goal\"),mdx(\"p\",null,\"Clearly define what you want to accomplish by the end of this course. When you're going through the course for the first time, I highly recommend you to aim to write a one-page adventure, like the ones you see on \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://rpgadventures.io/\"}),\"our website\"),\".\"),mdx(\"p\",null,\"This goal is attainable, unintimidating, and limited in scope. You're extremely likely to accomplish it successfully, which will give you the confidence to pursue more ambitious projects later on (like longer adventures and campaigns). Successfully completing a small project is much better than taking on something vast and intimidating, getting stuck, and losing motivation.\"),mdx(\"h2\",e({},{id:\"set-the-deadlines\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#set-the-deadlines\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Set the Deadlines\"),mdx(\"p\",null,\"The writing process outlined in this course can be completed in two hours (if you're doing a live brainstorming session with a group of people, like we sometimes do in our discord community), or in two weeks (if you're busy, working on the adventure on your own, and want to take your time with each step), or in any amount of time in between - it takes as much time as you're willing to put into it. If you're working on a very long adventure or a campaign, it might take even longer.\"),mdx(\"p\",null,\"Having said that, I'm designing this course to be completed in two weeks. The Adventure Brainstorming section has 7 parts and the Adventure Writing section has 7 parts, so I recommend aiming to complete one lesson per day (each lesson taking 1-2 hours).\"),mdx(\"h2\",e({},{id:\"avoid-perfectionism\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#avoid-perfectionism\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Avoid Perfectionism\"),mdx(\"p\",null,\" Don't try to complete all the steps perfectly, instead - do the best you can within the time-frame that you have.\"),mdx(\"p\",null,\"Looking for the perfect idea is one of the major causes of the writer's block - people get stuck feeling unsatisfied with the ideas they have, or feeling the choice paralysis when trying to pick the best idea out of the list.\"),mdx(\"p\",null,\"Lower your expectations for how good you think an idea should be - ideas build on top of each other and evolve as you go through the writing process. It's much easier to improve the simple idea you already have than to come up with something brilliant out of the blue. Even a simple and obvious idea will turn into something interesting and unique by the time you're done with your adventure. \"),mdx(\"p\",null,\"Don't get it right, just get it written.  The most important thing is to successfully complete the simplest playable adventure, just make it exist - you can always go back and improve it later. If you move at a steady pace and complete the adventures regularly, instead of getting stuck on one project and trying to make it perfect - you will grow much faster as a writer, be more productive, and the overall quality of your work will increase.\"),mdx(\"h2\",e({},{id:\"write-a-new-adventure\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#write-a-new-adventure\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Write a New Adventure\"),mdx(\"p\",null,\"When you go through this course for the first time, I recommend starting from scratch and writing a new adventure, rather than continuing to work on the ideas you've been working on already.\"),mdx(\"p\",null,\"This will help you to experience the whole creative process, which includes deliberately generating new adventure ideas from scratch.\"),mdx(\"p\",null,\"This will also help you to write without the weight of the expectations you may have if you've been struggling with a big project and getting nowhere. Take this course as an opportunity to experiment, to try something new.\"),mdx(\"h2\",e({},{id:\"join-our-community\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#join-our-community\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Join our Community\"),mdx(\"p\",null,\"Before we begin the course, make sure to join our \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://discord.gg/JZmXfWD85D\"}),\"Discord Community\"),\". You will get much more out of the course if you interact with the other people interested in writing adventures, actively engage in discussion, share your experience, ask questions, ask for help if you get stuck, and help other people to brainstorm their ideas (which will help you to have more ideas of your own).\"),mdx(\"p\",null,\"After joining our community, make sure to send me an email (\",mdx(\"inlineCode\",{parentName:\"p\"},\"lumenwrites@gmail.com\"),\") with your Discord handle and I will give you access to the private channels available only to the students of this course.\"),mdx(\"h2\",e({},{id:\"contact\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#contact\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Contact\"),mdx(\"p\",null,\"If you have any questions or encounter any issues, don't hesitate to contact me:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Email: \",mdx(\"inlineCode\",{parentName:\"li\"},\"lumenwrites@gmail.com\")),mdx(\"li\",{parentName:\"ul\"},\"Discord: \",mdx(\"inlineCode\",{parentName:\"li\"},\"lumen#7925\"))),mdx(\"h2\",e({},{id:\"share-this-course\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#share-this-course\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Share this Course!\"),mdx(\"p\",null,\"If you find this course useful - please share it with your friends or on social media, it would really help me to grow our community!\"),mdx(\"hr\",null),mdx(\"h2\",e({},{id:\"action-steps\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#action-steps\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Action Steps\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Clearly define your goal for this course. What do you want to get out of it? Which part of the adventure writing process are you the most curious about? What kind of adventure do you wish to create?\"),mdx(\"li\",{parentName:\"ul\"},\"Send me a message over email or discord with your discord username, so that I could give you access to the private category in our server available only to the students in this course.\"),mdx(\"li\",{parentName:\"ul\"},\"Go to the \",mdx(\"inlineCode\",{parentName:\"li\"},\"#student-introductions\"),\" channel and tell us a bit about yourself!\")))}MDXContent.isMDXComponent=!0;\n","scope":{"preview":true}},"prev":null,"next":{"title":"Writing Process","url":"/introduction/writing-process"}},"writing-process":{"title":"Writing Process","slug":"writing-process","description":"","thumbnail":null,"preview":true,"draft":false,"url":"/introduction/writing-process","compiledMdx":{"compiledSource":"var p=Object.defineProperty,c=Object.defineProperties;var m=Object.getOwnPropertyDescriptors;var s=Object.getOwnPropertySymbols;var i=Object.prototype.hasOwnProperty,r=Object.prototype.propertyIsEnumerable;var l=(t,o,a)=>o in t?p(t,o,{enumerable:!0,configurable:!0,writable:!0,value:a}):t[o]=a,e=(t,o)=>{for(var a in o||(o={}))i.call(o,a)&&l(t,a,o[a]);if(s)for(var a of s(o))r.call(o,a)&&l(t,a,o[a]);return t},h=(t,o)=>c(t,m(o));var d=typeof require!=\"undefined\"?require:t=>{throw new Error('Dynamic require of \"'+t+'\" is not supported')};var u=(t,o)=>{var a={};for(var n in t)i.call(t,n)&&o.indexOf(n)<0&&(a[n]=t[n]);if(t!=null&&s)for(var n of s(t))o.indexOf(n)<0&&r.call(t,n)&&(a[n]=t[n]);return a};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(a){var n=a,{components:t}=n,o=u(n,[\"components\"]);return mdx(MDXLayout,h(e(e({},layoutProps),o),{components:t,mdxType:\"MDXLayout\"}),mdx(\"h1\",e({},{id:\"writing-process\"}),mdx(\"a\",e({parentName:\"h1\"},{className:\"header-link\",href:\"#writing-process\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Writing Process\"),mdx(\"h2\",e({},{id:\"your-living-document\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#your-living-document\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Your Living Document\"),mdx(\"p\",null,\"We will write our adventure using the \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://docs.google.com/document/d/1mPVfd9sONouEKwpdAtS88sE_KlKn5cX7ihFd_SK-aWY/\"}),\"Adventure Brainstorming Template\"),\".\"),mdx(\"p\",null,\"It contains the list of sections, one for each of the core elements of a well-crafted adventure. Under each of the sections you will find a list of the most important questions you need to answer about your adventure. These questions (along with the lessons in the course) will guide you through the process of developing your ideas.\"),mdx(\"p\",null,\"You will use the Adventure Brainstorming Template as a living document, you will fill it with your ideas as you go through the course. Once it is complete, you will know everything you need in order to write a good adventure.\"),mdx(\"p\",null,\"Then you will use the \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://docs.google.com/document/d/1Gp9-HuYnKfAimRhyixlRmayoFpF6S4csSMcMAaEe8r0/\"}),\"Adventure Writing Template\"),\" to outline and summarize everything you have brainstormed. This is where you will write the final draft of your adventure - put all the ideas together into a list of scenes that flow into each other, add up to an interesting story that makes sense.\"),mdx(\"h2\",e({},{id:\"follow-the-action-steps\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#follow-the-action-steps\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Follow the Action Steps\"),mdx(\"p\",null,`Each lesson has a section called \"Action Steps'' - a checklist of things you need to do to successfully complete it. Make sure that you complete all the steps before moving on to the next lesson. Once you complete all the Action Steps in this course, you will have a complete adventure.`),mdx(\"h2\",e({},{id:\"ask-good--questions\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#ask-good--questions\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Ask Good  Questions\"),mdx(\"p\",null,\"The core process of brainstorming ideas and writing stories comes down to asking and answering questions. Asking good, specific questions is the best way to make sure that you won't get stuck in the writer's block, because it removes all confusion and ambiguity about what to do next, and gives you clear, attainable goals - you will always have a concrete, specific task to accomplish. Breaking down complex goals into small and clear steps is the best way to make them seem less confusing and intimidating.\"),mdx(\"p\",null,\"As you develop your ideas, you will always do one of two things - answering the next most important question on your list, or trying to figure out what are the next most important open questions that need to be added to your list. That way you'll never feel the vague sense of trying to write, but not knowing what to do, you'll never feel overwhelmed by the process. \"),mdx(\"p\",null,\"Most of the questions you will need to answer are universal for all adventures, I have written them down in the Brainstorming Template and in the Action Steps sections in this course. I'll be using these questions to guide you through the story writing process.\"),mdx(\"p\",null,\"Some of the questions will be specific to your story, they will come up as you write your adventure - such as figuring out what is the next step of your villain's evil plan, how to describe a specific location, how to make one of your encounters more interesting, etc.\"),mdx(\"p\",null,\"Whenever you feel confused about what to do next - try to make a list of the most important open questions you don't yet know how to answer. Make the questions as specific as possible, clearly define the exact problem you're facing. If you're not sure how - write down the list of things you already know about the story, and then the things you don't know will become apparent.\"),mdx(\"h2\",e({},{id:\"make-lists\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#make-lists\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Make Lists\"),mdx(\"p\",null,`The best way to go about finding answers to your creative questions is making lists. To answer a question, quickly list 5-10 possible answers you can think of, and pick your favorite one. Don't try to come up with the best answers right away - aim for \"good enough\". If the best idea you've got is still not great - that's okay, use it as a placeholder. It will be much easier to improve it later, after the first draft is complete.`),mdx(\"p\",null,\"Start by finding simple and obvious solutions, then, if you have some time left, list the most important things you'd like to improve about your ideas and focus on them.\"),mdx(\"p\",null,\"This strategy takes advantage of so called \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://en.wikipedia.org/wiki/Divergent_thinking\"}),\"divergent thinking\"),` - instead of trying to find the \"best\" or the \"correct\" answer, you try to generate a list of possible alternatives and then pick your favorite. That encourages you to explore ideas that wouldn't naturally occur to you, and makes the creative process much easier.`),mdx(\"p\",null,\"It is also a great way to overcome perfectionism that often causes the writer's block. It's difficult to come up with one great idea, it's much easier to come up with 5-10 potentially valid ideas and build on top of them, recombine them, tweak them, and pick your favorite.\"),mdx(\"p\",null,\"That's why all sections in the Brainstorming Template are made out of lists - for every step of the process you'll make a list of ideas and then pick your favorite ones to take to the next step. Answer questions quickly, make creative choices, commit to them, and move on to the next task.\"),mdx(\"h2\",e({},{id:\"engage-with-the-community\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#engage-with-the-community\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Engage with the Community\"),mdx(\"p\",null,\"Talking to people, brainstorming ideas with them, asking for help and feedback, and giving help and feedback to others is one of the most powerful tools you can use to stay motivated, gain experience, learn from your peers, successfully complete your adventure, and become a better writer.\"),mdx(\"p\",null,\"Almost all Action Steps sections will have a prompt asking you to post something in the discord - discuss your ideas, share your work, ask for help and feedback. This is one of the most important and valuable parts of this process, so make sure to take advantage of it. Don't be shy to make posts about your progress - our community is friendly and encouraging, and will be happy to help you on your journey.\"),mdx(\"p\",null,\"Also make sure to read the posts made by others and comment on them, help the other students who are going through this course. It will really help you to get better at coming up with new ideas and solving creative problems.\"),mdx(\"hr\",null),mdx(\"h2\",e({},{id:\"action-steps\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#action-steps\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Action Steps\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Copy the \",mdx(\"a\",e({parentName:\"li\"},{href:\"https://docs.google.com/document/d/1mPVfd9sONouEKwpdAtS88sE_KlKn5cX7ihFd_SK-aWY/\"}),\"Adventure Brainstorming Template\"),\" into a new google doc by clicking \",mdx(\"inlineCode\",{parentName:\"li\"},\"File > Make a Copy\"),\" and save it into the folder where you want to keep all of your adventure writing related information.\"),mdx(\"li\",{parentName:\"ul\"},\"Copy the \",mdx(\"a\",e({parentName:\"li\"},{href:\"https://docs.google.com/document/d/1Gp9-HuYnKfAimRhyixlRmayoFpF6S4csSMcMAaEe8r0/\"}),\"Adventure Writing Template\"),\" into the same folder.\")))}MDXContent.isMDXComponent=!0;\n","scope":{"preview":true}},"prev":{"title":"Welcome","url":"/introduction/welcome"},"next":{"title":"Resources","url":"/introduction/resources"}},"resources":{"title":"Resources","slug":"resources","description":"","thumbnail":null,"preview":true,"draft":false,"url":"/introduction/resources","compiledMdx":{"compiledSource":"var d=Object.defineProperty,m=Object.defineProperties;var l=Object.getOwnPropertyDescriptors;var n=Object.getOwnPropertySymbols;var p=Object.prototype.hasOwnProperty,i=Object.prototype.propertyIsEnumerable;var s=(e,t,a)=>t in e?d(e,t,{enumerable:!0,configurable:!0,writable:!0,value:a}):e[t]=a,o=(e,t)=>{for(var a in t||(t={}))p.call(t,a)&&s(e,a,t[a]);if(n)for(var a of n(t))i.call(t,a)&&s(e,a,t[a]);return e},u=(e,t)=>m(e,l(t));var c=typeof require!=\"undefined\"?require:e=>{throw new Error('Dynamic require of \"'+e+'\" is not supported')};var h=(e,t)=>{var a={};for(var r in e)p.call(e,r)&&t.indexOf(r)<0&&(a[r]=e[r]);if(e!=null&&n)for(var r of n(e))t.indexOf(r)<0&&i.call(e,r)&&(a[r]=e[r]);return a};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(a){var r=a,{components:e}=r,t=h(r,[\"components\"]);return mdx(MDXLayout,u(o(o({},layoutProps),t),{components:e,mdxType:\"MDXLayout\"}),mdx(\"h1\",o({},{id:\"resources\"}),mdx(\"a\",o({parentName:\"h1\"},{className:\"header-link\",href:\"#resources\"}),mdx(\"span\",o({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Resources\"),mdx(\"p\",null,mdx(\"a\",o({parentName:\"p\"},{href:\"https://docs.google.com/document/d/1mPVfd9sONouEKwpdAtS88sE_KlKn5cX7ihFd_SK-aWY/\"}),\"Adventure Brainstorming Template\"),mdx(\"br\",{parentName:\"p\"}),`\n`,\"Use the Adventure Brainstorming Template as a living document, fill with your ideas as you go through the course. Copy it into a new google doc, go through it step by step, use it to guide you through the adventure creation process.\"),mdx(\"p\",null,mdx(\"a\",o({parentName:\"p\"},{href:\"https://docs.google.com/document/d/1Gp9-HuYnKfAimRhyixlRmayoFpF6S4csSMcMAaEe8r0/\"}),\"Adventure Writing Template\"),\".\",mdx(\"br\",{parentName:\"p\"}),`\n`,\"Use the Adventure Writing Template to summarize everything you have brainstormed. This is where you will write a final draft of your adventure - put all the ideas together into a list of scenes that flow into each other, add up to an interesting story that makes sense.\"),mdx(\"p\",null,mdx(\"a\",o({parentName:\"p\"},{href:\"https://perchance.org/adventure-prompts\"}),\"Adventure Prompts Tool\"),mdx(\"br\",{parentName:\"p\"}),`\n`,\"Use the Adventure Prompts Tool to help you come up with the initial premise for the adventure. Randomize prompts and try doing a short one-minute pitch of a story based on them.\"),mdx(\"p\",null,mdx(\"a\",o({parentName:\"p\"},{href:\"https://rpgadventures.io/\"}),\"Published Adventures\"),mdx(\"br\",{parentName:\"p\"}),`\n`,\"Use the adventures we have already published as an inspiration.\"),mdx(\"p\",null,mdx(\"a\",o({parentName:\"p\"},{href:\"https://discord.gg/JZmXfWD85D\"}),\"Our Discord Server\"),mdx(\"br\",{parentName:\"p\"}),`\n`,\"Join our community to share your work and get writing help and feedback. You'll get to know a lot of friendly and creative people, and participating in a collaborative writing community will help you to stay motivated and complete your adventure.\"))}MDXContent.isMDXComponent=!0;\n","scope":{"preview":true}},"prev":{"title":"Writing Process","url":"/introduction/writing-process"},"next":{"title":"Exciting Premise","url":"/adventure-brainstorming/exciting-premise"}}}},"adventure-brainstorming":{"title":"Adventure Brainstorming","slug":"adventure-brainstorming","chapters":{"exciting-premise":{"title":"Exciting Premise","slug":"exciting-premise","description":"","thumbnail":null,"preview":true,"draft":false,"url":"/adventure-brainstorming/exciting-premise","compiledMdx":{"compiledSource":"var h=Object.defineProperty,u=Object.defineProperties;var c=Object.getOwnPropertyDescriptors;var r=Object.getOwnPropertySymbols;var i=Object.prototype.hasOwnProperty,l=Object.prototype.propertyIsEnumerable;var s=(a,t,n)=>t in a?h(a,t,{enumerable:!0,configurable:!0,writable:!0,value:n}):a[t]=n,e=(a,t)=>{for(var n in t||(t={}))i.call(t,n)&&s(a,n,t[n]);if(r)for(var n of r(t))l.call(t,n)&&s(a,n,t[n]);return a},p=(a,t)=>u(a,c(t));var g=typeof require!=\"undefined\"?require:a=>{throw new Error('Dynamic require of \"'+a+'\" is not supported')};var m=(a,t)=>{var n={};for(var o in a)i.call(a,o)&&t.indexOf(o)<0&&(n[o]=a[o]);if(a!=null&&r)for(var o of r(a))t.indexOf(o)<0&&l.call(a,o)&&(n[o]=a[o]);return n};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(n){var o=n,{components:a}=o,t=m(o,[\"components\"]);return mdx(MDXLayout,p(e(e({},layoutProps),t),{components:a,mdxType:\"MDXLayout\"}),mdx(\"h1\",e({},{id:\"exciting-premise\"}),mdx(\"a\",e({parentName:\"h1\"},{className:\"header-link\",href:\"#exciting-premise\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Exciting Premise\"),mdx(\"p\",null,\"First, I want to show you how to come up with exciting adventure ideas.\"),mdx(\"h2\",e({},{id:\"four-components-of-the-premise\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#four-components-of-the-premise\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Four Components of the Premise\"),mdx(\"p\",null,\" A good adventure idea is usually based on one of the following four elements, or an interesting combination of them:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Important Objective\"),\" - the problem your players will try to solve, or the goal they'll try to achieve.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Interesting Setting\"),\" - world and locations where the adventure takes place, with a unique twist.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Cool Characters\"),\" - a really interesting antagonist the players will have to defeat, and, to a lesser extent, other characters they will meet.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Supernatural Element\"),\" - unusual magics, technologies, or creatures.\")),mdx(\"p\",null,\"Your idea can grow out of any one of these elements. Can you think of an exciting goal, setting, character, or a magic you would like to build your story around?\"),mdx(\"p\",null,\"Take a look at some examples:\"),mdx(\"blockquote\",null,mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Setting + Supernatural\"),\":\",mdx(\"br\",{parentName:\"li\"}),\"A lavish castle where all inhabitants have been mind controlled by the brain slugs.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Setting + Problem\"),\":\",mdx(\"br\",{parentName:\"li\"}),\"A grotesque experiment has escaped from the mad scientist's laboratory.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Supernatural + Problem\"),\":\",mdx(\"br\",{parentName:\"li\"}),\"A love potion has leaked into the water supply.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Supernatural + Goal\"),\":\",mdx(\"br\",{parentName:\"li\"}),\"You have been hired to obtain a lock of hair from the elusive Sasquatch.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Character + Setting\"),\":\",mdx(\"br\",{parentName:\"li\"}),\"A noble Paladin has arrived into the Pirate City to bring law and order.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Character + Problem\"),\":\",mdx(\"br\",{parentName:\"li\"}),\"Socially awkward prince will lose his claim to the throne unless he finds a wife by next Friday.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Character + Supernatural\"),\":\",mdx(\"br\",{parentName:\"li\"}),\"A pompous King has been turned into a Rat by his evil Vizier.\"))),mdx(\"h3\",e({},{id:\"bottom-up-ideas\"}),mdx(\"a\",e({parentName:\"h3\"},{className:\"header-link\",href:\"#bottom-up-ideas\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Bottom-Up ideas\"),mdx(\"p\",null,\"If you have an idea for some very specific part of the story (you want your players to fight a certain monster, visit a certain location, find a specific magical artifact, etc.) - you can grow a story around that. Expand the idea and see if it leads you to one or few of the core components I've outlined above.\"),mdx(\"blockquote\",null,mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"I want my players to attend the King's feast:\",mdx(\"ul\",{parentName:\"li\"},mdx(\"li\",{parentName:\"ul\"},\"Problem: They learn that someone has poisoned the food.\"),mdx(\"li\",{parentName:\"ul\"},\"Supernatural: The cooked boar has left a ghost who is determined to ruin the feast.\"))),mdx(\"li\",{parentName:\"ul\"},\"I have a cool swamp battle-map:\",mdx(\"ul\",{parentName:\"li\"},mdx(\"li\",{parentName:\"ul\"},\"Setting: The Swamplands of No Return.\"),mdx(\"li\",{parentName:\"ul\"},\"Character: Swamp Witch who holds a Terrible Secret. \"))),mdx(\"li\",{parentName:\"ul\"},\"I want my players to find the Scroll of Sweet Slithering Snakes:\",mdx(\"ul\",{parentName:\"li\"},mdx(\"li\",{parentName:\"ul\"},\"Character: It is being held by a brilliant, powerful, and extremely paranoid wizard.\"),mdx(\"li\",{parentName:\"ul\"},\"Setting: It has been lost in the Basilisk's lair.\"))))),mdx(\"h2\",e({},{id:\"blank-page-vs-lego-blocks\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#blank-page-vs-lego-blocks\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Blank Page vs Lego Blocks\"),mdx(\"p\",null,\"It is difficult and unnecessary to try to invent everything from scratch, just by staring at the blank page and trying to make something up by thinking really hard. I struggled with this a lot, it was one of the main causes of my writer's block.\"),mdx(\"p\",null,\"Instead of staring into the emptiness of a blank page, creativity should feel like playing with lego blocks. You take existing ideas and tropes you're already familiar with, and try to recombine them in new ways, or change them and turn them into something new.\"),mdx(\"h3\",e({},{id:\"picking-apart-stories\"}),mdx(\"a\",e({parentName:\"h3\"},{className:\"header-link\",href:\"#picking-apart-stories\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Picking Apart Stories\"),mdx(\"p\",null,\"You obtain the lego blocks to play with by picking apart your favorite stories - movies, TV shows, books, games, comics, and so on.\"),mdx(\"p\",null,\"Look through the list of interesting stories, and extract the idea components out of them:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"What did the main character want in this story, is there an interesting problem they were trying to solve?\"),mdx(\"li\",{parentName:\"ul\"},\"Does the story take place in an interesting setting?\"),mdx(\"li\",{parentName:\"ul\"},\"What are some of the coolest, most memorable characters that you've seen in this story?\"),mdx(\"li\",{parentName:\"ul\"},\"Does the story explore some interesting magics, or technologies, does it involve some supernatural creatures?\")),mdx(\"p\",null,\"Not all stories will have all the four elements, but in most of them at least one of these components is really strong:\"),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Objective\"),\": \"),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"Solve a murder despite memory loss (Memento)\"),mdx(\"li\",{parentName:\"ul\"},\"Diffuse the bomb before the bus stops moving (Speed)\"),mdx(\"li\",{parentName:\"ul\"},\"Defeat a skyscraper full of terrorists by yourself (Die Hard)\"),mdx(\"li\",{parentName:\"ul\"},\"Teach a young girl to kill so she could avenge her family (Leon)\"))),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Setting\"),\": \"),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"Hogwarts\"),mdx(\"li\",{parentName:\"ul\"},\"The Matrix\"),mdx(\"li\",{parentName:\"ul\"},\"Wasteland (Fallout)\"),mdx(\"li\",{parentName:\"ul\"},\"Jurassic Park\"))),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Character\"),\":\"),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"Walter White\"),mdx(\"li\",{parentName:\"ul\"},\"Jack Sparrow\"),mdx(\"li\",{parentName:\"ul\"},\"Indiana Jones\"),mdx(\"li\",{parentName:\"ul\"},\"Ace Ventura\"))),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Supernatural\"),\": \"),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"Time Loop (Groundhog Day)\"),mdx(\"li\",{parentName:\"ul\"},\"Sentient Toys (Toy Story)\"),mdx(\"li\",{parentName:\"ul\"},\"Body Switching (Freaky Friday)\"),mdx(\"li\",{parentName:\"ul\"},\"Mech Suit (Iron Man)\"))),mdx(\"p\",null,\"or the combination of these components is really interesting or unexpected:\"),mdx(\"blockquote\",null,mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"Shared dreams + Heist = Inception\"),mdx(\"li\",{parentName:\"ul\"},\"Romeo and Juliet + RMS Titanic = Titanic\"),mdx(\"li\",{parentName:\"ul\"},\"Bank Heist + Zombies = Army of The Dead\"),mdx(\"li\",{parentName:\"ul\"},\"Time travel + Undo the Butterfly Effect = Back to the Future\"),mdx(\"li\",{parentName:\"ul\"},\"Sentient Animals + Avenge your Father = Lion King\"),mdx(\"li\",{parentName:\"ul\"},\"Time Travel + Robot Rebellion = Terminator\"),mdx(\"li\",{parentName:\"ul\"},\"Escape from Monster + Xenomorph = Alien\"),mdx(\"li\",{parentName:\"ul\"},\"Timid teacher + Become a Crime Lord = Breaking Bad\"))),mdx(\"p\",null,\"Build a library of these elements in your head (or collect the most interesting ones in a text file), and when it's time to create an adventure - assemble them into something you haven't seen before.\"),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},\"For example, let's take a few elements from the lists above and recombine them into something new:\"),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Romeo and Juliet + Bank Heist\"),mdx(\"br\",{parentName:\"li\"}),\"A love-struck teenager asks the players to help him commit a bank heist to impress the father of the girl he's in love with, a crime boss of a powerful mafia family.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Sentient Animals + Ace Ventura\"),mdx(\"br\",{parentName:\"li\"}),\"A crazy druid with the personality of Ace Ventura leads his army of sentient flying squirrels to take revenge on the lumberjack village who's destroying his forest.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Robot Rebellion + Hogwarts\"),mdx(\"br\",{parentName:\"li\"}),\"The animated suits of armor and the stone gargoyles have been hijacked by unknown magic and are wrecking havoc on a magic castle. The players must rescue the royal family from the castle that came alive.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Titanic + Zombies\"),mdx(\"br\",{parentName:\"li\"}),\"A zombie outbreak on the ship leads to a catastrophe, players must survive on a sinking ship full of zombies.\"))),mdx(\"h3\",e({},{id:\"adapting-stories\"}),mdx(\"a\",e({parentName:\"h3\"},{className:\"header-link\",href:\"#adapting-stories\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Adapting Stories\"),mdx(\"p\",null,\"The easiest way to come up with an adventure idea is to just adapt one of your favorite stories, changing only the names/places, and possibly setting it in a fantasy world.\"),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Alien in a Fantasy world\"),mdx(\"br\",{parentName:\"p\"}),`\n`,\"Stop the cruel power-hungry emperor who tries to build himself an army by breeding dangerous Xenomorph-like monsters.\")),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Die Hard in a Magic Castle\"),mdx(\"br\",{parentName:\"p\"}),`\n`,\"Vampires took over the magic school, you're the only ones who can rescue their hostages before they get turned into vampires.\")),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Honey I Shrunk The Kids\"),mdx(\"br\",{parentName:\"p\"}),`\n`,\"Evil witch poisons the players with a shrinking potion, they must escape and travel through her (now enormous) magic hut to the top shelf where the enlargement potion is stored.\")),mdx(\"h3\",e({},{id:\"recombining-the-elements\"}),mdx(\"a\",e({parentName:\"h3\"},{className:\"header-link\",href:\"#recombining-the-elements\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Recombining the Elements\"),mdx(\"p\",null,\"Combine two interesting ideas together to create something new, mix and match the tropes, putting them together in different ways (like playing with lego blocks):\"),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Sentient Animals + Lord of the Rings\"),mdx(\"br\",{parentName:\"p\"}),`\n`,\"Players play as mice who have stumbled upon The One Ring, and are now humanity's last hope.\")),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Rescue Mission + Scary Monster\"),mdx(\"br\",{parentName:\"p\"}),`\n`,\"The players are hired by a cooky wizard to find and return his runaway pet. His pet is a zombie chimera made out of fury and rage.\")),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Pirates + Floating Islands\"),mdx(\"br\",{parentName:\"p\"}),`\n`,\"Defend a floating pirate town (think Tortuga) being attacked by a massive flying ship of the Royal Navy, sent to \\u201Cbring order and civilization to Fera Ley and put the pirate problem to rest\\u201D.\")),mdx(\"h3\",e({},{id:\"changing-the-elements\"}),mdx(\"a\",e({parentName:\"h3\"},{className:\"header-link\",href:\"#changing-the-elements\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Changing the Elements\"),mdx(\"p\",null,\"To change the element of the story you can reverse it (do the opposite), exaggerate it, or replace it with an entirely different one (idea from another movie for example).\"),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Reverse the Goal: Rescue the Dragon from the Princess\"),mdx(\"br\",{parentName:\"p\"}),`\n`,\"A cruel princess has kidnapped the baby dragon's mom, and is forcing her to fight in a coliseum. Help to rescue the big mama dragon.\")),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Reverse the Key Character Trait: Evil Batman\"),mdx(\"br\",{parentName:\"p\"}),`\n`,\"Protect the city from a ruthless high-tech vigilante driven by his misguided code of honor.\")),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Change the Setting: Typical Train Heist story, set on a Zeppelin\"),mdx(\"br\",{parentName:\"p\"}),`\n`,\"Rescue an innocent person being delivered by Zeppelin to serve her life-sentence in prison.\")),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Exaggerate the Supernatural Element\"),mdx(\"br\",{parentName:\"p\"}),`\n`,\"Solve the disappearance of cows in a village where \",mdx(\"strong\",{parentName:\"p\"},\"everyone\"),\" is secretly a werewolf.\")),mdx(\"h2\",e({},{id:\"combining-your-own-ideas\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#combining-your-own-ideas\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Combining Your Own Ideas\"),mdx(\"p\",null,\"Make a list of 5-10 ideas using the methods above, and then combine/reverse/exaggerate some of \",mdx(\"em\",{parentName:\"p\"},\"these\"),\" ideas to make something even more unique and interesting.\"),mdx(\"blockquote\",null,mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Zombies on the Titanic + Ace Ventura\"),mdx(\"br\",{parentName:\"li\"}),\"The zombies have been released by a crazy zombie-rights activist who has steered the ship into the island where he's planning to build his own zombie utopia.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Runaway Chimera + Pirates of the Floating Island\"),mdx(\"br\",{parentName:\"li\"}),\"Players must protect the escaped gargoyle (a protected species) from the crew of flying pirates who are determined to capture it.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Shrinking Potion + The King's Feast\"),mdx(\"br\",{parentName:\"li\"}),\"King's enemies have added the shrinking potion into wine, and now players must help the king to fight off the rebellion despite being the size of an ant.\"))),mdx(\"h2\",e({},{id:\"using-the-adventure-prompts-tool\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#using-the-adventure-prompts-tool\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Using the Adventure Prompts Tool\"),mdx(\"p\",null,\"I have already done a lot of the work of collecting the interesting ideas, and building a tool that recombines them for you automatically.\"),mdx(\"p\",null,\"Try using the \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://perchance.org/adventure-prompts\"}),\"Adventure Prompts Tool\"),\" - generate random prompts and try to pitch a few ideas based on the combinations of these elements.\"),mdx(\"p\",null,\"It's a really fun game to play with your friends:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Take turns generating prompts.\"),mdx(\"li\",{parentName:\"ul\"},\"Each person has two minutes to pitch a story based on the prompts they've received.\"),mdx(\"li\",{parentName:\"ul\"},\"After everyone has a go, you vote on everyone's favorite pitch.\")),mdx(\"hr\",null),mdx(\"h2\",e({},{id:\"action-steps\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#action-steps\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Action Steps\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Make a list of 5-10 adventure ideas, add them to the Idea section of your Adventure Brainstorming Template.\"),mdx(\"li\",{parentName:\"ul\"},\"See if you can combine several of your ideas into something even more unique and interesting.\"),mdx(\"li\",{parentName:\"ul\"},\"Write a 1-2 sentence summary of your favorite idea, write it down in the idea section of your Adventure Brainstorming Template. That's the adventure you'll be working on.\"),mdx(\"li\",{parentName:\"ul\"},\"Post your list of ideas in the \",mdx(\"inlineCode\",{parentName:\"li\"},\"#adventure-ideas\"),\" channel.\"),mdx(\"li\",{parentName:\"ul\"},\"Optional exercise: Try to continue the lists of examples in this chapter, add 3-5 ideas to each of the lists. It will really help you to get a hang of the process, and will probably lead to a few more cool ideas.\"),mdx(\"li\",{parentName:\"ul\"},\"Extra Credit: Find a post made by someone else in this channel, and give them constructive feedback on their ideas. See if you can build on top of their ideas, find a way to improve them, combine multiple ideas, take them in a new and unexpected direction.\")))}MDXContent.isMDXComponent=!0;\n","scope":{"preview":true}},"prev":{"title":"Resources","url":"/introduction/resources"},"next":{"title":"Primary Objective","url":"/adventure-brainstorming/primary-objective"}},"primary-objective":{"title":"Primary Objective","slug":"primary-objective","description":"","thumbnail":null,"preview":false,"draft":false,"url":"/adventure-brainstorming/primary-objective","compiledMdx":{"compiledSource":"var m=Object.defineProperty,u=Object.defineProperties;var c=Object.getOwnPropertyDescriptors;var r=Object.getOwnPropertySymbols;var n=Object.prototype.hasOwnProperty,l=Object.prototype.propertyIsEnumerable;var s=(t,a,i)=>a in t?m(t,a,{enumerable:!0,configurable:!0,writable:!0,value:i}):t[a]=i,e=(t,a)=>{for(var i in a||(a={}))n.call(a,i)&&s(t,i,a[i]);if(r)for(var i of r(a))l.call(a,i)&&s(t,i,a[i]);return t},h=(t,a)=>u(t,c(a));var d=typeof require!=\"undefined\"?require:t=>{throw new Error('Dynamic require of \"'+t+'\" is not supported')};var p=(t,a)=>{var i={};for(var o in t)n.call(t,o)&&a.indexOf(o)<0&&(i[o]=t[o]);if(t!=null&&r)for(var o of r(t))a.indexOf(o)<0&&l.call(t,o)&&(i[o]=t[o]);return i};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(i){var o=i,{components:t}=o,a=p(o,[\"components\"]);return mdx(MDXLayout,h(e(e({},layoutProps),a),{components:t,mdxType:\"MDXLayout\"}),mdx(\"h1\",e({},{id:\"primary-objective\"}),mdx(\"a\",e({parentName:\"h1\"},{className:\"header-link\",href:\"#primary-objective\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Primary Objective\"),mdx(\"p\",null,\"Your adventure idea isn't complete until you have figured out the Primary Objective your players will try to pursue - a \",mdx(\"strong\",{parentName:\"p\"},\"Problem\"),\" they will be trying to solve or a \",mdx(\"strong\",{parentName:\"p\"},\"Goal\"),\" they will be trying to accomplish.\"),mdx(\"p\",null,\"Primary Objective is the \",mdx(\"strong\",{parentName:\"p\"},\"core of your story\"),\", the most important element you need to figure out. Once you know the Objective - everything else will fall into place, because almost all the other elements of the adventure are defined in relation to the Objective:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Adventure Hook\"),\" is the moment at the beginning of the adventure where the players encounter the Problem they must solve or establish the Goal they will try to achieve.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Antagonist\"),\" is the primary force that stands in the way of the players, their goal is the opposite of the heroes' Objective.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Challenges and Encounters\"),\" are the obstacles which the players will need to overcome on their path to the Objective.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Intriguing Mysteries\"),\" are bits and pieces of information the players will gather throughout their adventure that are required for them to accomplish their goal.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Surprising Twist\"),\" is the moment in the middle of the adventure when the players' Objective changes in some way - they realize that it's not what they once thought it was, or some complication makes it much more difficult to achieve.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"The Climax\"),\" of the adventure is the moment when the Objective is resolved, when the players succeed at accomplishing their goal (or, rarely, fail to do so and lose).\")),mdx(\"p\",null,'Resolving the Objective will be the single most important event in the story, it will determine whether the characters succeed or fail, the thing the \"final battle\" revolves around.'),mdx(\"h2\",e({},{id:\"stories-are-about-problem-solving\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#stories-are-about-problem-solving\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Stories are about Problem Solving\"),mdx(\"p\",null,\"Stories and roleplaying games are fundamentally about creative problem solving. \"),mdx(\"p\",null,\"Adventure Ideas are fundamentally problems. They create an exciting, challenging, important goal for the players to accomplish.\"),mdx(\"p\",null,'This is the fundamental \"game loop\" of an RPG - the GM puts an interesting problem in front of the players, and they find creative ways to solve it.'),mdx(\"p\",null,\"Big problems are broken down into smaller Challenges. Every scene the characters try to solve a small problem, their successes take them closer to achieving their goal, the setbacks and complications take them farther away from that goal.\"),mdx(\"p\",null,\"Players encounter a big problem at the beginning of the story, they go through a series of challenges that add up to ultimately solving the problem at the Climax of the story. \"),mdx(\"p\",null,\"This gives the players a sense of progress, makes them feel like their actions are meaningful, make impact on the world, add up to some larger purpose. Primary Objective is that purpose.\"),mdx(\"h2\",e({},{id:\"what-makes-a-good-primary-objective\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#what-makes-a-good-primary-objective\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"What makes a Good Primary Objective\"),mdx(\"p\",null,\"Primary Objective is a specific thing the players must \",mdx(\"strong\",{parentName:\"p\"},\"do\"),\" in order to succeed in their quest. A specific action they must take that will resolve the main conflict.\"),mdx(\"p\",null,\"Primary Objective must be:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"High Stakes\"),\" - players should care about accomplishing it. It should be very meaningful and important to the characters and to the world they live in. Players should have a good reason to pursue it, whatever it takes.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Exciting\"),\" - the problem should be interesting to solve, the goal should be desirable to achieve. Players will spend the whole adventure doing everything in their power to accomplish this, so it should be something fun to participate in.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Difficult\"),\" - the objective should be difficult to accomplish. It will be the main source of challenges and conflict in your story, it will create a lot of struggle for the characters, and you want your players to feel epic and heroic when they succeed.\")),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Objective Examples\"),\":\"),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"Kill the dragon to save the village.\"),mdx(\"li\",{parentName:\"ul\"},\"Break out an innocent from an unassailable prison.\"),mdx(\"li\",{parentName:\"ul\"},\"Stop the Villain from opening a portal into the Demon Dimension.\"),mdx(\"li\",{parentName:\"ul\"},\"Solve the crime to prevent a war between the two kingdoms.\"))),mdx(\"h2\",e({},{id:\"objectives-and-villains\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#objectives-and-villains\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Objectives and Villains\"),mdx(\"p\",null,\"Objectives come in two types, like two sides of the same coin:\"),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Players really want something, and the villain stands in their way.\")),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"Rescue a princess from a dragon.\"),mdx(\"li\",{parentName:\"ul\"},\"Journey to a distant location and find treasure.\"),mdx(\"li\",{parentName:\"ul\"},\"Broker peace between warring kingdoms.\"),mdx(\"li\",{parentName:\"ul\"},\"Perform the heist of the century.\"))),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Villain really wants something, and players must do whatever it takes to stop them.\")),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"Prevent the villain from performing a terrible world-ending ritual.\"),mdx(\"li\",{parentName:\"ul\"},\"Make sure the villain won't get their hands on a powerful artifact.\"),mdx(\"li\",{parentName:\"ul\"},\"The Villain wants to kill or kidnap someone, and the players must protect them.\"),mdx(\"li\",{parentName:\"ul\"},\"The Villain is pursuing the players, and they must escape to survive.\"))),mdx(\"p\",null,'So any idea you have for an Objective is actually two ideas - it is either something the players want to pursue (\"Kill a Terrible Monster\"), or must prevent the villain from obtaining (\"Protect an Adorable Creature from the evil Hunter.\"). '),mdx(\"p\",null,\"Looking at the Objectives this way doubles the amount of ideas you have, and helps you to come up with interesting and unusual stories (by swapping the Heroes and the Villains, telling the story from the perspective of the Antagonist).\"),mdx(\"h2\",e({},{id:\"objective-archetypes\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#objective-archetypes\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Objective Archetypes\"),mdx(\"p\",null,\"Just like in the previous lesson, taking ideas from your favorite stories (and changing them a bit) is one of the best ways to come up with your objective.\"),mdx(\"p\",null,\"Unlike the other story elements, objectives actually tend to be pretty generic, there are a lot of similarities between the stories. What makes an objective unique is the specifics of the story surrounding them. There's a limited amount of story archetypes, the goals heroes can pursue, and you will see the commonalities between them.\"),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},\"So many stories are about:\"),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"Obtaining some important item (McGuffin), creature, person, or information.\",mdx(\"br\",{parentName:\"li\"}),\"(Train robberies, fetch quests, rescue missions, spy missions, capturing fugitives.)\"),mdx(\"li\",{parentName:\"ul\"},\"Killing/defeating a Villain or a dangerous monster who's up to no good.\",mdx(\"br\",{parentName:\"li\"}),\"(Horror movies, superhero movies, many sci-fi and fantasy movies.)\"),mdx(\"li\",{parentName:\"ul\"},\"Traveling to some distant location through dangerous territory, or ending up in a dangerous place and trying to survive and return home.\",mdx(\"br\",{parentName:\"li\"}),\"(Most adventure stories).\"),mdx(\"li\",{parentName:\"ul\"},\"Solving mysteries, finding out the truth.\",mdx(\"br\",{parentName:\"li\"}),\"(Most detective and mystery stories).\"),mdx(\"li\",{parentName:\"ul\"},\"Delivering or protecting an item/creature/person/information.\"),mdx(\"li\",{parentName:\"ul\"},\"Invading, Defending, or Escaping a location.\",mdx(\"br\",{parentName:\"li\"}),\"(Heists, prison breaks, many action movies).\"),mdx(\"li\",{parentName:\"ul\"},\"Convincing/manipulating people, gaining power through non-violent means.\",mdx(\"br\",{parentName:\"li\"}),\"(Intrigue, drama).\"))),mdx(\"p\",null,\"(or preventing a villain from doing one of the above).\"),mdx(\"p\",null,\"See the Adventure Brainstorming Tool for a full list of typical Objectives I was able to collect, think about your favorite stories and see if you can find some other archetypical goals.\"),mdx(\"h2\",e({},{id:\"premise-based-objectives\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#premise-based-objectives\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Premise-Based Objectives\"),mdx(\"p\",null,\"Often the objective will grow naturally out of the story idea you have developed in the previous lesson.\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Start with a Villain\"),\" - come up with an idea for a villain, and figure out what it is that they want that the heroes must try to prevent.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Start with the Setting\"),\" - what's wrong with the world the heroes are living in, what must be fixed?\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Start with the Supernatural Element\"),\" - some kind of magic, spell, technology, or a creature is causing problems, and the story is about resolving those problems.\")),mdx(\"p\",null,\"Most of the time when you have any idea, it's possible to figure out what kind of Objective it naturally leads to. Is that something heroes want? Is that something they fear? Is it causing some problems they must solve?\"),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},\"Examples:\"),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"Villain - Crazy scientist obsessed with world domination.\",mdx(\"br\",{parentName:\"li\"}),\"Objective - stop him from performing his dangerous experiment.\"),mdx(\"li\",{parentName:\"ul\"},\"Setting - dystopian world where the good has won, and is now ruthlessly oppressing the evil.\",mdx(\"br\",{parentName:\"li\"}),\"Objective - incite the monster rebellion and lead it against the Paladin army.\"),mdx(\"li\",{parentName:\"ul\"},\"Supernatural Element - a magic Trident used to control the Kraken.\",mdx(\"br\",{parentName:\"li\"}),\"Objective - steal it from the Pirate Lord who's currently using it to control the seas.\"))),mdx(\"h2\",e({},{id:\"difficulties\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#difficulties\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Difficulties\"),mdx(\"p\",null,\"One of the best ways to make the Objective more interesting is to add some restriction to it that makes it more difficult:\"),mdx(\"blockquote\",null,mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"Problem must be solved using social/political means only.\"),mdx(\"li\",{parentName:\"ul\"},\"Problem must be solved stealthily, secretly, under cover.\"),mdx(\"li\",{parentName:\"ul\"},\"Problem must be solved under time pressure.\"),mdx(\"li\",{parentName:\"ul\"},\"Players must avoid violence, collateral damage.\"),mdx(\"li\",{parentName:\"ul\"},\"Players must compete with the rivals.\"),mdx(\"li\",{parentName:\"ul\"},\"Players must cooperate with the enemy.\"),mdx(\"li\",{parentName:\"ul\"},\"Players have incomplete/false information.\"),mdx(\"li\",{parentName:\"ul\"},\"Players have limited resources/preparation.\"),mdx(\"li\",{parentName:\"ul\"},\"Players must do it while protecting someone.\"),mdx(\"li\",{parentName:\"ul\"},\"Players must do it under scrutiny/supervision, bound by strict rules/laws.\"),mdx(\"li\",{parentName:\"ul\"},\"Target must be unharmed.\"))),mdx(\"p\",null,\"(See the Adventure Prompts Tool for the full list of difficulties I was able to collect).\"),mdx(\"hr\",null),mdx(\"h2\",e({},{id:\"action-steps\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#action-steps\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Action Steps\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Make a list of 5-10 possible goals for the players to pursue, add them to the Primary Objective section in your brainstorming template. Select your favorite one.\"),mdx(\"li\",{parentName:\"ul\"},\"List the things that make the goal difficult to accomplish.\"),mdx(\"li\",{parentName:\"ul\"},\"List the reasons why the goal is important to the characters.\"),mdx(\"li\",{parentName:\"ul\"},\"How can you make the players care about the goal?\"),mdx(\"li\",{parentName:\"ul\"},\"Share your ideas in the \",mdx(\"inlineCode\",{parentName:\"li\"},\"#adventure-ideas\"),\" channel.\"),mdx(\"li\",{parentName:\"ul\"},\"Extra Credit: If you can think of goal archetypes or complications I haven't mentioned - send me a message (\",mdx(\"inlineCode\",{parentName:\"li\"},\"lumen#7925\"),\" on Discord).\")))}MDXContent.isMDXComponent=!0;\n","scope":{}},"prev":{"title":"Exciting Premise","url":"/adventure-brainstorming/exciting-premise"},"next":{"title":"Setting and Locations","url":"/adventure-brainstorming/setting-and-locations"}},"setting-and-locations":{"title":"Setting and Locations","slug":"setting-and-locations","description":"","thumbnail":null,"preview":false,"draft":false,"url":"/adventure-brainstorming/setting-and-locations","compiledMdx":{"compiledSource":"var c=Object.defineProperty,h=Object.defineProperties;var m=Object.getOwnPropertyDescriptors;var o=Object.getOwnPropertySymbols;var s=Object.prototype.hasOwnProperty,l=Object.prototype.propertyIsEnumerable;var r=(t,a,n)=>a in t?c(t,a,{enumerable:!0,configurable:!0,writable:!0,value:n}):t[a]=n,e=(t,a)=>{for(var n in a||(a={}))s.call(a,n)&&r(t,n,a[n]);if(o)for(var n of o(a))l.call(a,n)&&r(t,n,a[n]);return t},u=(t,a)=>h(t,m(a));var d=typeof require!=\"undefined\"?require:t=>{throw new Error('Dynamic require of \"'+t+'\" is not supported')};var p=(t,a)=>{var n={};for(var i in t)s.call(t,i)&&a.indexOf(i)<0&&(n[i]=t[i]);if(t!=null&&o)for(var i of o(t))a.indexOf(i)<0&&l.call(t,i)&&(n[i]=t[i]);return n};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(n){var i=n,{components:t}=i,a=p(i,[\"components\"]);return mdx(MDXLayout,u(e(e({},layoutProps),a),{components:t,mdxType:\"MDXLayout\"}),mdx(\"h1\",e({},{id:\"setting-and-locations\"}),mdx(\"a\",e({parentName:\"h1\"},{className:\"header-link\",href:\"#setting-and-locations\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Setting and Locations\"),mdx(\"p\",null,\"The next step is to figure out where your adventure is going to take place, and come up with a bunch of fun locations.\"),mdx(\"h2\",e({},{id:\"unique-setting\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#unique-setting\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Unique Setting\"),mdx(\"p\",null,'I recommend trying to stay away from the generic settings (\"fantasy town\", \"magic forest\", \"small village\") - try to add an interesting twist to your setting, come up with something that makes it unique.'),mdx(\"p\",null,\"One good way to do that is to think about settings you don't normally see in the adventures, or settings you really like, or unusual biomes.\"),mdx(\"p\",null,\"Apply the same principles you have learned in the lesson on generating ideas - combine things that are not usually combined, reverse or exaggerate ideas, swap the concrete elements for something else.\"),mdx(\"blockquote\",null,mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"Exotic settings: \",mdx(\"ul\",{parentName:\"li\"},mdx(\"li\",{parentName:\"ul\"},'\"Egyptian Pyramids\" is better than \"Typical Fantasy City\".'),mdx(\"li\",{parentName:\"ul\"},'\"Amazon Tribe Village\", or a \"Cliff-side Village\" is better than \"Generic Medieval Fantasy Village\".'),mdx(\"li\",{parentName:\"ul\"},'\"Fantasy Subway\" is better than \"Sewers Under the City\".'))),mdx(\"li\",{parentName:\"ul\"},\"Reverse the element:\",mdx(\"ul\",{parentName:\"li\"},mdx(\"li\",{parentName:\"ul\"},\"Egypt is hot => Ice-Covered Egyptian Pyramids\"),mdx(\"li\",{parentName:\"ul\"},\"Pyramids are ancient => Pyramids are just in the process of being built.\"),mdx(\"li\",{parentName:\"ul\"},\"Pyramids are low-tech => Alien high-tech steel Pyramids.\"))),mdx(\"li\",{parentName:\"ul\"},\"Replace the element:\",mdx(\"ul\",{parentName:\"li\"},mdx(\"li\",{parentName:\"ul\"},\"Pyramid is filled with Mummies => Egyptian Vampires.\"),mdx(\"li\",{parentName:\"ul\"},\"Pyramid is a place to store dead Pharaoh => It is a Factory, or a Magic School.\"))),mdx(\"li\",{parentName:\"ul\"},\"Exaggerate the element: \",mdx(\"ul\",{parentName:\"li\"},mdx(\"li\",{parentName:\"ul\"},\"Mountain-sized Pyramids.\"),mdx(\"li\",{parentName:\"ul\"},\"A world where everyone has their own Pyramid.\"))))),mdx(\"p\",null,\"Another great way to make a setting unique is to fill it with interesting inhabitants.\"),mdx(\"blockquote\",null,mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"Typical fantasy village inhabited by Kobolds or Zombies. \"),mdx(\"li\",{parentName:\"ul\"},\"Typical fantasy city inhabited by Professional Assassins.\"),mdx(\"li\",{parentName:\"ul\"},\"Typical fantasy dungeon inhabited by Scientists and Scholars.\"))),mdx(\"p\",null,\"And, of course, you can combine both methods to make both the setting and its inhabitants unique and interesting.\"),mdx(\"p\",null,\"Think about other aspects of your setting:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Physical: Geography, flora and fauna, climate, magic, technology, etc.\"),mdx(\"li\",{parentName:\"ul\"},\"Cultural: Customs, politics, religions, occupations, fashion, history, etc.\")),mdx(\"p\",null,\"You can apply the same principles to make one of these aspects unusual and weird:\"),mdx(\"blockquote\",null,mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"Unusual flora: plants made out of meat.\"),mdx(\"li\",{parentName:\"ul\"},\"Unusual climate: sentient tornadoes.\"),mdx(\"li\",{parentName:\"ul\"},\"Unusual customs: annual jellyfish day celebration.\"),mdx(\"li\",{parentName:\"ul\"},\"Unusual occupations: Kaiju tamer.\"))),mdx(\"p\",null,\"Just don't overdo it, especially for a one-shot adventure - worldbuilding can get complicated, and you should keep things simple. One or two unique aspects for the setting is enough.\"),mdx(\"p\",null,\"Finally, what I actually do in practice most of the time - just browse \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.artstation.com/search?sort_by=likes&category_ids=5&medium_ids=1\"}),\"ArtStation\"),\", or search \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.pinterest.com/search/pins/?q=Fantasy%20Environment%20Design&rs=typed&term_meta%5B%5D=Fantasy%7Ctyped&term_meta%5B%5D=Environment%7Ctyped&term_meta%5B%5D=Design%7Ctyped\"}),\"Pinterest\"),' for things like \"Fantasy Environment Design\", or browse the ',mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.reddit.com/r/ImaginaryLandscapes/top/?sort=top&t=all\"}),\"Imaginary Network\"),\" subreddits, and use a setting inspired by one of the images. You can find my collection of fun environments \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.artstation.com/lumenwrites/collections/119125\"}),\"here\"),\".\"),mdx(\"h2\",e({},{id:\"locations\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#locations\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Locations\"),mdx(\"p\",null,\"Think about the specific locations you want your players to visit.\"),mdx(\"p\",null,\"The most important location is the one where Climax is going to take place - you want some epic, dramatic, and memorable set piece. \"),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},\"If our adventure takes place in the Pyramids, some good climax locations would be:\"),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"Top of the Pyramid.\"),mdx(\"li\",{parentName:\"ul\"},\"Pharaoh's Tomb with the Cursed Sarcophagus.\"),mdx(\"li\",{parentName:\"ul\"},\"Secret Chamber filled with Snakes.\"))),mdx(\"p\",null,\"You also want to figure out the location where the adventure begins, and 3-5 interesting places in-between. Just picture your setting, and think about the most interesting and remarkable places.\"),mdx(\"p\",null,\"For each location it is useful to come up with an evocative name that sparks imagination, and 2-4 important aspects - useful details, notable features, elements that the players can (or have to) interact with.\"),mdx(\"p\",null,\"Think about the aspects of the location that can:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Present obstacles and dangers.\"),mdx(\"li\",{parentName:\"ul\"},\"Present advantages or opportunities for the players to use their skills and powers.\"),mdx(\"li\",{parentName:\"ul\"},\"Tell the players something about the world of the story.\"),mdx(\"li\",{parentName:\"ul\"},\"Evoke curiosity.\")),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},\"The Tomb of Lost Souls\"),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"It's filled with traps and curses to present dangers.\"),mdx(\"li\",{parentName:\"ul\"},\"Its corridors can be collapsed onto the enemies, its torches can be used to illuminate the dark corners or set things on fire, its mindless mummies can be used as weapons or a form of cheap labor.\"),mdx(\"li\",{parentName:\"ul\"},\"Its walls have writings on them telling secrets to the ones who can discern them, and hinting at the Tomb's tragic origins.\"))),mdx(\"p\",null,\"Developing locations early in the brainstorming process is very convenient, because they can help you to establish the plot points and encounters you will be inventing later on.\"),mdx(\"p\",null,\"Many adventure plots come down to players going on a journey through a series of locations, each presenting it's own unique opportunities, challenges, dangers. But even when your adventure isn't focused on a journey from place to place, interesting locations will always help your imagination and make the following steps easier.\"),mdx(\"h3\",e({},{id:\"locations-as-antagonists\"}),mdx(\"a\",e({parentName:\"h3\"},{className:\"header-link\",href:\"#locations-as-antagonists\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Locations as Antagonists\"),mdx(\"p\",null,\"One great way to make locations more interesting is to think about the environmental threats and dangers the players may find in the location. That turns the location from a pretty backdrop into an active part of the story that requires some creativity to deal with.\"),mdx(\"blockquote\",null,mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"Icy Tundra where you must find heat to survive.\"),mdx(\"li\",{parentName:\"ul\"},\"River of lava you must find a way to cross.\"),mdx(\"li\",{parentName:\"ul\"},\"Crumbling temple you must escape.\"))),mdx(\"p\",null,'Think of locations as sentient beings that \"want\" to do something to players - Icy tundra \"wants\" the players to freeze, mysterious swamps \"want\" the players to get lost in them. Now you can use these \"desires\" as a way to make the location more interactive and invent more ideas about things that might happen to players. What \"strategies\" would this place use to accomplish its objectives?'),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},'Icy Tundra \"wants\" the players to freeze.'),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"It can use the howling winds to make them colder.\"),mdx(\"li\",{parentName:\"ul\"},\"It can use snowfall to make it difficult to find shelter.\"),mdx(\"li\",{parentName:\"ul\"},\"It can use ice to injure one of the players.\"),mdx(\"li\",{parentName:\"ul\"},\"It can use white bears to attack players at the worst possible moment.\"))),mdx(\"hr\",null),mdx(\"h2\",e({},{id:\"action-steps\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#action-steps\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Action Steps\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Choose a setting for your adventure, the general area where it is going to take place.\"),mdx(\"li\",{parentName:\"ul\"},\"Come up with a fun and interesting twist on the setting. What are the 3 most interesting/unusual things about this region?\"),mdx(\"li\",{parentName:\"ul\"},\"Come up with locations. Choose where the adventure begins, where the climax takes place, and 3-5 places in-between. What kind of dangers or obstacles can each location present?\"),mdx(\"li\",{parentName:\"ul\"},\"Optional: find some cool images that depict the setting.\"),mdx(\"li\",{parentName:\"ul\"},\"Share your ideas in the \",mdx(\"inlineCode\",{parentName:\"li\"},\"#settings-and-locations\"),\" channel.\")))}MDXContent.isMDXComponent=!0;\n","scope":{}},"prev":{"title":"Primary Objective","url":"/adventure-brainstorming/primary-objective"},"next":{"title":"Main Characters","url":"/adventure-brainstorming/main-characters"}},"main-characters":{"title":"Main Characters","slug":"main-characters","description":"","thumbnail":null,"preview":false,"draft":false,"url":"/adventure-brainstorming/main-characters","compiledMdx":{"compiledSource":"var c=Object.defineProperty,m=Object.defineProperties;var u=Object.getOwnPropertyDescriptors;var n=Object.getOwnPropertySymbols;var o=Object.prototype.hasOwnProperty,s=Object.prototype.propertyIsEnumerable;var l=(a,t,i)=>t in a?c(a,t,{enumerable:!0,configurable:!0,writable:!0,value:i}):a[t]=i,e=(a,t)=>{for(var i in t||(t={}))o.call(t,i)&&l(a,i,t[i]);if(n)for(var i of n(t))s.call(t,i)&&l(a,i,t[i]);return a},h=(a,t)=>m(a,u(t));var d=typeof require!=\"undefined\"?require:a=>{throw new Error('Dynamic require of \"'+a+'\" is not supported')};var p=(a,t)=>{var i={};for(var r in a)o.call(a,r)&&t.indexOf(r)<0&&(i[r]=a[r]);if(a!=null&&n)for(var r of n(a))t.indexOf(r)<0&&s.call(a,r)&&(i[r]=a[r]);return i};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(i){var r=i,{components:a}=r,t=p(r,[\"components\"]);return mdx(MDXLayout,h(e(e({},layoutProps),t),{components:a,mdxType:\"MDXLayout\"}),mdx(\"h1\",e({},{id:\"main-characters\"}),mdx(\"a\",e({parentName:\"h1\"},{className:\"header-link\",href:\"#main-characters\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Main Characters\"),mdx(\"p\",null,\"Now you need some characters to populate your story.\"),mdx(\"h2\",e({},{id:\"simplified-character-design\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#simplified-character-design\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Simplified Character Design\"),mdx(\"p\",null,\"Many books have been written on how to design good characters and make them seem realistic. Luckily, for adventures, it doesn't need to be that complicated.\"),mdx(\"p\",null,\"Here's what you need to know about your main characters:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Name\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Description\"),\" - Your character's appearance, mannerisms, speech patterns.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Personality\"),\" - Values, Ideals, Flaws, Opinions, Likes.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Occupation\"),\" - What do they do with their life?\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Motivations\"),\" - What do they want? What do they fear?\")),mdx(\"p\",null,\"Here are some optional things you may want to consider:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Relationships - their Allies, Enemies, Social Status, Factions they belong to.\"),mdx(\"li\",{parentName:\"ul\"},\"Resources at their command (such as wealth or political power).\"),mdx(\"li\",{parentName:\"ul\"},\"Unique Powers/Spells/Items.\"),mdx(\"li\",{parentName:\"ul\"},\"Secrets they know.\")),mdx(\"p\",null,\"The easiest way to make your character more interesting is to give them an agenda, a strong desire (which may or may not be related to the plot and the players). Characters that really want something are much easier to play, and much more fun to interact with.\"),mdx(\"p\",null,\"A convenient checklist:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"What does the NPC want?\"),mdx(\"li\",{parentName:\"ul\"},\"Do they have goals completely unrelated to the players?\"),mdx(\"li\",{parentName:\"ul\"},\"What do the players want from this NPC?\"),mdx(\"li\",{parentName:\"ul\"},\"Are their goals in opposition or in alignment with the heroes' goals?\"),mdx(\"li\",{parentName:\"ul\"},\"Why can't players get what they want through force? \")),mdx(\"h2\",e({},{id:\"coming-up-with-character-ideas\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#coming-up-with-character-ideas\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Coming up with Character Ideas\"),mdx(\"p\",null,\"The easiest way to come up with the physical appearance for a character is to find a well-suited illustration. Search websites like \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.artstation.com/search?sort_by=likes&category_ids=65&medium_ids=1\"}),\"ArtStation\"),\" and \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.pinterest.com/search/pins/?q=fantasy%20character%20design&rs=typed&term_meta%5B%5D=fantasy%7Ctyped&term_meta%5B%5D=character%7Ctyped&term_meta%5B%5D=design%7Ctyped\"}),\"Pinterest\"),' for things like \"Fantasy Character Design\", or visit ',mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.reddit.com/r/ImaginaryCharacters/top/\"}),\"/r/ImaginaryCharacters\"),'. Sometimes you want to search for something more specific, like \"Evil Voodoo Shaman\". Having a picture of your character will instantly give you most of the information you need to vividly describe and roleplay them.'),mdx(\"p\",null,\"Personality is also easy - just take your favorite characters from TV and movies. To make your ideas more original you can:\"),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Reverse their key character traits\"),\":\"),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"Creepy and evil Hermione.\"),mdx(\"li\",{parentName:\"ul\"},\"Shy and humble Joker.\"),mdx(\"li\",{parentName:\"ul\"},\"Compassionate and Loving Dr House.\"),mdx(\"li\",{parentName:\"ul\"},\"Well-meaning doofus Darth Vader who tries to do good but fails terribly.\"))),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Apply personality to a character you wouldn't expect\"),\":\"),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"The Supreme Holy Emperor with the personality of Homer Simpson.\"),mdx(\"li\",{parentName:\"ul\"},\"Humble Peasant with the personality of Walter White.\"),mdx(\"li\",{parentName:\"ul\"},\"Princess with the personality of Indiana Jones.\"),mdx(\"li\",{parentName:\"ul\"},\"Bartender with the personality of Spock.\"),mdx(\"li\",{parentName:\"ul\"},\"Paladin with the personality of Chandler Bing.\"))),mdx(\"p\",null,\"You can even lift the entire characters (appearance, personality, motivation, occupation, and so on) from your favorite movies and TV shows - since your story is different, your players are unlikely to make the connection. To make it less obvious you can use Sci-Fi characters in Fantasy stories and vice versa, or reverse the character's gender, or reverse their social status.\"),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},\"Examples:\"),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"Iron Man but in a fantasy universe - a brilliant aristocrat inventing steampunk machines in his spare time.\"),mdx(\"li\",{parentName:\"ul\"},\"Low-status Gandalf - an ancient wizard shyly mumbling something about the powerful artifact that would be nice to destroy, if that's not too much of an inconvenience to you.\"),mdx(\"li\",{parentName:\"ul\"},\"Female Yoda - an old goblin witch the players can always come to for wisdom and advice.\"))),mdx(\"p\",null,\"These methods make coming up with interesting characters very easy, using a well known character or a celebrity as a reference (with some tweaks) makes it instantly obvious how to write and roleplay the character.\"),mdx(\"h2\",e({},{id:\"main-characters-1\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#main-characters-1\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Main Characters\"),mdx(\"p\",null,\"Use the Simplified Character Design method to design your cast of characters:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Antagonist\"),mdx(\"br\",{parentName:\"li\"}),\"is the most important character by far, and they should be the most fleshed-out. They are the primary opposition to your player's Objective, their goals are the opposite of your players'. They will be the main source of obstacles for players to overcome, their desires and goals will often drive the story forward (or cause it to happen in the first place), and they should probably be the most interesting NPC in your adventure.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Evil Minions\"),mdx(\"br\",{parentName:\"li\"}),\"are the Antagonist's servants, their goal is to serve the antagonist. Antagonist will often use them as primary tools to oppose the players. They can also be used to the players' advantage, they can be bribed or seduced to the heroes' side, intimidated into revealing some information or betraying their master, fooled, used as a disguise to infiltrate the evil lair, and so on.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Quest Giver\"),mdx(\"br\",{parentName:\"li\"}),\"is the character that sends players on their adventure. They can ask players for help, hire them to do a job, send them on a mission, or otherwise manipulate them into a situation where they have to engage with the story.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Allies\"),mdx(\"br\",{parentName:\"li\"}),\"are the other characters aligned with the heroes' goals. They can help them on their quest, provide resources, narrate some exposition, serve as comic relief.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Neutral NPCs\"),mdx(\"br\",{parentName:\"li\"}),\"Sometimes you need a witness to a crime, a bouncer guarding the place that the players need to get into, a shop owner who can be persuaded to help players in exchange for some favor, etc.\")),mdx(\"p\",null,\"As you may have noticed, the NPC roles are defined in relation to the players' Objective - they can oppose the players, ally with them, or be neutral. That is the best way to think about the cast and to select which characters matter the most - the ones who have the most impact on the players' goals. \"),mdx(\"p\",null,\"Don't make the list of characters too long or too complicated, you don't need to design the minor unimportant NPCs - the GM can improvise those on the fly. Especially in a one-shot, 3-5 core characters is often all you need.\"),mdx(\"h2\",e({},{id:\"antagonist-driven-adventures\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#antagonist-driven-adventures\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Antagonist-Driven Adventures\"),mdx(\"p\",null,\"Most of the time the players' actions and choices drive the story forward, and NPCs are there to provide obstacles or help on their path. Players are active, NPCs are passive. Players want things and try to accomplish their goals, NPCs react to their actions. But there's one exception to this:\"),mdx(\"p\",null,`Antagonist is the one NPC who's actions can drive the story forward. Making your antagonist Active is a great way to make sure that your adventure doesn't feel like it is \"on the rails\", like players just walk through the story laid out for them. When the players take actions, the world (the antagonist) is going to react. `),mdx(\"p\",null,\"This will make the adventure more dynamic, the events will change in response to the players' actions. You won't have to always rely on the players to drive the story forward - they can be put on the defensive, forced to respond to villains's actions.\"),mdx(\"p\",null,\"When you're creating an antagonist-driven adventure, the Villain's evil plan is the plot of the adventure. Once you know what the Villain wants and the steps they're going to take to get it - you can figure out the series of challenges players must take on to stop them.\"),mdx(\"p\",null,\"In addition to the Simplified Character Design outlined above, for the Active Antagonist you want to answer the following questions:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"What is their goal? Why do they pursue it? What horrible thing will happen if they succeed? \"),mdx(\"li\",{parentName:\"ul\"},\"What are the steps of their evil plan? How would the plot unfold if they were completely unopposed by the players? \"),mdx(\"li\",{parentName:\"ul\"},\"How will the players learn about the plan, when will the players' and the villain's goals collide for the first time? \"),mdx(\"li\",{parentName:\"ul\"},\"What could players do to disrupt and ultimately ruin the plan? How will the villain respond to these disruptions? \"),mdx(\"li\",{parentName:\"ul\"},'What resources do they have to accomplish their goal, fight back against players, and get their plan back on track? What \"moves\" will they make to make life more difficult for the players?')),mdx(\"p\",null,\"Unlike in written stories and computer games, in TTRPGs the antagonist is simulated using your actual human brain, so they can be truly creative and flexible. The Villain has a goal, they're going to pursue it, and intelligently respond to the players' attempts to thwart them. Players will attempt to interrupt them at every step, and the villain is going to fight back using all the powers and resources at their disposal.\"),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Active Villains can\"),\":\"),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"Trick and manipulate the players.\"),mdx(\"li\",{parentName:\"ul\"},\"Set up ambushes, lure players into traps.\"),mdx(\"li\",{parentName:\"ul\"},\"Send minions after the heroes.\"),mdx(\"li\",{parentName:\"ul\"},\"Flee, forcing the heroes to give chase.\"),mdx(\"li\",{parentName:\"ul\"},\"Take hostages, kidnap or threaten innocent characters.\"),mdx(\"li\",{parentName:\"ul\"},\"Seduce/intimidate players' allies to the dark side.\"),mdx(\"li\",{parentName:\"ul\"},\"Bribe, persuade, or intimidate people in power.\"),mdx(\"li\",{parentName:\"ul\"},\"Use their political power/influence.\"),mdx(\"li\",{parentName:\"ul\"},\"Send double agents to infiltrate the players (traitors and spies).\"),mdx(\"li\",{parentName:\"ul\"},\"Hire an assassin, bounty hunter, a rival team of adventurers.\"),mdx(\"li\",{parentName:\"ul\"},\"Frame heroes for a crime.\"),mdx(\"li\",{parentName:\"ul\"},\"Reveal heroes\\u2019 secrets.\"),mdx(\"li\",{parentName:\"ul\"},\"Have a \\u201Cdead man switch\\u201D.\"),mdx(\"li\",{parentName:\"ul\"},\"Set up a ticking time-bomb.\"),mdx(\"li\",{parentName:\"ul\"},\"Impersonate someone else.\"),mdx(\"li\",{parentName:\"ul\"},\"Befriend and betray the heroes.\"),mdx(\"li\",{parentName:\"ul\"},\"Plant false clues, decoys.\"),mdx(\"li\",{parentName:\"ul\"},\"Foster rivalries, mistrust, disorder\"),mdx(\"li\",{parentName:\"ul\"},\"Create difficult moral dilemmas for the heroes.\"),mdx(\"li\",{parentName:\"ul\"},\"Take away (steal or destroy) a key resource heroes rely on.\"),mdx(\"li\",{parentName:\"ul\"},\"Mislead everyone about their weaknesses.\"),mdx(\"li\",{parentName:\"ul\"},\"Use heroes\\u2019 flaws/temptations/fears against them\"),mdx(\"li\",{parentName:\"ul\"},\"Develop a good public image, make the public dislike the heroes.\"))),mdx(\"p\",null,\"Not all adventures require an active antagonist. Sometimes it's okay to just have an evil monster to defeat, a priceless artifact to heist, a dangerous environment to survive.\"),mdx(\"p\",null,\"But I hope you can see all the ways the adventure can become deeper and more interesting when the heroes are playing against an intelligent and proactive opponent.\"),mdx(\"hr\",null),mdx(\"h2\",e({},{id:\"action-steps\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#action-steps\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Action Steps\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Come up with the main antagonist for your adventure. Choose their name, personality, occupation, and the main motivation. \"),mdx(\"li\",{parentName:\"ul\"},\"Design the other important characters in your adventure - Quest Giver, Minions, Allies, Neutral NPCs.\"),mdx(\"li\",{parentName:\"ul\"},\"Optional: find some cool images to represent your characters.\"),mdx(\"li\",{parentName:\"ul\"},\"Optional: If you want to design an Active Antagonist - figure out their evil plan and answer the other questions I've listed in this section.\"),mdx(\"li\",{parentName:\"ul\"},\"Share your ideas in the \",mdx(\"inlineCode\",{parentName:\"li\"},\"#developing-characters\"),\" channel.\"),mdx(\"li\",{parentName:\"ul\"},\"Extra Credit: Find someone else's post in that channel and give them some helpful and constructive feedback. How would you improve on their character idea?\")))}MDXContent.isMDXComponent=!0;\n","scope":{}},"prev":{"title":"Setting and Locations","url":"/adventure-brainstorming/setting-and-locations"},"next":{"title":"Key Plot Points","url":"/adventure-brainstorming/key-plot-points"}},"key-plot-points":{"title":"Key Plot Points","slug":"key-plot-points","description":"","thumbnail":null,"preview":false,"draft":false,"url":"/adventure-brainstorming/key-plot-points","compiledMdx":{"compiledSource":"var u=Object.defineProperty,m=Object.defineProperties;var c=Object.getOwnPropertyDescriptors;var i=Object.getOwnPropertySymbols;var r=Object.prototype.hasOwnProperty,l=Object.prototype.propertyIsEnumerable;var s=(e,a,o)=>a in e?u(e,a,{enumerable:!0,configurable:!0,writable:!0,value:o}):e[a]=o,t=(e,a)=>{for(var o in a||(a={}))r.call(a,o)&&s(e,o,a[o]);if(i)for(var o of i(a))l.call(a,o)&&s(e,o,a[o]);return e},h=(e,a)=>m(e,c(a));var d=typeof require!=\"undefined\"?require:e=>{throw new Error('Dynamic require of \"'+e+'\" is not supported')};var p=(e,a)=>{var o={};for(var n in e)r.call(e,n)&&a.indexOf(n)<0&&(o[n]=e[n]);if(e!=null&&i)for(var n of i(e))a.indexOf(n)<0&&l.call(e,n)&&(o[n]=e[n]);return o};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(o){var n=o,{components:e}=n,a=p(n,[\"components\"]);return mdx(MDXLayout,h(t(t({},layoutProps),a),{components:e,mdxType:\"MDXLayout\"}),mdx(\"h1\",t({},{id:\"key-plot-points\"}),mdx(\"a\",t({parentName:\"h1\"},{className:\"header-link\",href:\"#key-plot-points\"}),mdx(\"span\",t({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Key Plot Points\"),mdx(\"p\",null,\"Now we need to figure out the plot of our story. There are many different story structures, some of them involve up to 15 plot points (like the \",mdx(\"a\",t({parentName:\"p\"},{href:\"https://www.savannahgilbo.com/blog/plotting-save-the-cat\"}),\"Save The Cat\"),\" methodology). Adventures don't need to be anywhere near as complex as the movies or novels, so I ended up designing a simple and straightforward story structure that works really well for the adventures.\"),mdx(\"p\",null,\"The key plot points of our story structure are:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Adventure Hook.\"),mdx(\"li\",{parentName:\"ul\"},\"Twist.\"),mdx(\"li\",{parentName:\"ul\"},\"Climax.\")),mdx(\"h2\",t({},{id:\"adventure-hook\"}),mdx(\"a\",t({parentName:\"h2\"},{className:\"header-link\",href:\"#adventure-hook\"}),mdx(\"span\",t({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Adventure Hook\"),mdx(\"p\",null,\"Adventure Hook is the moment at the beginning of the adventure that establishes the Primary Objective of the players - they encounter a problem they must solve or the goal they want to achieve.\"),mdx(\"p\",null,\"The point of the Adventure Hook is to draw the heroes into action, capture the players' interest, give them the motivation to accomplish their goal, and give them the initial set of tasks to accomplish. You want to establish the world that the players are in, and then, without much delay, introduce them to the quest. \"),mdx(\"p\",null,\"You want to make sure that:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Players know what their goal is.\"),mdx(\"li\",{parentName:\"ul\"},\"Players care about accomplishing the goal.\"),mdx(\"li\",{parentName:\"ul\"},\"Players know what they need to do next.\")),mdx(\"p\",null,\"How can you do that? There are many ways to introduce a quest.\"),mdx(\"p\",null,mdx(\"strong\",{parentName:\"p\"},\"When in doubt - throw the heroes into action as soon as you can\"),\".\"),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},\"Ways to throw the heroes into action:\"),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},'Start \"In medias res\" (in the midst of the plot) - start the adventure with players already in the middle of dramatic action. For example being chased by someone, or teleported to an unfamiliar place, or stranded in a dangerous territory, or in the middle of a sinking ship.'),mdx(\"li\",{parentName:\"ul\"},\"Start with combat. Getting attacked or ambushed is sure to capture players' attention and motivate them to deal with the threat. Or maybe a fight breaks out around the players, and they see some innocents being harmed.\"),mdx(\"li\",{parentName:\"ul\"},\"Players witness a crime or injustice (committed against someone else or themselves). For example, someone being dragged to jail while claiming to be innocent.\"),mdx(\"li\",{parentName:\"ul\"},\"Start with a non-violent conflict. For example - someone is accusing someone of cheating, a King died yesterday and now there's a power vacuum, someone outlawed alcohol, a group of thugs come to the village demanding tribute.\"),mdx(\"li\",{parentName:\"ul\"},`Put the world around the players in danger. The city is being invaded by evil legions or King's paladins on a \"peacekeeping\" mission.`))),mdx(\"p\",null,\"Another good approach is to \",mdx(\"strong\",{parentName:\"p\"},\"start with a good mystery or something supernatural\"),\", make the players curious, have them witness some strange magic taking place.\"),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Start with a mystery\"),\":\"),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"A dead body has appeared in the middle of a crowded street.\"),mdx(\"li\",{parentName:\"ul\"},\"Players find a bloodied dagger with a mysterious note.\"),mdx(\"li\",{parentName:\"ul\"},\"All the cats in the village have disappeared overnight.\"),mdx(\"li\",{parentName:\"ul\"},\"Everyone in the city has suddenly fallen asleep except the players.\"),mdx(\"li\",{parentName:\"ul\"},\"Heroes are approached by a superintelligent rat.\"),mdx(\"li\",{parentName:\"ul\"},\"The city is getting covered in thick purple mist with something dangerous inside.\"),mdx(\"li\",{parentName:\"ul\"},\"The sun has failed to rise and replace the moon this morning.\"),mdx(\"li\",{parentName:\"ul\"},\"The ghost of an old king has appeared to claim the throne.\"),mdx(\"li\",{parentName:\"ul\"},\"Players rest on the beach when they see an army of merfolk rising up from the water.\"))),mdx(\"p\",null,\"You can keep it simple and introduce the mission using a Quest Giver character.\"),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Start with Quest Giver\"),\":\"),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"Someone runs up to players begging for help.\"),mdx(\"li\",{parentName:\"ul\"},\"A wealthy merchant is hiring them to do a shady job.\"),mdx(\"li\",{parentName:\"ul\"},\"A secret agent is sending them on a mission.\"),mdx(\"li\",{parentName:\"ul\"},\"Their friend sends them a letter from prison.\"),mdx(\"li\",{parentName:\"ul\"},\"They see a sad kid crying, looking for his mom.\"),mdx(\"li\",{parentName:\"ul\"},\"Someone sells them a suspiciously cheap treasure map.\"))),mdx(\"p\",null,\"You can also start at a point where the player's actions first clash with the Villain's plans - any of the examples above could have been caused by the main Antagonist doing his dastardly deeds to unknown ends. In that case, you would design your Antagonist's plan first, and then figure out a way for the players to notice it and intervene.\"),mdx(\"h2\",t({},{id:\"twist\"}),mdx(\"a\",t({parentName:\"h2\"},{className:\"header-link\",href:\"#twist\"}),mdx(\"span\",t({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Twist\"),mdx(\"p\",null,\"As the heroes pursue their goal, they will have to overcome a series of obstacles. But if we just made the players go through a list of random encounters between the Hook and the Climax, it would quickly get predictable and boring. That's why we need the Twist.\"),mdx(\"p\",null,\"The second important purpose of the twist is to raise the stakes and threat level. We want the challenges heroes are facing to progressively escalate, and adding a twist in the middle of the story is a great way to increase the tension.\"),mdx(\"p\",null,\"Twist usually happens halfway through the adventure, the heroes encounter something surprising or unexpected that changes the direction of the story. \"),mdx(\"p\",null,\"The easiest way to do that is to introduce an \",mdx(\"strong\",{parentName:\"p\"},\"unexpected complication\"),\" which makes the goal much more difficult to accomplish.  \"),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Examples of complications\"),\":\"),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"The path to the objective is blocked, a more difficult way must be found.\"),mdx(\"li\",{parentName:\"ul\"},\"Environment around the heroes becomes dangerous.\"),mdx(\"li\",{parentName:\"ul\"},\"A big risk or sacrifice is necessary to proceed.\"),mdx(\"li\",{parentName:\"ul\"},\"Heroes are captured/trapped and must escape.\"),mdx(\"li\",{parentName:\"ul\"},\"Key item is lost, stolen, or turns out to be fake.\"),mdx(\"li\",{parentName:\"ul\"},\"Transportation is sabotaged or stolen.\"),mdx(\"li\",{parentName:\"ul\"},\"Heroes are betrayed by a key ally. \"),mdx(\"li\",{parentName:\"ul\"},\"Important location is destroyed.\"),mdx(\"li\",{parentName:\"ul\"},\"Enemy discovers heroes\\u2019 weakness.\"),mdx(\"li\",{parentName:\"ul\"},\"Enemy is warned of the heroes\\u2019 actions.\"),mdx(\"li\",{parentName:\"ul\"},\"Innocents are in danger, require help.\"))),mdx(\"p\",null,\"Alternatively, you can \",mdx(\"strong\",{parentName:\"p\"},\"reveal some surprising information\"),\". That is your classic plot twist.\"),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Examples of surprising reveals\"),\":\"),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"Players were searching for answers (investigating a crime, solving a mystery), now they know what's going on, and must go and stop the antagonist from doing something terrible.\"),mdx(\"li\",{parentName:\"ul\"},\"Villain's secret plan is revealed, and must be stopped at any cost.\"),mdx(\"li\",{parentName:\"ul\"},\"Enemy turns out to be more powerful than expected (or gets backup).\"),mdx(\"li\",{parentName:\"ul\"},\"The real evil guy is revealed (maybe their Ally was a Villain all along).\"),mdx(\"li\",{parentName:\"ul\"},\"Heroes' employers turn out to be evil.\"),mdx(\"li\",{parentName:\"ul\"},\"The defeated villain turns out to be just a pawn in a much larger plot.\"),mdx(\"li\",{parentName:\"ul\"},\"Antagonist turns out to be innocent and must be helped.\"),mdx(\"li\",{parentName:\"ul\"},\"Everything the heroes were doing up to this point was leading them straight into a trap.\"),mdx(\"li\",{parentName:\"ul\"},\"Heroes were tricked into doing the Villain's bidding.\"),mdx(\"li\",{parentName:\"ul\"},\"Heroes unwittingly cause a disaster (the Princes they've saved turned out to be a ruthless tyrant).\"),mdx(\"li\",{parentName:\"ul\"},\"Key information players relied on turns out to be wrong.\"))),mdx(\"p\",null,\"Another type of twist can come from the Antagonist. \",mdx(\"strong\",{parentName:\"p\"},\"The Villain notices the heroes' actions and makes a move, begins to fight back.\"),\" You can see the list of moves a villain can make in the previous lesson.\"),mdx(\"h2\",t({},{id:\"climax\"}),mdx(\"a\",t({parentName:\"h2\"},{className:\"header-link\",href:\"#climax\"}),mdx(\"span\",t({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Climax\"),mdx(\"p\",null,\"Climax is the cool, exciting, dramatic, memorable ending to the adventure. Final, most important and dangerous challenge, a point in the story that resolves the main conflict. Ideally, you want it to be an epic scene at a cool location.\"),mdx(\"p\",null,\"Depending on the outcome of this challenge the heroes will either succeed, defeat the antagonist, and get what they want, or lose and fail to achieve their goal.\"),mdx(\"p\",null,\"This is where the heroes blow up the Death Star, drop the ring into Mount Doom, defeat Voldemort, escape from their prison, leave the vault with all the stolen treasure, with a super important court case, rescue that princess, find Nemo.\"),mdx(\"p\",null,\"You create the Climax by looking at your player's Primary Objective, and figuring out what is the ultimate action the players must take to accomplish it (and what makes this action difficult and dangerous), what challenge must they overcome to succeed.\"),mdx(\"p\",null,'Because the Climax is so closely tied to the Objective, and takes place at the Epic Climactic Set Piece you have designed in the \"Setting and Locations\" lesson, and is probably the moment when the players face off against their Antagonist - you already know most of the things you need to figure out about what exactly what needs to happen.'),mdx(\"p\",null,\"You just need to make sure that the problem is solvable given the tools that the players have, that they know what they need to do, and have plausible approaches to accomplishing it. It's a good idea to make sure that you can think of at least a couple of things the players could do to win, so that they don't have to face an unsolvable problem.\"),mdx(\"p\",null,\"It is also always good to try to design an alternative non-combat or stealthy approach the players can take. \"),mdx(\"hr\",null),mdx(\"h2\",t({},{id:\"activity\"}),mdx(\"a\",t({parentName:\"h2\"},{className:\"header-link\",href:\"#activity\"}),mdx(\"span\",t({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Activity\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Come up with an exciting Adventure Hook. How do the players encounter the problem?\"),mdx(\"li\",{parentName:\"ul\"},\"Come up with a surprising plot twist or a complication the heroes will encounter halfway through the adventure.\"),mdx(\"li\",{parentName:\"ul\"},\"Figure out what happens at the Climax.\"),mdx(\"li\",{parentName:\"ul\"},\"Share your ideas in the \",mdx(\"inlineCode\",{parentName:\"li\"},\"#plotting-and-outlining\"),\" channel and ask people for feedback.\"),mdx(\"li\",{parentName:\"ul\"},\"Extra Credit: See if you can leave some insightful feedback on posts made by others.\")))}MDXContent.isMDXComponent=!0;\n","scope":{}},"prev":{"title":"Main Characters","url":"/adventure-brainstorming/main-characters"},"next":{"title":"Escalating Challenges","url":"/adventure-brainstorming/escalating-challenges"}},"escalating-challenges":{"title":"Escalating Challenges","slug":"escalating-challenges","description":"","thumbnail":null,"preview":false,"draft":false,"url":"/adventure-brainstorming/escalating-challenges","compiledMdx":{"compiledSource":"var u=Object.defineProperty,p=Object.defineProperties;var m=Object.getOwnPropertyDescriptors;var o=Object.getOwnPropertySymbols;var i=Object.prototype.hasOwnProperty,r=Object.prototype.propertyIsEnumerable;var s=(a,t,n)=>t in a?u(a,t,{enumerable:!0,configurable:!0,writable:!0,value:n}):a[t]=n,e=(a,t)=>{for(var n in t||(t={}))i.call(t,n)&&s(a,n,t[n]);if(o)for(var n of o(t))r.call(t,n)&&s(a,n,t[n]);return a},h=(a,t)=>p(a,m(t));var d=typeof require!=\"undefined\"?require:a=>{throw new Error('Dynamic require of \"'+a+'\" is not supported')};var c=(a,t)=>{var n={};for(var l in a)i.call(a,l)&&t.indexOf(l)<0&&(n[l]=a[l]);if(a!=null&&o)for(var l of o(a))t.indexOf(l)<0&&r.call(a,l)&&(n[l]=a[l]);return n};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(n){var l=n,{components:a}=l,t=c(l,[\"components\"]);return mdx(MDXLayout,h(e(e({},layoutProps),t),{components:a,mdxType:\"MDXLayout\"}),mdx(\"h1\",e({},{id:\"escalating-challenges\"}),mdx(\"a\",e({parentName:\"h1\"},{className:\"header-link\",href:\"#escalating-challenges\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Escalating Challenges\"),mdx(\"p\",null,\"As we discussed before, stories are about problem solving. Now that we know the key plot points that can provide us with the general story structure, we can figure out the rest of the plot by creating a series of escalating challenges the heroes have to overcome on their path to the goal.\"),mdx(\"h2\",e({},{id:\"challenges-are-sub-goals\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#challenges-are-sub-goals\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Challenges are Sub-Goals\"),mdx(\"p\",null,\"Just like in real life, accomplishing a big and difficult goal involves achieving a number of smaller sub-goals. Primary Objective is the big overarching goal, which can be broken down into a series of smaller challenges. \"),mdx(\"p\",null,\"Every scene the characters try to solve a small problem, their successes take them closer to achieving their goal, the setbacks and complications take them farther away from that goal.\"),mdx(\"p\",null,\"Imagine a todo list the heroes would write as they try to achieve their Objective, list a series of steps that can take them from where they are to where they need to be, and then figure out what makes each step difficult.\"),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},\"In order to Rescue the Princess we need to:\"),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"Follow the clues to figure out what happened to the Princess, why did she disappear.\"),mdx(\"li\",{parentName:\"ul\"},\"Convince a cowardly Knight, the only person who knows where the dragon's lair is, to take us there.\"),mdx(\"li\",{parentName:\"ul\"},\"Learn that the dragon can only be slayed using the legendary sword, which he keeps in his hoard.\"),mdx(\"li\",{parentName:\"ul\"},\"Travel through the deadlands to the Dragon's Lair and face the dangers on our way there (defeat various beasts living there, survive heat and thirst, overcome traps laid by the dragon).\"),mdx(\"li\",{parentName:\"ul\"},\"Cross the rope bridge to the dragon's castle.\"),mdx(\"li\",{parentName:\"ul\"},\"Sneak through the castle and stealthily acquire the sword before the dragon notices and kills is.\"),mdx(\"li\",{parentName:\"ul\"},\"Slay the dragon while making sure the princess doesn't get hurt.\"))),mdx(\"h3\",e({},{id:\"challenges-are-just-small-objectives\"}),mdx(\"a\",e({parentName:\"h3\"},{className:\"header-link\",href:\"#challenges-are-just-small-objectives\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Challenges are just small Objectives\"),mdx(\"p\",null,\"Just like the goals are made out of sub-goals (which, in turn, are made out of even smaller sub-sub-goals), the Primary Objective and the Challenges are fundamentally the same kind of thing, just the goals/problems of a different scale.\"),mdx(\"p\",null,\"A Primary Objective from one adventure can serve as a Challenge in another - you can have a whole story about defending the village from a werewolf, or your heroes can slay a werewolf as they walk through the forest on their way to some larger goal. \"),mdx(\"p\",null,\"And the other way around, many Challenges your players face can be turned into a whole adventure of their own. In a One-Shot, acquiring the Legendary Dragon-Killing Sword is one of the Challenges the players need to accomplish, but in a campaign about killing a dragon, acquiring this sword can be a whole adventure - just make the challenge more difficult and break it down into even smaller sub-challenges to use as plot for that adventure.\"),mdx(\"p\",null,\"This is very useful to understand, because it means that you can apply everything you have learned about designing the Primary Objective to designing the challenges, and vice versa. It makes it much easier to generate ideas as well - you can use your Objective ideas (or ones taken from the movies) as challenges, and you can turn your challenges into bigger adventure ideas (by making them more dramatic and difficult to accomplish).\"),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},\"Using Objective Ideas as Challenges and vice versa:\"),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"Take a primary objective from Titanic (surviving a sinking ship), and use it as one of the challenges your heroes need to overcome on their path to the goal.\"),mdx(\"li\",{parentName:\"ul\"},\"Take a small challenge from Harry Potter, let's say, stealing a Hippogriff, and make a whole adventure about performing the legendary Hippogriff heist.\"))),mdx(\"h1\",e({},{id:\"types-of-challenges\"}),mdx(\"a\",e({parentName:\"h1\"},{className:\"header-link\",href:\"#types-of-challenges\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Types of Challenges\"),mdx(\"p\",null,\"You don't want your players to go from battle to battle, or from one trap-riddled corridor to another - it would get old pretty quickly. Try to mix a variety of different challenge types to make the experience more interesting.\"),mdx(\"p\",null,\"I have organized some of the common and useful challenges I tend to see in stories into 4 main categories. Don't hesitate to invent your own challenges and categories, if you can think of anything I haven't mentioned.\"),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Action/Adventure\")),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"Kill/defeat a person or a creature.\"),mdx(\"li\",{parentName:\"ul\"},\"Obtain or steal an item or information.\"),mdx(\"li\",{parentName:\"ul\"},\"Capture or chase a person or a creature.\"),mdx(\"li\",{parentName:\"ul\"},\"Rescue someone from trouble.\"),mdx(\"li\",{parentName:\"ul\"},\"Escape from pursuit.\"),mdx(\"li\",{parentName:\"ul\"},\"Protect someone or something from an attack.\"),mdx(\"li\",{parentName:\"ul\"},\"Invade or defend a location.\"),mdx(\"li\",{parentName:\"ul\"},\"Complete or sabotage a project (for example, a ritual).\"),mdx(\"li\",{parentName:\"ul\"},\"Race someone to the destination.\"),mdx(\"li\",{parentName:\"ul\"},\"Destroy a dangerous item or a location.\"),mdx(\"li\",{parentName:\"ul\"},\"Win a competition.\"))),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Social\")),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"Accomplish any of the other challenges through social, non-violent means.\"),mdx(\"li\",{parentName:\"ul\"},\"Convince someone to do you a favor, reveal a secret, do what you need them to do.\"),mdx(\"li\",{parentName:\"ul\"},\"Intimidate, bribe, blackmail, seduce, or distract someone.\"),mdx(\"li\",{parentName:\"ul\"},\"Resolve conflict between parties, broker peace.\"),mdx(\"li\",{parentName:\"ul\"},\"Pit people/factions against each other.\"),mdx(\"li\",{parentName:\"ul\"},\"Negotiate, close a deal, bargain.\"),mdx(\"li\",{parentName:\"ul\"},\"Make allies. Impress or befriend someone.\"),mdx(\"li\",{parentName:\"ul\"},\"Find a non-combat resolution.\"),mdx(\"li\",{parentName:\"ul\"},\"Persuade a group of people.\"),mdx(\"li\",{parentName:\"ul\"},\"Gain status, influence, fame, prove yourself.\"),mdx(\"li\",{parentName:\"ul\"},\"Organize or sabotage an event that must go without a hitch.\"),mdx(\"li\",{parentName:\"ul\"},\"Ensure the event goes as planned.\"),mdx(\"li\",{parentName:\"ul\"},\"Put down or incite rebellion/mutiny.\"),mdx(\"li\",{parentName:\"ul\"},\"Navigate a strange culture/customs.\"),mdx(\"li\",{parentName:\"ul\"},\"Recruit people to your cause.\"),mdx(\"li\",{parentName:\"ul\"},\"Put on a show, entertain.\"))),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Exploration\")),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"Overcome environmental obstacles (cross a river of lava, climb a mountain).\"),mdx(\"li\",{parentName:\"ul\"},\"Survive natural hazards, extreme weather, natural disasters.\"),mdx(\"li\",{parentName:\"ul\"},\"Explore/scout/survey a dangerous place, gather information.\"),mdx(\"li\",{parentName:\"ul\"},\"Overcome security, defenses, traps.  \"),mdx(\"li\",{parentName:\"ul\"},\"Invade or defend a location.\"),mdx(\"li\",{parentName:\"ul\"},\"Prepare and execute an ambush.\"),mdx(\"li\",{parentName:\"ul\"},\"Escape a trap/ambush.\"),mdx(\"li\",{parentName:\"ul\"},\"Gain control over the territory.\"),mdx(\"li\",{parentName:\"ul\"},\"Track something/someone.\"),mdx(\"li\",{parentName:\"ul\"},\"Deal with a natural disaster.\"),mdx(\"li\",{parentName:\"ul\"},\"Clear the location of danger.\"))),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Stealth\")),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"Accomplish any of the other challenges stealthily, without being seen.\"),mdx(\"li\",{parentName:\"ul\"},\"Plan, prepare, and execute a heist.\"),mdx(\"li\",{parentName:\"ul\"},\"Break into or break out of a location.\"),mdx(\"li\",{parentName:\"ul\"},\"Infiltrate and spy, go undercover, impersonate someone.\"),mdx(\"li\",{parentName:\"ul\"},\"Steal an item/information.\"),mdx(\"li\",{parentName:\"ul\"},\"Smuggle or plant an item, information, rumor.\"),mdx(\"li\",{parentName:\"ul\"},\"Hide, cover your tracks, lay low.\"),mdx(\"li\",{parentName:\"ul\"},\"Sneak through undetected.\"),mdx(\"li\",{parentName:\"ul\"},\"Deal with unwanted attention.\"),mdx(\"li\",{parentName:\"ul\"},\"Get caught lying/cheating/sneaking.\"),mdx(\"li\",{parentName:\"ul\"},\"Frame someone for a crime.\"))),mdx(\"p\",null,\"Like in a good spy movie, you want to combine those different challenge types in interesting ways:\"),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},\"An exciting chase scene ends at a old mansion and turns into an undercover mission with a bit of social intrigue, which then turns into a tense stealth mission with sneaking through corridors, evading the guards, exploring the secret rooms, to eventually reach a well-protected vault surrounded by a bunch of traps and perform the ultimate heist. After the heist the players may get caught and have to fight or talk their way out.\")),mdx(\"h3\",e({},{id:\"villains-moves\"}),mdx(\"a\",e({parentName:\"h3\"},{className:\"header-link\",href:\"#villains-moves\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Villain's Moves\"),mdx(\"p\",null,\"In the last lesson we have learned that Villain's actions can serve as plot twists and complications, but they can also serve as regular challenges. Anything the Villain can do to make life more difficult for the heroes is a challenge they must overcome.\"),mdx(\"p\",null,\"(see the list of Villain's moves in the Main Characters lesson).\"),mdx(\"p\",null,\"You can use Villain's actions as yet another challenge type to design into your adventure, or just improvise them during the game.\"),mdx(\"h2\",e({},{id:\"pacing-and-rising-action\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#pacing-and-rising-action\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Pacing and Rising Action\"),mdx(\"p\",null,\"Think of your adventure as a roller coaster - you want to have periods of rising tension, excited anticipation, intense action, and calm periods allowing the players to catch their breath in-between (calm periods of non-dramatic storytelling between the action are important, don't skip them!).\"),mdx(\"p\",null,\"Organize your challenges such that the level of threat, difficulty, stakes, and pace keep increasing throughout the adventure and reach their peak at the final climactic challenge.\"),mdx(\"p\",null,\"That will create the most engaging and memorable experience for your players.\"),mdx(\"hr\",null),mdx(\"h2\",e({},{id:\"activity\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#activity\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Activity\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Make a list of 3-5 escalating challenges, the obstacles the players will need to overcome on their path. Try to use challenges of different types.\"),mdx(\"li\",{parentName:\"ul\"},\"Make a list of things the Villain can do to make life more difficult for the heroes.\"),mdx(\"li\",{parentName:\"ul\"},\"Share your ideas in the \",mdx(\"inlineCode\",{parentName:\"li\"},\"#designing-encounters\"),\" channel.\")))}MDXContent.isMDXComponent=!0;\n","scope":{}},"prev":{"title":"Key Plot Points","url":"/adventure-brainstorming/key-plot-points"},"next":{"title":"Intriguing Mysteries","url":"/adventure-brainstorming/intriguing-mysteries"}},"intriguing-mysteries":{"title":"Intriguing Mysteries","slug":"intriguing-mysteries","description":"","thumbnail":null,"preview":false,"draft":false,"url":"/adventure-brainstorming/intriguing-mysteries","compiledMdx":{"compiledSource":"var u=Object.defineProperty,p=Object.defineProperties;var m=Object.getOwnPropertyDescriptors;var n=Object.getOwnPropertySymbols;var s=Object.prototype.hasOwnProperty,r=Object.prototype.propertyIsEnumerable;var l=(e,t,a)=>t in e?u(e,t,{enumerable:!0,configurable:!0,writable:!0,value:a}):e[t]=a,i=(e,t)=>{for(var a in t||(t={}))s.call(t,a)&&l(e,a,t[a]);if(n)for(var a of n(t))r.call(t,a)&&l(e,a,t[a]);return e},h=(e,t)=>p(e,m(t));var y=typeof require!=\"undefined\"?require:e=>{throw new Error('Dynamic require of \"'+e+'\" is not supported')};var c=(e,t)=>{var a={};for(var o in e)s.call(e,o)&&t.indexOf(o)<0&&(a[o]=e[o]);if(e!=null&&n)for(var o of n(e))t.indexOf(o)<0&&r.call(e,o)&&(a[o]=e[o]);return a};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(a){var o=a,{components:e}=o,t=c(o,[\"components\"]);return mdx(MDXLayout,h(i(i({},layoutProps),t),{components:e,mdxType:\"MDXLayout\"}),mdx(\"h1\",i({},{id:\"intriguing-mysteries\"}),mdx(\"a\",i({parentName:\"h1\"},{className:\"header-link\",href:\"#intriguing-mysteries\"}),mdx(\"span\",i({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Intriguing Mysteries\"),mdx(\"p\",null,\"A good mystery can make any adventure more fun, engaging, and serve as extra motivation for the players. A mystery will create curiosity that drives the players forward, and help you to reveal information about the story in a more exciting way - as opposed to you boring the players with the exposition, they will be actively seeking the information about the story.\"),mdx(\"p\",null,\"Unlike intricate murder mysteries, simple mysteries are relatively easy to do, so there's no reason not to add a mystery element to all of your adventures.\"),mdx(\"p\",null,\"The trick to creating a mystery is to \",mdx(\"strong\",{parentName:\"p\"},\"hide the key information about the story\"),\", instead of just offering it to the players on a silver platter. Instead of just using an NPCs to explain to players everything they need to know at the beginning of the adventure, you can make them wonder about what's going on, search for clues, work to reveal the truth, make guesses and try to solve the mystery on their own.\"),mdx(\"p\",null,\"Instead of making the answers obvious - \",mdx(\"strong\",{parentName:\"p\"},\"reveal information through clues, use these clues to lead the players through the story.\"),\" Use clues and information as a reward for completing the challenges. Make players work to discover the clues, and reward them by revealing more about the story.\"),mdx(\"p\",null,\"Picture your scenes as rooms in a dungeon, and clues as keys opening the doors to different rooms. Players enter the scene, complete the challenge in front of them, get a clue as a reward. Clues unlock new scenes, encounters, interactions, enable the players to progress through the story.\"),mdx(\"p\",null,\"To reach the final scene (climax), the players may need to collect enough relevant clues to point them in the direction of that scene (finding the secret cultist's lair, figuring out who's behind the disappearances to confront them, learning about the true cause of the drought, finding the key piece of information that makes their Objective achievable).\"),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Examples of Clues\"),\":\"),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"The secrets some characters know. Players can overhear rumors, interrogate witnesses, intimidate Evil Minions into revealing the information.\"),mdx(\"li\",{parentName:\"ul\"},\"Research. Players can find information in ancient books, mysterious notes, journals, maps.\"),mdx(\"li\",{parentName:\"ul\"},\"Physical clues. Dagger with a unique sigil left at the crime scene, tracks leading into the forest, secret doors.\"),mdx(\"li\",{parentName:\"ul\"},\"Spying. Players can track some of the characters, listen in on conversations, infiltrate private parties, heist their way into well-protected buildings.\"),mdx(\"li\",{parentName:\"ul\"},\"Magic - divination spells, talking to ghosts, magical surveillance, mind reading.\"))),mdx(\"p\",null,\"To make sure that the players will be able to make progress through your adventure - make multiple clues for each important conclusion you need the players to arrive at. A good rule of thumb is to give players 3 possible ways to find out any key bit of information that is required to advance through the story.\"),mdx(\"p\",null,\"Ask yourself:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"What interesting information about this story can I hide instead of revealing it right away?\"),mdx(\"li\",{parentName:\"ul\"},\"What key pieces of information do the players need to know to be able to make progress towards their goal, figure out what's going on, and complete their quest?\"),mdx(\"li\",{parentName:\"ul\"},\"What are some ways the players could find out about this information?\"),mdx(\"li\",{parentName:\"ul\"},\"How can the players obtain these clues?\"),mdx(\"li\",{parentName:\"ul\"},\"To what scenes does the clue lead, which locations, encounters, or conversations does it unlock? \"),mdx(\"li\",{parentName:\"ul\"},\"What actions does the clue encourage players to take?\")),mdx(\"p\",null,\"Use the clues to connect the scenes together, direct the players from one scene to the next.\"),mdx(\"h2\",i({},{id:\"flexible-clues\"}),mdx(\"a\",i({parentName:\"h2\"},{className:\"header-link\",href:\"#flexible-clues\"}),mdx(\"span\",i({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Flexible Clues\"),mdx(\"p\",null,\"You don't always have to design the specific clues and put them into specific locations, especially if you're writing the adventure for yourself instead of publishing.\"),mdx(\"p\",null,\"You can just decide which bits of information about the story you want to hide, and then improvise ways to reveal this information during the game. \"),mdx(\"p\",null,`Since it is difficult to predict how the players will investigate the mystery, and it's hard to design 3 clues for each conclusion, you can \"fake\" it by placing the clues in places the players happen to investigate.`),mdx(\"blockquote\",null,mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"If the players choose to look through the crime scene, maybe they'll find a mysterious note. \"),mdx(\"li\",{parentName:\"ul\"},\"If they choose to interrogate witnesses, maybe a little kid playing nearby has noticed something strange.\"),mdx(\"li\",{parentName:\"ul\"},\"If they choose to use magic, frame the answer as the result of whatever spell they've decided to use.\"))),mdx(\"p\",null,\"This makes the mystery writing even simpler and more flexible.\"),mdx(\"h2\",i({},{id:\"keep-it-simple\"}),mdx(\"a\",i({parentName:\"h2\"},{className:\"header-link\",href:\"#keep-it-simple\"}),mdx(\"span\",i({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Keep it Simple\"),mdx(\"p\",null,\"Unless you're writing an adventure specifically focused on mystery - don't over do it, keep the clues simple. \"),mdx(\"p\",null,\"Writing mysteries and inventing all the clues can quickly get very intricate and difficult to write. But you only need a few interesting questions and a few clues to create the sense of curiosity and wonder in your players.\"),mdx(\"p\",null,\"Focus on the low-hanging fruit, adding a few small mystery elements to your story is an easy way to make it much better.\"),mdx(\"hr\",null),mdx(\"h2\",i({},{id:\"activity\"}),mdx(\"a\",i({parentName:\"h2\"},{className:\"header-link\",href:\"#activity\"}),mdx(\"span\",i({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Activity\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"List the key pieces of information you will hide from the players initially, to create a surprising reveal later on.\"),mdx(\"li\",{parentName:\"ul\"},\"For each reveal, list 1-3 clues that will convey this information to the players. How will the players obtain these clues?\"),mdx(\"li\",{parentName:\"ul\"},\"Describe how each clue can lead to future scenes, help players make progress through the story. What fun and exciting information will the clue tell players about the story?\")))}MDXContent.isMDXComponent=!0;\n","scope":{}},"prev":{"title":"Escalating Challenges","url":"/adventure-brainstorming/escalating-challenges"},"next":{"title":"Outline and Summary","url":"/adventure-writing/outline-and-summary"}}}},"adventure-writing":{"title":"Adventure Writing","slug":"adventure-writing","chapters":{"outline-and-summary":{"title":"Outline and Summary","slug":"outline-and-summary","description":"","thumbnail":null,"preview":true,"draft":false,"url":"/adventure-writing/outline-and-summary","compiledMdx":{"compiledSource":"var p=Object.defineProperty,m=Object.defineProperties;var c=Object.getOwnPropertyDescriptors;var i=Object.getOwnPropertySymbols;var r=Object.prototype.hasOwnProperty,l=Object.prototype.propertyIsEnumerable;var s=(t,a,o)=>a in t?p(t,a,{enumerable:!0,configurable:!0,writable:!0,value:o}):t[a]=o,e=(t,a)=>{for(var o in a||(a={}))r.call(a,o)&&s(t,o,a[o]);if(i)for(var o of i(a))l.call(a,o)&&s(t,o,a[o]);return t},h=(t,a)=>m(t,c(a));var d=typeof require!=\"undefined\"?require:t=>{throw new Error('Dynamic require of \"'+t+'\" is not supported')};var u=(t,a)=>{var o={};for(var n in t)r.call(t,n)&&a.indexOf(n)<0&&(o[n]=t[n]);if(t!=null&&i)for(var n of i(t))a.indexOf(n)<0&&l.call(t,n)&&(o[n]=t[n]);return o};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(o){var n=o,{components:t}=n,a=u(n,[\"components\"]);return mdx(MDXLayout,h(e(e({},layoutProps),a),{components:t,mdxType:\"MDXLayout\"}),mdx(\"h1\",e({},{id:\"outline-and-summary\"}),mdx(\"a\",e({parentName:\"h1\"},{className:\"header-link\",href:\"#outline-and-summary\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Outline and Summary\"),mdx(\"p\",null,\"Congratulations! You have completed the brainstorming part of your adventure writing process! You have filled in your Brainstorming Template, and now you have all the information you need in order to write the adventure. With all the ideas already in place, it will be surprisingly easy and rewarding.\"),mdx(\"p\",null,\"For the rest of the course you will be using your Adventure Writing Template to outline, draft, and complete your adventure.\"),mdx(\"h2\",e({},{id:\"come-up-with-a-title\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#come-up-with-a-title\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Come up with a Title\"),mdx(\"p\",null,\"It's time to name your adventure. Come up with an exciting title that grabs people's attention and evokes curiosity.\"),mdx(\"p\",null,\"Try to succinctly convey the core premise of your adventure, capture the story essence, entice people to read (or play) your adventure using as few words as possible.\"),mdx(\"p\",null,\"Alliteration, silly puns, and pop culture references also work great.\"),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},\"Some examples from the \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://rpgadventures.io/\"}),\"adventures\"),\" we've made before:\"),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"Do or Dry (an adventure about animals dealing with a drought).\"),mdx(\"li\",{parentName:\"ul\"},\"Saving Private Mittens (an adventure about players trying to protect a runaway alien pet).\"),mdx(\"li\",{parentName:\"ul\"},\"Blood of the Hunter (Die Hard in Hogwarts)\"),mdx(\"li\",{parentName:\"ul\"},\"Golly, gosh, Ghouls! (Emperor has been turned into a Ghoul)\"),mdx(\"li\",{parentName:\"ul\"},\"The Merry Mice of Mordor (Lord of the Rings but players are playing as mice).\"),mdx(\"li\",{parentName:\"ul\"},\"Zeppelin Heist (Train heist on a Zeppelin)\"),mdx(\"li\",{parentName:\"ul\"},\"Damsels and Dragons (Rescue a Dragon from a Princess)\"))),mdx(\"h2\",e({},{id:\"summarize-the-whole-story\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#summarize-the-whole-story\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Summarize the Whole Story\"),mdx(\"p\",null,\"At the beginning of your template, write down a very short (3-5 sentences) summary of your adventure. \"),mdx(\"p\",null,\"Try to use these couple of sentences to convey as much of the story and plot as possible. Mention all the most important components of your idea:\"),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Summary\")),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"What is the main idea for this adventure, exciting premise for this story?\"),mdx(\"li\",{parentName:\"ul\"},\"What Objective will the players strive to achieve?\"),mdx(\"li\",{parentName:\"ul\"},\"Why is it important, what's at stake? What makes it difficult to accomplish?\"),mdx(\"li\",{parentName:\"ul\"},\"What challenges will they face, what will they need to do to overcome them?\"),mdx(\"li\",{parentName:\"ul\"},\"What complications will they encounter?\"),mdx(\"li\",{parentName:\"ul\"},\"What will the climax be, the \\u201Cfinal battle\\u201D that resolves the problem/goal?\"))),mdx(\"p\",null,\"The goal is to get the birds-eye view of the story, it will get you a good idea about whether the plot makes sense and whether the adventure sounds fun to play.\"),mdx(\"p\",null,\"A good summary is also extremely useful for other reasons:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"When inviting players to your game, this is the description you will use (minus the spoilers) to make them curious to join.\"),mdx(\"li\",{parentName:\"ul\"},\"When you share your adventure with other people, this is the paragraph you will use to get them excited about the adventure and convince them to continue to read it.\"),mdx(\"li\",{parentName:\"ul\"},\"When the GM is reading your adventure, it will be a great way for them to learn what's going on in the story without spending too much time reading the whole adventure.\")),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},\"Examples:\"),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Damsels and Dragons\"),mdx(\"br\",{parentName:\"li\"}),\"The players meet a child dragon, he's crying because an Evil Princess has kidnapped his mom. The players will need to set her free from the Coliseum where she is forced to fight monsters and gladiators for public's entertainment.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Zeppelin Heist\"),mdx(\"br\",{parentName:\"li\"}),\"The players need to rescue a rebellious teenage tiefling who was sentenced to life in prison for a petty crime. She is transported to prison by Zeppelin. Players will need to discover the Zeppelin\\u2019s schedule and route, steal griffons to chase it and board it, liberate Anabelle, escape and cover their tracks.\"))),mdx(\"h2\",e({},{id:\"create-an-outline\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#create-an-outline\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Create an Outline\"),mdx(\"p\",null,\"Now, you need to create an outline of your adventure. This is where you combine all the ideas you have brainstormed, put it all together into a list of scenes that flow into each other, add up to an interesting story that makes sense.\"),mdx(\"p\",null,\"You already know the Key Plot Points of your story and the Challenges the players will face, and now you just need to turn them into a list of scenes.\"),mdx(\"p\",null,mdx(\"strong\",{parentName:\"p\"},\"Typical Adventure Outline\"),\" looks like this:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Introduction\"),mdx(\"br\",{parentName:\"li\"}),\"Exposition, setup. Introduce the heroes and the world around them. Where do the heroes begin the adventure?\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Exciting Adventure Hook\"),mdx(\"br\",{parentName:\"li\"}),\"The first scene that draws heroes into action, and gives them the initial set of tasks to accomplish, leads to follow. \"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"[Escalating Challenges]\"),mdx(\"br\",{parentName:\"li\"}),\"Multiple scenes here, one for each challenge the heroes need to overcome as they strive towards their goal.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Unexpected Complication\"),mdx(\"br\",{parentName:\"li\"}),\"A more difficult challenge. Crisis, major setback, everything goes wrong? Villain makes a move? A surprising twist/reveal changes the direction of the story. Raise the stakes and threat level.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"[More Challenges]\"),mdx(\"br\",{parentName:\"li\"}),\"A few more challenge scenes. Heroes dealing with the consequences of the Complication and overcoming more obstacles on their path to the climax.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Awesome Climax\"),mdx(\"br\",{parentName:\"li\"}),\"Final, most important/dangerous challenge that resolves the main conflict. Epic scene at a cool location.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Resolution\"),mdx(\"br\",{parentName:\"li\"}),\"The aftermath. Possible outcomes/consequences of the adventure. How the secondary plot threads might resolve? How does the world (and heroes\\u2019 lives) change after the climax? \")),mdx(\"p\",null,\"This process is pretty straightforward, outlines tend to be similar between the adventures, and you already know everything you need to know to make it. Just write down the scene headings describing what's going on in your adventure.\"),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},\"Here's how the \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://rpgadventures.io/adventure/wild-rat-chase/\"}),\"Wild Rat Chase\"),\" outline could look like:\"),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"Arriving at the Capital\"),mdx(\"li\",{parentName:\"ul\"},\"Meeting the Rat\"),mdx(\"li\",{parentName:\"ul\"},\"The Rat's Story (Claim to Throne)\"),mdx(\"li\",{parentName:\"ul\"},\"Meeting the Minions\"),mdx(\"li\",{parentName:\"ul\"},\"Escape through the Streets of Cypress\"),mdx(\"li\",{parentName:\"ul\"},\"Kerfuffle at the Town Square\"),mdx(\"li\",{parentName:\"ul\"},\"Sneaking into the Castle\"),mdx(\"li\",{parentName:\"ul\"},\"Breaking into the Vizier's Tower\"),mdx(\"li\",{parentName:\"ul\"},\"First Floor (Rowdy Receptionist)\"),mdx(\"li\",{parentName:\"ul\"},\"Second Floor (Vizier's Office)\"),mdx(\"li\",{parentName:\"ul\"},\"The Fascinating Laboratory\"),mdx(\"li\",{parentName:\"ul\"},\"The Dangerous Observatory\"),mdx(\"li\",{parentName:\"ul\"},\"The Wand Floor\"),mdx(\"li\",{parentName:\"ul\"},\"Final Showdown at the Throne Room\"))),mdx(\"h2\",e({},{id:\"summarize-the-scenes\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#summarize-the-scenes\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Summarize the Scenes\"),mdx(\"p\",null,\"The next step is to create a short summary of the scenes. Under each scene heading, briefly (in 3-5 sentences) describe what happens in the scene. Imagine playing through the adventure as players, imagine running the story as the GM, write down things you wish to remember about the story.\"),mdx(\"p\",null,\"For every scene, you want to make sure to mention 4 things:\"),mdx(\"blockquote\",null,mdx(\"p\",{parentName:\"blockquote\"},mdx(\"strong\",{parentName:\"p\"},\"Scene Template\")),mdx(\"ul\",{parentName:\"blockquote\"},mdx(\"li\",{parentName:\"ul\"},\"Location - where does the scene take place? \"),mdx(\"li\",{parentName:\"ul\"},\"Characters - who will the heroes encounter there?\"),mdx(\"li\",{parentName:\"ul\"},\"Challenges - what challenge will they need to overcome?\"),mdx(\"li\",{parentName:\"ul\"},\"Clues - What important information will the players learn about the story? How does it lead them to the next scene?\"))),mdx(\"p\",null,\"Most of the time you will have one scene per challenge, and each scene will take place in its own location.\"),mdx(\"p\",null,\"Just like with the outline, this step tends to be pretty easy, because you already know almost everything that happens. It doesn't demand a lot of creativity - just summarize your ideas, tell yourself a story, and make sure it makes sense.\"),mdx(\"p\",null,\"Don't try to be too artistic at this step of the process, we will write good descriptions later on. Now your goal is to just convey the information - you want your scene summaries to contain everything you know about the story.\"),mdx(\"h2\",e({},{id:\"list-the-open-questions\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#list-the-open-questions\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"List the Open Questions\"),mdx(\"p\",null,\"The process of outlining and summarizing the story almost always reveals a number of open questions - plot holes, inconsistencies, things you haven't thought about during the brainstorming phase, missing information, things left to figure out about the story.\"),mdx(\"p\",null,\"That is perfectly normal and expected. Add the open questions you encounter to the list of Questions and Answers in your Brainstorming Template, add the things you'd like to improve to the ToDo list.\"),mdx(\"p\",null,\"You can also just use placeholders. If you don't know the character's name, just write \",mdx(\"inlineCode\",{parentName:\"p\"},\"[Orc Warrior's Name]\"),\", if you don't know some details about the challenge the players are facing write \",mdx(\"inlineCode\",{parentName:\"p\"},\"[Exciting Chase Scene]\"),\".\"),mdx(\"p\",null,\"When you encounter something you don't know - don't stop to figure it out. Write down the open question or use a placeholder, and continue outlining and summarizing, write down all the things you \",mdx(\"strong\",{parentName:\"p\"},\"do\"),\" know about the story.\"),mdx(\"p\",null,\"The goal is to quickly go through the outlining/summarizing process and quickly get an overview of the story, without ever getting stuck at a question you don't yet know how to answer.\"),mdx(\"p\",null,mdx(\"strong\",{parentName:\"p\"},\"At the end of this process, you want to have a clear summary of everything you know about the story, and a list of specific questions that you still need to figure out.\")),mdx(\"hr\",null),mdx(\"h2\",e({},{id:\"activity\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#activity\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Activity\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Come up with a title.\"),mdx(\"li\",{parentName:\"ul\"},\"Write down a 3-5 sentence summary of your story.\"),mdx(\"li\",{parentName:\"ul\"},\"Write down the list of scene headings, one for each plot point and challenge.\"),mdx(\"li\",{parentName:\"ul\"},\"Write down a 3-5 sentence summary of each scene. Where does the scene take place, who will the players encounter there, what challenges will they need to overcome?\"),mdx(\"li\",{parentName:\"ul\"},\"Write down the list of open questions you still need to figure out how to answer.\")))}MDXContent.isMDXComponent=!0;\n","scope":{"preview":true}},"prev":{"title":"Intriguing Mysteries","url":"/adventure-brainstorming/intriguing-mysteries"},"next":{"title":"Answering Open Questions","url":"/adventure-writing/answering-open-questions"}},"answering-open-questions":{"title":"Answering Open Questions","slug":"answering-open-questions","description":"","thumbnail":null,"preview":false,"draft":false,"url":"/adventure-writing/answering-open-questions","compiledMdx":{"compiledSource":"var h=Object.defineProperty,d=Object.defineProperties;var m=Object.getOwnPropertyDescriptors;var n=Object.getOwnPropertySymbols;var s=Object.prototype.hasOwnProperty,r=Object.prototype.propertyIsEnumerable;var l=(e,a,o)=>a in e?h(e,a,{enumerable:!0,configurable:!0,writable:!0,value:o}):e[a]=o,t=(e,a)=>{for(var o in a||(a={}))s.call(a,o)&&l(e,o,a[o]);if(n)for(var o of n(a))r.call(a,o)&&l(e,o,a[o]);return e},p=(e,a)=>d(e,m(a));var y=typeof require!=\"undefined\"?require:e=>{throw new Error('Dynamic require of \"'+e+'\" is not supported')};var u=(e,a)=>{var o={};for(var i in e)s.call(e,i)&&a.indexOf(i)<0&&(o[i]=e[i]);if(e!=null&&n)for(var i of n(e))a.indexOf(i)<0&&r.call(e,i)&&(o[i]=e[i]);return o};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(o){var i=o,{components:e}=i,a=u(i,[\"components\"]);return mdx(MDXLayout,p(t(t({},layoutProps),a),{components:e,mdxType:\"MDXLayout\"}),mdx(\"h1\",t({},{id:\"answering-open-questions\"}),mdx(\"a\",t({parentName:\"h1\"},{className:\"header-link\",href:\"#answering-open-questions\"}),mdx(\"span\",t({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Answering Open Questions\"),mdx(\"p\",null,\"Now you have a clear summary of everything you know about the story, and a list of specific questions that you still need to figure out.\"),mdx(\"p\",null,\"What you need to do next is go through the questions one by one, and try to figure out the answers. This process mostly involves just thinking, brainstorming and listing possible alternatives, and trying to make the story make sense.\"),mdx(\"p\",null,\"If you find yourself struggling to come up with a name for a character or a place, use one of the name generation websites like \",mdx(\"a\",t({parentName:\"p\"},{href:\"https://www.fantasynamegenerators.com/dnd-human-names.php\"}),\"this one\"),'. You can also use pop culture references, puns, and descriptive titles (\"Gregor the Dread\", \"Emperor Barkus Aurelius\", \"Clearwater Village\", \"John Silver\", \"Elon Tusk\").'),mdx(\"p\",null,\"If you're struggling to come up with more creative ideas or fill in the plot holes - use the creative strategies outlined in the course. Use your knowledge of movies/books/games/etc, take ideas from your favorite stories for inspiration, make lists of possible alternatives. Then pick your favorite answer. Try to reverse/exaggerate your ideas, try to make unusual metaphors and associations. Browse inspiring images and Wikipedia articles.\"),mdx(\"p\",null,\"If you're struggling to find an answer to a question - try to make your question as specific as possible. The more precise you get, the more clearly you define and describe your problem, the easier it will be to figure out the answer. Before looking for the answer, try to describe and discuss the problem from all angles, list all the things relevant to the question that you already know.\"),mdx(\"p\",null,\"Don't criticize your answers. Your first goal is to find \",mdx(\"em\",{parentName:\"p\"},\"any\"),\" acceptable answer that makes any sense at all, you can improve upon it later.\"),mdx(\"p\",null,\"Above all - keep things simple and be obvious. At this point you have already created an interesting story with a lot of fun and creative ideas, you don't need all your answers to be mind-blowing. If you can think of the most straightforward, predictable, obvious answer - just use it, it will work perfectly fine.\"),mdx(\"h2\",t({},{id:\"request-community-help\"}),mdx(\"a\",t({parentName:\"h2\"},{className:\"header-link\",href:\"#request-community-help\"}),mdx(\"span\",t({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Request Community Help\"),mdx(\"p\",null,\"Usually by this point I have managed to figure out the answers to most of the questions, but I'm still having trouble with some of the remaining ones.\"),mdx(\"p\",null,\"Now, the best strategy to use is to talk to other people, more often than not they will help you to find the answers and give you a lot of ideas you didn't think of.\"),mdx(\"p\",null,\"If you have a friend with similar interests - talking to them is a good place to start. If that still doesn't help - it's time to make a post in our \",mdx(\"inlineCode\",{parentName:\"p\"},\"#writing-help-and-feedback\"),\" channel, and tap into the power of Reddit's hivemind - make posts in \",mdx(\"a\",t({parentName:\"p\"},{href:\"https://www.reddit.com/r/dmacademy\"}),\"/r/DMAcademy\"),\" and \",mdx(\"a\",t({parentName:\"p\"},{href:\"https://www.reddit.com/r/DndAdventureWriter\"}),\"/r/DndAdventureWriter\"),\" and ask people to help.\"),mdx(\"p\",null,\"When making a post:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Do your best to define your question as clearly and precisely as possible.\"),mdx(\"li\",{parentName:\"ul\"},\"Explain what you have figured out so far, list the things you have tried, explain why it didn't work.\"),mdx(\"li\",{parentName:\"ul\"},\"Give people a short summary of your adventure, explain everything you do know about the story.\"),mdx(\"li\",{parentName:\"ul\"},\"Keep your post concise, make it as easy as possible for them to give you the answer.\")),mdx(\"p\",null,\"Following these guidelines will greatly increase your chances of receiving useful feedback.\"),mdx(\"h2\",t({},{id:\"omit-and-simplify\"}),mdx(\"a\",t({parentName:\"h2\"},{className:\"header-link\",href:\"#omit-and-simplify\"}),mdx(\"span\",t({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Omit and Simplify\"),mdx(\"p\",null,\"After requesting help on Discord and Reddit and following this advice, you're very likely to have most of your problems resolved.\"),mdx(\"p\",null,\"If that still hasn't happened - just omit whatever parts of the story are causing you trouble, and go with the simpler version. It's likely that some of your ideas will come up during the playtest and will be solved with the help of the players. \"),mdx(\"p\",null,\"You can also always go back to your adventure when you have more experience, and see if you can find an answer then.\"),mdx(\"hr\",null),mdx(\"h2\",t({},{id:\"action-steps\"}),mdx(\"a\",t({parentName:\"h2\"},{className:\"header-link\",href:\"#action-steps\"}),mdx(\"span\",t({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Action Steps\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Do your best to answer all of the open questions you have about the story so far.\"),mdx(\"li\",{parentName:\"ul\"},\"Make the posts in the Discord and Reddit communities to help you brainstorm more ideas and figure out the remaining answers.\")))}MDXContent.isMDXComponent=!0;\n","scope":{}},"prev":{"title":"Outline and Summary","url":"/adventure-writing/outline-and-summary"},"next":{"title":"Writing Descriptions","url":"/adventure-writing/writing-descriptions"}},"writing-descriptions":{"title":"Writing Descriptions","slug":"writing-descriptions","description":"","thumbnail":null,"preview":false,"draft":false,"url":"/adventure-writing/writing-descriptions","compiledMdx":{"compiledSource":"var p=Object.defineProperty,d=Object.defineProperties;var m=Object.getOwnPropertyDescriptors;var r=Object.getOwnPropertySymbols;var o=Object.prototype.hasOwnProperty,s=Object.prototype.propertyIsEnumerable;var h=(t,a,n)=>a in t?p(t,a,{enumerable:!0,configurable:!0,writable:!0,value:n}):t[a]=n,e=(t,a)=>{for(var n in a||(a={}))o.call(a,n)&&h(t,n,a[n]);if(r)for(var n of r(a))s.call(a,n)&&h(t,n,a[n]);return t},c=(t,a)=>d(t,m(a));var u=typeof require!=\"undefined\"?require:t=>{throw new Error('Dynamic require of \"'+t+'\" is not supported')};var l=(t,a)=>{var n={};for(var i in t)o.call(t,i)&&a.indexOf(i)<0&&(n[i]=t[i]);if(t!=null&&r)for(var i of r(t))a.indexOf(i)<0&&s.call(t,i)&&(n[i]=t[i]);return n};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(n){var i=n,{components:t}=i,a=l(i,[\"components\"]);return mdx(MDXLayout,c(e(e({},layoutProps),a),{components:t,mdxType:\"MDXLayout\"}),mdx(\"h1\",e({},{id:\"writing-descriptions\"}),mdx(\"a\",e({parentName:\"h1\"},{className:\"header-link\",href:\"#writing-descriptions\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Writing Descriptions\"),mdx(\"p\",null,\"Now that you have a solid summary and know exactly what happens in the story, it's time to create interesting and vivid descriptions that will make the players feel immersed in your story.\"),mdx(\"h3\",e({},{id:\"brevity\"}),mdx(\"a\",e({parentName:\"h3\"},{className:\"header-link\",href:\"#brevity\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Brevity\"),mdx(\"p\",null,\"Keep the descriptions concise and simple. Long-winded descriptions will slow down the game, they're not very engaging, can't be interacted with, and difficult for the GM to memorize. Reading from the notes the descriptions of everything the players can see would be tedious, so most of the time descriptions will be improvised by the GM. \"),mdx(\"p\",null,\"Our goal is to paint a vivid picture in the GMs mind, so that when they're running the game for the players they could describe most things using their memory and improvisation skills. \"),mdx(\"p\",null,\"Don't wax poetic. It's better to point out a few remarkable details that stand out the most than to write a flowery wall of text.\"),mdx(\"p\",null,\"Write as you speak. Picture yourself running the game for your friends, what would you say, how would you describe things?\"),mdx(\"h3\",e({},{id:\"focus-on-what-matters\"}),mdx(\"a\",e({parentName:\"h3\"},{className:\"header-link\",href:\"#focus-on-what-matters\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Focus on what matters\"),mdx(\"p\",null,\"Use the text-box descriptions sparingly. Write them only for the most important scenes and characters. I recommend to prioritize the introduction the GM can read at the beginning of the adventure, the description of your antagonist, and the description of the set piece for the climax (but even these are optional).\"),mdx(\"h3\",e({},{id:\"world-seen-through-the-heros-eyes\"}),mdx(\"a\",e({parentName:\"h3\"},{className:\"header-link\",href:\"#world-seen-through-the-heros-eyes\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"World seen through the Hero's eyes\"),mdx(\"p\",null,\"Describe things from the perspective of the players, imagine a camera looking through their eyes. Show don't tell. \"),mdx(\"p\",null,\"Try to get a detailed picture of the world around the players in your own imagination, and practice relaying what you see. It's also a great way to get better at describing things on the fly - describe what you see in your mind's eye in response to players' actions.\"),mdx(\"p\",null,\"Focus on things the players would pay the most attention to - don't describe the intricate mosaic on the walls when there's a gigantic poison-dripping spider monster in the middle of the room.\"),mdx(\"p\",null,\"Describe the world through the lense of the player character you're talking to - a horny barbarian, a paranoid thief, and a germaphobe wizard will notice different things when they walk into the bar.\"),mdx(\"p\",null,\"If you don't know who the player characters will be when you write your adventure - that's okay, the rest of the advice still applies.\"),mdx(\"h3\",e({},{id:\"be-specific\"}),mdx(\"a\",e({parentName:\"h3\"},{className:\"header-link\",href:\"#be-specific\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Be specific\"),mdx(\"p\",null,\"The most useful description writing tip I have learned is that you don't have to describe the laundry list of everything around the players, you just need a couple of extremely specific concrete details that will make the players feel immersed and evoke the experience you want.\"),mdx(\"p\",null,\"On the spectrum between abstract and concrete, strive to make your language more concrete (while keeping it brief), it makes descriptions more vivid. \"),mdx(\"h3\",e({},{id:\"invoke-all-senses\"}),mdx(\"a\",e({parentName:\"h3\"},{className:\"header-link\",href:\"#invoke-all-senses\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Invoke all senses\"),mdx(\"p\",null,\"A great way to make your descriptions more concrete is to include the details from all the senses, or focus on a single sense (not necessarily the vision). What do the players hear, see, and smell?\"),mdx(\"h3\",e({},{id:\"manage-the-learning-curve\"}),mdx(\"a\",e({parentName:\"h3\"},{className:\"header-link\",href:\"#manage-the-learning-curve\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Manage the Learning Curve\"),mdx(\"p\",null,\"Don't throw a bunch of information (exposition, names, locations, concepts, etc.) at your readers/players at the same time - people will get bored, distracted, and start forgetting things. Reveal information in bits and pieces, as they become relevant.\"),mdx(\"h3\",e({},{id:\"learn-from-your-favorite-authors\"}),mdx(\"a\",e({parentName:\"h3\"},{className:\"header-link\",href:\"#learn-from-your-favorite-authors\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Learn from your favorite authors\"),mdx(\"p\",null,\"Read and watch DnD shows. Pay attention to how your favorite authors and GMs describe things. Watch \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.youtube.com/channel/UCC8zWIx8aBQme-x1nX9iZ0A\"}),\"Dimension 20\"),\" and \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.youtube.com/c/criticalrole\"}),\"Critical Role\"),\", and try to emulate how Brennan and Matt describe their scenes.\"),mdx(\"h3\",e({},{id:\"describing-characters\"}),mdx(\"a\",e({parentName:\"h3\"},{className:\"header-link\",href:\"#describing-characters\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Describing characters\"),mdx(\"p\",null,\"In addition to all of the tips above, you want to describe more than just the character's physical appearance. Describe their mannerisms, behaviors, expressions and emotions.\"),mdx(\"p\",null,\"Does the character seem energetic or exhausted? Do they have an air of satisfaction in their work or are they just trying to get through the day? Are they looking at you kindly, menacingly, resentfully?\"),mdx(\"p\",null,\"Describe how their speech sounds like, the tone and aspects (pitch, volume, etc.) of their voice.\"),mdx(\"hr\",null),mdx(\"h2\",e({},{id:\"activity\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#activity\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Activity\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Write the boxed-text descriptions for the most interesting and important scenes.\"),mdx(\"li\",{parentName:\"ul\"},\"Write brief descriptions of the most important characters (starting with the antagonist).\"),mdx(\"li\",{parentName:\"ul\"},\"Write the dialogue boxes for the most dramatic and important conversations.\"),mdx(\"li\",{parentName:\"ul\"},\"Share the link to your draft in  \",mdx(\"inlineCode\",{parentName:\"li\"},\"#descriptions-and-dialogue\"),\" channel.\")))}MDXContent.isMDXComponent=!0;\n","scope":{}},"prev":{"title":"Answering Open Questions","url":"/adventure-writing/answering-open-questions"},"next":{"title":"Community Feedback","url":"/adventure-writing/community-feedback"}},"community-feedback":{"title":"Community Feedback","slug":"community-feedback","description":"","thumbnail":null,"preview":false,"draft":false,"url":"/adventure-writing/community-feedback","compiledMdx":{"compiledSource":"var l=Object.defineProperty,m=Object.defineProperties;var h=Object.getOwnPropertyDescriptors;var o=Object.getOwnPropertySymbols;var i=Object.prototype.hasOwnProperty,r=Object.prototype.propertyIsEnumerable;var p=(a,n,t)=>n in a?l(a,n,{enumerable:!0,configurable:!0,writable:!0,value:t}):a[n]=t,e=(a,n)=>{for(var t in n||(n={}))i.call(n,t)&&p(a,t,n[t]);if(o)for(var t of o(n))r.call(n,t)&&p(a,t,n[t]);return a},c=(a,n)=>m(a,h(n));var u=typeof require!=\"undefined\"?require:a=>{throw new Error('Dynamic require of \"'+a+'\" is not supported')};var d=(a,n)=>{var t={};for(var s in a)i.call(a,s)&&n.indexOf(s)<0&&(t[s]=a[s]);if(a!=null&&o)for(var s of o(a))n.indexOf(s)<0&&r.call(a,s)&&(t[s]=a[s]);return t};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(t){var s=t,{components:a}=s,n=d(s,[\"components\"]);return mdx(MDXLayout,c(e(e({},layoutProps),n),{components:a,mdxType:\"MDXLayout\"}),mdx(\"h1\",e({},{id:\"community-feedback\"}),mdx(\"a\",e({parentName:\"h1\"},{className:\"header-link\",href:\"#community-feedback\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Community Feedback\"),mdx(\"p\",null,\"Now you basically have a solid draft of your adventure, and all that's left is to try to polish it, make minor improvements, make it the best it can be.\"),mdx(\"h2\",e({},{id:\"request-feedback\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#request-feedback\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Request Feedback\"),mdx(\"p\",null,\"The first step is to go to the communities once again, and ask for their thoughts, constructive criticism, feedback, and help with coming up with more ideas and improvements.\"),mdx(\"p\",null,\"Use the Reddit's hivemind. If you get stuck - make a post on \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://old.reddit.com/r/DMAcademy\"}),\"/r/DMAcademy\"),\", \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://old.reddit.com/r/DnDAdventureWriter\"}),\"/r/DnDAdventureWriter\"),\", and our \",mdx(\"inlineCode\",{parentName:\"p\"},\"#writing-help-and-feedback\"),\" channel, and ask people for help.\"),mdx(\"p\",null,\"Here's a post template you can use to increase your chances of receiving quality feedback:\"),mdx(\"pre\",null,mdx(\"code\",e({parentName:\"pre\"},{className:\"code-highlight\"}),mdx(\"span\",e({parentName:\"code\"},{className:\"code-line\"}),`Title: I'm working on an adventure about <one-sentence pitch for your adventure>. I could really use some feedback and some help with brainstorming ideas.\n`),mdx(\"span\",e({parentName:\"code\"},{className:\"code-line\"}),`\n`),mdx(\"span\",e({parentName:\"code\"},{className:\"code-line\"}),`**Summary:** \n`),mdx(\"span\",e({parentName:\"code\"},{className:\"code-line\"}),`<A short 2-4 sentence summary of the whole adventure. The problem players will try to solve or goal they'll try to achieve, what makes it difficult.>\n`),mdx(\"span\",e({parentName:\"code\"},{className:\"code-line\"}),`\n`),mdx(\"span\",e({parentName:\"code\"},{className:\"code-line\"}),`You can see the current draft of the adventure here:\n`),mdx(\"span\",e({parentName:\"code\"},{className:\"code-line\"}),`<link to the adventure>\n`),mdx(\"span\",e({parentName:\"code\"},{className:\"code-line\"}),`\n`),mdx(\"span\",e({parentName:\"code\"},{className:\"code-line\"}),`**Outline:** \n`),mdx(\"span\",e({parentName:\"code\"},{className:\"code-line\"}),`<Brief descriptions of the main scenes. Key plot points, challenges you'd like your players to face.> \n`),mdx(\"span\",e({parentName:\"code\"},{className:\"code-line\"}),`\n`),mdx(\"span\",e({parentName:\"code\"},{className:\"code-line\"}),`**Key Characters:** \n`),mdx(\"span\",e({parentName:\"code\"},{className:\"code-line\"}),`<Brief one-sentence descriptions of the Main Antagonist, Quest Giver, and other important NPCs.>\n`),mdx(\"span\",e({parentName:\"code\"},{className:\"code-line\"}),`\n`),mdx(\"span\",e({parentName:\"code\"},{className:\"code-line\"}),`**Key Locations:**\n`),mdx(\"span\",e({parentName:\"code\"},{className:\"code-line\"}),`<Brief descriptions of the most important locations the players will visit.>\n`),mdx(\"span\",e({parentName:\"code\"},{className:\"code-line\"}),`\n`),mdx(\"span\",e({parentName:\"code\"},{className:\"code-line\"}),`**Specific Questions:**\n`),mdx(\"span\",e({parentName:\"code\"},{className:\"code-line\"}),`<A list of specific questions you'd like some help with. What's confusing you, where do you feel stuck, what kind of feedback are you looking for?>\n`))),mdx(\"p\",null,\"Here's a few examples of my old posts: \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://old.reddit.com/r/DndAdventureWriter/comments/i145kt/zeppelin_heist_players_need_to_rescue_a_rebel/\"}),\"1\"),\", \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://old.reddit.com/r/DndAdventureWriter/comments/nefh7s/onepage_adventure_about_prehistoric_tribes/\"}),\"2\"),\", \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://old.reddit.com/r/DndAdventureWriter/comments/nuoil8/im_working_on_a_onepage_adventure_about/\"}),\"3\"),\", \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://old.reddit.com/r/DndAdventureWriter/comments/hhyy75/can_you_help_me_design_a_oneshot_adventure_based/\"}),\"4\"),\".\"),mdx(\"p\",null,\"Engage with the community, talk to people, ask some follow up questions.\"),mdx(\"h2\",e({},{id:\"incorporate-feedback\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#incorporate-feedback\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Incorporate Feedback\"),mdx(\"p\",null,\"Hopefully this process will sound familiar to you. Read through the comments, see if you can find constructive criticism that is really valid, or cool ideas that are really useful, and add them to the ToDo list of things you want to improve about your adventure.\"),mdx(\"p\",null,\"Then go through the list and try to make the tweaks and improvements.\"),mdx(\"hr\",null),mdx(\"h2\",e({},{id:\"activity\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#activity\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Activity\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Fill in your feedback template and post it to \",mdx(\"inlineCode\",{parentName:\"li\"},\"#writing-help-and-feedback\"),\" and subreddits.\"),mdx(\"li\",{parentName:\"ul\"},\"Engage in the discussion, ask questions, reply to feedback, list the most insightful and useful ideas.\"),mdx(\"li\",{parentName:\"ul\"},\"Incorporate the ideas into your adventure.\")))}MDXContent.isMDXComponent=!0;\n","scope":{}},"prev":{"title":"Writing Descriptions","url":"/adventure-writing/writing-descriptions"},"next":{"title":"Prep and Playtest","url":"/adventure-writing/prep-and-playtest"}},"prep-and-playtest":{"title":"Prep and Playtest","slug":"prep-and-playtest","description":"","thumbnail":null,"preview":false,"draft":false,"url":"/adventure-writing/prep-and-playtest","compiledMdx":{"compiledSource":"var y=Object.defineProperty,d=Object.defineProperties;var h=Object.getOwnPropertyDescriptors;var r=Object.getOwnPropertySymbols;var i=Object.prototype.hasOwnProperty,s=Object.prototype.propertyIsEnumerable;var p=(e,a,o)=>a in e?y(e,a,{enumerable:!0,configurable:!0,writable:!0,value:o}):e[a]=o,t=(e,a)=>{for(var o in a||(a={}))i.call(a,o)&&p(e,o,a[o]);if(r)for(var o of r(a))s.call(a,o)&&p(e,o,a[o]);return e},l=(e,a)=>d(e,h(a));var m=typeof require!=\"undefined\"?require:e=>{throw new Error('Dynamic require of \"'+e+'\" is not supported')};var u=(e,a)=>{var o={};for(var n in e)i.call(e,n)&&a.indexOf(n)<0&&(o[n]=e[n]);if(e!=null&&r)for(var n of r(e))a.indexOf(n)<0&&s.call(e,n)&&(o[n]=e[n]);return o};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(o){var n=o,{components:e}=n,a=u(n,[\"components\"]);return mdx(MDXLayout,l(t(t({},layoutProps),a),{components:e,mdxType:\"MDXLayout\"}),mdx(\"h1\",t({},{id:\"playtest\"}),mdx(\"a\",t({parentName:\"h1\"},{className:\"header-link\",href:\"#playtest\"}),mdx(\"span\",t({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Playtest\"),mdx(\"p\",null,\"Finally you have everything you need to playtest your adventure!\"),mdx(\"p\",null,\"The purpose of a playtest is to practice running your adventure before you run it for your players, or to receive some feedback before publishing it.\"),mdx(\"p\",null,\"Your goal is to play out a fun story, see the adventure from the perspective of the players, notice any existing issues and open questions, come up with more cool ideas, and to practice running the adventure before we do it for our players.\"),mdx(\"p\",null,\"Remember - there's no pressure to make your adventure perfect before you run it - if you're unsure of your GMing skills, or worried that there may be some gaps in your story - playtesting is the perfect way to practice running your story and find all the improvements you can make. Assume that the players will understand and help you out!\"),mdx(\"p\",null,\"Go to our \",mdx(\"inlineCode\",{parentName:\"p\"},\"#playtest-announcements\"),\" channel and invite people to your game. Make a post using the following template:\"),mdx(\"pre\",null,mdx(\"code\",t({parentName:\"pre\"},{className:\"code-highlight\"}),mdx(\"span\",t({parentName:\"code\"},{className:\"code-line\"}),`**Adventure Title:** <Into the Dark Wizard's Tower!>\n`),mdx(\"span\",t({parentName:\"code\"},{className:\"code-line\"}),`**Game System:** <Freeform Roleplaying>\n`),mdx(\"span\",t({parentName:\"code\"},{className:\"code-line\"}),`**Date & Time:** <3 hours from now, at 4PM GMT>\n`),mdx(\"span\",t({parentName:\"code\"},{className:\"code-line\"}),`**Spots Taken:** 0/4\n`),mdx(\"span\",t({parentName:\"code\"},{className:\"code-line\"}),`\n`),mdx(\"span\",t({parentName:\"code\"},{className:\"code-line\"}),`**Description:**\n`),mdx(\"span\",t({parentName:\"code\"},{className:\"code-line\"}),`<Describe the type of adventure you are looking to run, short summary of your adventure, and what kind of feedback you're looking for.>\n`))),mdx(\"p\",null,\"If you're struggling to find enough players, make a post on \",mdx(\"a\",t({parentName:\"p\"},{href:\"https://www.reddit.com/r/lfg/\"}),\"/r/lfg\"),\" and invite people from there to participate as well.\"),mdx(\"p\",null,\"You can use your favorite system to playtest the game, or you can use the \",mdx(\"a\",t({parentName:\"p\"},{href:\"https://rpgadventures.io/mirage\"}),\"ruleset\"),\" I have designed specifically for playtests - it is focused on freeform, improv-heavy, combat-light, roleplay-focused games. It doesn't have any of the intricate rules and mechanics that will slow down your game without resulting in any useful feedback, it will help you to focus on storytelling, improvisation, and fleshing out your story.\"),mdx(\"p\",null,\"Before the game, run through the adventure in your mind, play through the game in your imagination. \"),mdx(\"p\",null,\"As you're playing, hold ideas lightly - don't try to stick to the story too rigidly, dont try to force the outcomes you expect. Feel free to improvise and let the players take it in new directions, that's how you come up with new ideas that will enchance your adventure.\"),mdx(\"p\",null,\"Don't take it seriously and don't try too hard - just play. You've already created the story, you have the adventure open in front of you for backup, now you can just let the improv take you wherever it does.\"),mdx(\"p\",null,\"If you notice any mistakes or plot holes in your story - improvise, fill in the gaps as you play.\"),mdx(\"p\",null,\"After the game ask the players for some feedback. Sometimes it will be obvious that the players are happy and have enjoyed the game very much. Sometimes you can ask them for advice and ideas on what you could've done better. Since the players in our community are often adventure writers themselves, they might volunteer some useful feedback and helpful ideas.\"),mdx(\"p\",null,\"Now, all that's left is to incorporate that feedback into your story, and make it even better for future players. If you want to run the feedback multiple times - feel free to do that, you'll get better and more confident at running the game every time, and more people will get to experience your story.\"),mdx(\"hr\",null),mdx(\"h2\",t({},{id:\"activity\"}),mdx(\"a\",t({parentName:\"h2\"},{className:\"header-link\",href:\"#activity\"}),mdx(\"span\",t({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Activity\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Make a post in  \",mdx(\"inlineCode\",{parentName:\"li\"},\"#playtest-announcements\"),\" and invite players to your game.\"),mdx(\"li\",{parentName:\"ul\"},\"Run the playtest.\"),mdx(\"li\",{parentName:\"ul\"},\"Incorporate player's feedback and your own ideas that emerged during the game into your adventure.\")))}MDXContent.isMDXComponent=!0;\n","scope":{}},"prev":{"title":"Community Feedback","url":"/adventure-writing/community-feedback"},"next":{"title":"Design and Illustrations","url":"/adventure-writing/design-and-illustrations"}},"design-and-illustrations":{"title":"Design and Illustrations","slug":"design-and-illustrations","description":"","thumbnail":null,"preview":false,"draft":false,"url":"/adventure-writing/design-and-illustrations","compiledMdx":{"compiledSource":"var m=Object.defineProperty,h=Object.defineProperties;var d=Object.getOwnPropertyDescriptors;var r=Object.getOwnPropertySymbols;var o=Object.prototype.hasOwnProperty,s=Object.prototype.propertyIsEnumerable;var p=(a,n,t)=>n in a?m(a,n,{enumerable:!0,configurable:!0,writable:!0,value:t}):a[n]=t,e=(a,n)=>{for(var t in n||(n={}))o.call(n,t)&&p(a,t,n[t]);if(r)for(var t of r(n))s.call(n,t)&&p(a,t,n[t]);return a},l=(a,n)=>h(a,d(n));var c=typeof require!=\"undefined\"?require:a=>{throw new Error('Dynamic require of \"'+a+'\" is not supported')};var u=(a,n)=>{var t={};for(var i in a)o.call(a,i)&&n.indexOf(i)<0&&(t[i]=a[i]);if(a!=null&&r)for(var i of r(a))n.indexOf(i)<0&&s.call(a,i)&&(t[i]=a[i]);return t};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(t){var i=t,{components:a}=i,n=u(i,[\"components\"]);return mdx(MDXLayout,l(e(e({},layoutProps),n),{components:a,mdxType:\"MDXLayout\"}),mdx(\"h1\",e({},{id:\"design-and-illustrations\"}),mdx(\"a\",e({parentName:\"h1\"},{className:\"header-link\",href:\"#design-and-illustrations\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Design and Illustrations\"),mdx(\"p\",null,\"Now we have finished writing our adventure! The only step left is to design a pretty document and find some nice maps and illustrations.\"),mdx(\"h2\",e({},{id:\"designing-the-pdf\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#designing-the-pdf\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Designing the PDF\"),mdx(\"p\",null,\"The simplest thing you can do is to just export your google docs document by clicking \",mdx(\"inlineCode\",{parentName:\"p\"},\"File > Download > PDF Document\"),\". \"),mdx(\"p\",null,\"If you want a bit fancier design, the easiest way create a good looking PDF is to use \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://homebrewery.naturalcrit.com/\"}),\"Homebrewery\"),\" - an app that automatically styles your adventure using appealing fonts and backgrounds. Another good app is \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.gmbinder.com/\"}),\"GMBinder\"),\", you can see the tutorial on using it to design adventures \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.gmbinder.com/share/-LPnHKXC8G7OGTlzInnQ\"}),\"here\"),\".\"),mdx(\"p\",null,\"If you have interest in learning a more powerful and flexible tool and designing the document yourself, I highly recommend \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://affinity.serif.com/en-gb/publisher/\"}),\"Affinity Publisher\"),\". It's inexpensive, relatively easy to use (though it does require some skill), and incredibly powerful. \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.youtube.com/watch?v=h6XZC8ieczU\"}),\"Here\"),\" are some tips on using it to design your adventures.\"),mdx(\"h2\",e({},{id:\"illustrations\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#illustrations\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Illustrations\"),mdx(\"p\",null,\"If you're not planning to publish your adventure and just want to share it with your friends and run it for your players - you can just find any pretty illustration you like using ArtStation, Pinterest, or Google image search.\"),mdx(\"p\",null,\"If you're planning to publish your adventure, you have to be mindful of copyright.\"),mdx(\"p\",null,\"You can use the following websites to find some free art you can use in your adventures:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"a\",e({parentName:\"li\"},{href:\"https://unsplash.com/\"}),\"Unsplash (free)\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"a\",e({parentName:\"li\"},{href:\"https://pixabay.com/en/\"}),\"Pixabay (free)\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"a\",e({parentName:\"li\"},{href:\"https://www.pexels.com/\"}),\"Pexels (free)\")),mdx(\"li\",{parentName:\"ul\"},mdx(\"a\",e({parentName:\"li\"},{href:\"https://commons.wikimedia.org/wiki/Main_Page\"}),\"Wikimedia Commons\"))),mdx(\"p\",null,\"You can personally message artists on ArtStation and ask them for permission to use their artwork in your adventure (for free or for some amount of money).\"),mdx(\"p\",null,\"Finally, if you have a bigger budget, you can hire artists on \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://fiverr.com/\"}),\"Fiverr\"),\" or \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.upwork.com/\"}),\"Upwork\"),\" to do custom artworks for you.\"),mdx(\"h2\",e({},{id:\"maps\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#maps\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Maps\"),mdx(\"p\",null,\"You can find a lot of amazing maps on \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.reddit.com/r/dndmaps/top/\"}),\"/r/dndmaps\"),\" and \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.reddit.com/r/battlemaps/top/\"}),\"/r/battlemaps\"),\" (make sure that you have the author's permission to use the maps in your adventure).\"),mdx(\"p\",null,\"You can also create the maps yourself using amazing apps like \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://dungeondraft.net/\"}),\"Dungeon Draft\"),\" and \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://inkarnate.com/\"}),\"Inkarnate\"),\".\"),mdx(\"hr\",null),mdx(\"h2\",e({},{id:\"activity\"}),mdx(\"a\",e({parentName:\"h2\"},{className:\"header-link\",href:\"#activity\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Activity\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Find the illustrations for the most significant locations and characters.\"),mdx(\"li\",{parentName:\"ul\"},\"If you need maps - try making your first one and share it in \",mdx(\"inlineCode\",{parentName:\"li\"},\"#illustrations-and-maps\"),\".\"),mdx(\"li\",{parentName:\"ul\"},\"Try using adventure formatting software to format your adventure and export a PDF.\")))}MDXContent.isMDXComponent=!0;\n","scope":{}},"prev":{"title":"Prep and Playtest","url":"/adventure-writing/prep-and-playtest"},"next":{"title":"Publishing","url":"/adventure-writing/publishing"}},"publishing":{"title":"Publishing","slug":"publishing","description":"","thumbnail":null,"preview":false,"draft":false,"url":"/adventure-writing/publishing","compiledMdx":{"compiledSource":"var p=Object.defineProperty,d=Object.defineProperties;var c=Object.getOwnPropertyDescriptors;var i=Object.getOwnPropertySymbols;var o=Object.prototype.hasOwnProperty,l=Object.prototype.propertyIsEnumerable;var s=(e,a,t)=>a in e?p(e,a,{enumerable:!0,configurable:!0,writable:!0,value:t}):e[a]=t,r=(e,a)=>{for(var t in a||(a={}))o.call(a,t)&&s(e,t,a[t]);if(i)for(var t of i(a))l.call(a,t)&&s(e,t,a[t]);return e},u=(e,a)=>d(e,c(a));var m=typeof require!=\"undefined\"?require:e=>{throw new Error('Dynamic require of \"'+e+'\" is not supported')};var h=(e,a)=>{var t={};for(var n in e)o.call(e,n)&&a.indexOf(n)<0&&(t[n]=e[n]);if(e!=null&&i)for(var n of i(e))a.indexOf(n)<0&&l.call(e,n)&&(t[n]=e[n]);return t};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(t){var n=t,{components:e}=n,a=h(n,[\"components\"]);return mdx(MDXLayout,u(r(r({},layoutProps),a),{components:e,mdxType:\"MDXLayout\"}),mdx(\"h1\",r({},{id:\"publishing\"}),mdx(\"a\",r({parentName:\"h1\"},{className:\"header-link\",href:\"#publishing\"}),mdx(\"span\",r({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Publishing\"),mdx(\"p\",null,\"Finally your adventure is complete and you're ready to share it with the world!\"),mdx(\"p\",null,\"There are many places where you can publish adventures, here are some of the best options:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"a\",r({parentName:\"li\"},{href:\"https://www.drivethrurpg.com/\"}),\"DriveThruRPG\"),\" - probably the largest online store where people publish and buy adventures. Their UI is a bit inconvenient and archaic, but it's worth learning how to use it because they have a pretty large audience.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"a\",r({parentName:\"li\"},{href:\"https://gumroad.com/\"}),\"Gumroad\"),\" - extremely easy and convenient way to build an online store where you can sell your adventures. They also help you to grow an audience of email subscribers, once the person has bought (or downloaded for free) one of your adventures, you can send them email notifications about your future projects.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"a\",r({parentName:\"li\"},{href:\"https://itch.io/\"}),\"Itch.io\"),\" - another great website people use to share their games and adventures. It's mostly focused on video games, but I've seen it used for TTRPG adventures as well. I don't have a lot of experience with it, but it's worth being aware of adn trying it out.\")),mdx(\"hr\",null),mdx(\"h2\",r({},{id:\"activity\"}),mdx(\"a\",r({parentName:\"h2\"},{className:\"header-link\",href:\"#activity\"}),mdx(\"span\",r({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Activity\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Publish your adventure on one of the platforms outlined above.\"),mdx(\"li\",{parentName:\"ul\"},\"Share your adventure in our  \",mdx(\"inlineCode\",{parentName:\"li\"},\"#finished-adventures\"),\" channel.\"),mdx(\"li\",{parentName:\"ul\"},\"Share your adventure with your friends and on social media.\")))}MDXContent.isMDXComponent=!0;\n","scope":{}},"prev":{"title":"Design and Illustrations","url":"/adventure-writing/design-and-illustrations"},"next":{"title":"Thank you for participating!","url":"/conclusion/thank-you-for-participating"}}}},"conclusion":{"title":"Conclusion","slug":"conclusion","chapters":{"thank-you-for-participating":{"title":"Thank you for participating!","slug":"thank-you-for-participating","description":"","thumbnail":null,"preview":false,"draft":false,"url":"/conclusion/thank-you-for-participating","compiledMdx":{"compiledSource":"var m=Object.defineProperty,h=Object.defineProperties;var d=Object.getOwnPropertyDescriptors;var t=Object.getOwnPropertySymbols;var l=Object.prototype.hasOwnProperty,u=Object.prototype.propertyIsEnumerable;var r=(e,n,o)=>n in e?m(e,n,{enumerable:!0,configurable:!0,writable:!0,value:o}):e[n]=o,i=(e,n)=>{for(var o in n||(n={}))l.call(n,o)&&r(e,o,n[o]);if(t)for(var o of t(n))u.call(n,o)&&r(e,o,n[o]);return e},s=(e,n)=>h(e,d(n));var c=typeof require!=\"undefined\"?require:e=>{throw new Error('Dynamic require of \"'+e+'\" is not supported')};var p=(e,n)=>{var o={};for(var a in e)l.call(e,a)&&n.indexOf(a)<0&&(o[a]=e[a]);if(e!=null&&t)for(var a of t(e))n.indexOf(a)<0&&u.call(e,a)&&(o[a]=e[a]);return o};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(o){var a=o,{components:e}=a,n=p(a,[\"components\"]);return mdx(MDXLayout,s(i(i({},layoutProps),n),{components:e,mdxType:\"MDXLayout\"}),mdx(\"h1\",i({},{id:\"thank-you\"}),mdx(\"a\",i({parentName:\"h1\"},{className:\"header-link\",href:\"#thank-you\"}),mdx(\"span\",i({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Thank you!\"),mdx(\"p\",null,\"Thank you for participating in this course! I really hope that you found it useful.\"),mdx(\"p\",null,\"If you did - please share it with your friends and on social media, it would really help us to grow our community and share this information with more people.\"),mdx(\"p\",null,\"If you've encountered any issues, found something difficult or confusing, or have any thoughts/ideas/feedback on how I can make this course more useful to people - please let me know!\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Email: \",mdx(\"inlineCode\",{parentName:\"li\"},\"lumenwrites@gmail.com\")),mdx(\"li\",{parentName:\"ul\"},\"Discord: \",mdx(\"inlineCode\",{parentName:\"li\"},\"lumen#7925\"))))}MDXContent.isMDXComponent=!0;\n","scope":{}},"prev":{"title":"Publishing","url":"/adventure-writing/publishing"},"next":null}}}}