{"compiledSource":"var h=Object.defineProperty,y=Object.defineProperties;var d=Object.getOwnPropertyDescriptors;var i=Object.getOwnPropertySymbols;var l=Object.prototype.hasOwnProperty,r=Object.prototype.propertyIsEnumerable;var s=(e,t,a)=>t in e?h(e,t,{enumerable:!0,configurable:!0,writable:!0,value:a}):e[t]=a,n=(e,t)=>{for(var a in t||(t={}))l.call(t,a)&&s(e,a,t[a]);if(i)for(var a of i(t))r.call(t,a)&&s(e,a,t[a]);return e},u=(e,t)=>y(e,d(t));var c=typeof require!=\"undefined\"?require:e=>{throw new Error('Dynamic require of \"'+e+'\" is not supported')};var p=(e,t)=>{var a={};for(var o in e)l.call(e,o)&&t.indexOf(o)<0&&(a[o]=e[o]);if(e!=null&&i)for(var o of i(e))t.indexOf(o)<0&&r.call(e,o)&&(a[o]=e[o]);return a};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(a){var o=a,{components:e}=o,t=p(o,[\"components\"]);return mdx(MDXLayout,u(n(n({},layoutProps),t),{components:e,mdxType:\"MDXLayout\"}),mdx(\"h2\",n({},{id:\"what-you-will-learn-in-this-course\"}),\"What You will Learn in this Course\"),mdx(\"p\",null,\"In this course you will learn a straightforward step-by-step process that will give you everything you need to create your own adventures for tabletop roleplaying games.\"),mdx(\"p\",null,\"By the end of this course you will:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Create a short but fun one-shot adventure you can run for your players or publish.\"),mdx(\"li\",{parentName:\"ul\"},\"Establish a repeatable creative process you can use to undertake more ambitious projects.\"),mdx(\"li\",{parentName:\"ul\"},\"Gain the experience and confidence in your abilities to generate ideas and write stories.\")),mdx(\"p\",null,\"During this course you will:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Brainstorm and develop adventure ideas.\"),mdx(\"li\",{parentName:\"ul\"},\"Invent interesting settings and locations.\"),mdx(\"li\",{parentName:\"ul\"},\"Develop cool characters your players will enjoy interacting with.\"),mdx(\"li\",{parentName:\"ul\"},\"Plot your adventure using a simple but solid story structure.\"),mdx(\"li\",{parentName:\"ul\"},\"Design exciting challenges and encounters.\"),mdx(\"li\",{parentName:\"ul\"},\"Use outlining to convert your ideas into the first draft.\"),mdx(\"li\",{parentName:\"ul\"},\"Write vivid discriptions and fun dialogue.\"),mdx(\"li\",{parentName:\"ul\"},\"Playtest your adventures and get feedback from the players.\"),mdx(\"li\",{parentName:\"ul\"},\"Create the final PDF of your adventure with appealing design and illustrations.\"),mdx(\"li\",{parentName:\"ul\"},\"Publish and market your adventure (if you want).\")),mdx(\"h2\",n({},{id:\"what-you-will-not-learn-in-this-course\"}),\"What You will Not Learn in this Course\"),mdx(\"p\",null,\"This course is about storytelling, not stat blocks and mechanics, so you will not find any system-specific instructions on how to create level-appropriate monsters or balacne combat encounters. \"),mdx(\"p\",null,\"You can use this course with any system - DnD, Shadowrun, Fate, or anything else you enjoy playing.  You can use it to make adventures for players of any level. My goal is to help you to create fun and engaging stories. If you want to learn about the mechanics and plug in the numbers - follow the instructions in the rulebook for your preferred system.\"),mdx(\"p\",null,\"I have also done my best to avoid wasting your time with self-help'y motivational speeches, random tangents, rants, and other fluff. I want to deliver all the most valuable and insighful information concisely, so that you could reach your goal as quickly as possible.\"),mdx(\"h2\",n({},{id:\"why-should-you-follow-this-course\"}),\"Why should you follow this course?\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Learn By Doing\"),\". Learn to make adventures by jumping in and creating an adventure of your own. No more abstract theory than absolutely necessary.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Easy for novice GMs\"),\". I will show you a simple and straightforward creative process that will help you to write your first adventure even if you've never done it before.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"No more writer's block\"),\", no more staring at a blank page in confusion. I mean, writing will still often be challenging, but at least you won't find yourself feeling stuck and not understanding why. You will always have a plan, and a list of clear and attainable goals, specific tasks to accomplish. \"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Peace of mind\"),\". Following all the steps and answering all the questions gives you all the information you need for a well crafted adventure. You don't have to worry about missing anything.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Clarity and flow\"),'. The most valuable part of my process is breaking down the adventure writing into a series of small, specific, attainable steps. No task is too complicated or overwhelming, every step has clear instructions. Accomplishing small tasks at the appropriate level of difficulty is how we get into the \"flow\", the state that makes writing fun and satisfying.'),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Modular design\"),`. As you follow my process, you will design your adventure in a way that gives you the flexibility to tweak and change the story in response to player's actions. The adventures you create will not \"railroad\" players down to one specific path, they will feel interactive, players will feel like they have impact on the world and the outcome of the story. `),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Prep what matters, don't prep what doesn't\"),\". Spend your energy only on things that actually enhance the game, don't spend hours developing ideas that never get used.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"High prep or improv-heavy games\"),\". This process works well for both low-prep improv-focused GMs, as well as for people who prefer more detailed prep. \")))}MDXContent.isMDXComponent=!0;\n","scope":{}}