{"compiledSource":"var h=Object.defineProperty,d=Object.defineProperties;var c=Object.getOwnPropertyDescriptors;var r=Object.getOwnPropertySymbols;var i=Object.prototype.hasOwnProperty,l=Object.prototype.propertyIsEnumerable;var s=(e,t,a)=>t in e?h(e,t,{enumerable:!0,configurable:!0,writable:!0,value:a}):e[t]=a,n=(e,t)=>{for(var a in t||(t={}))i.call(t,a)&&s(e,a,t[a]);if(r)for(var a of r(t))l.call(t,a)&&s(e,a,t[a]);return e},u=(e,t)=>d(e,c(t));var y=typeof require!=\"undefined\"?require:e=>{throw new Error('Dynamic require of \"'+e+'\" is not supported')};var p=(e,t)=>{var a={};for(var o in e)i.call(e,o)&&t.indexOf(o)<0&&(a[o]=e[o]);if(e!=null&&r)for(var o of r(e))t.indexOf(o)<0&&l.call(e,o)&&(a[o]=e[o]);return a};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(a){var o=a,{components:e}=o,t=p(o,[\"components\"]);return mdx(MDXLayout,u(n(n({},layoutProps),t),{components:e,mdxType:\"MDXLayout\"}),mdx(\"h2\",n({},{id:\"what-you-will-learn-in-this-course\"}),\"What You will Learn in this Course\"),mdx(\"p\",null,\"In this course you will learn a straightforward step-by-step process that will give you all the tools you need to create your own adventures for tabletop roleplaying games. \"),mdx(\"p\",null,\"You will learn how to invent an unlimited number of adventure ideas, forever defeat the writer's block, expertly craft engaging stories, and take every aspect of your adventures to the next level.\"),mdx(\"p\",null,mdx(\"strong\",{parentName:\"p\"},\"If you follow the steps outlined in this course, in two weeks you will\"),\":\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Create a short but fun one-shot adventure you can run for your players or publish.\"),mdx(\"li\",{parentName:\"ul\"},\"Establish a repeatable creative process you can use to undertake more ambitious projects.\"),mdx(\"li\",{parentName:\"ul\"},\"Gain the experience and confidence in your abilities to generate ideas and write stories.\"),mdx(\"li\",{parentName:\"ul\"},\"Learn powerful tools to become a productive and prolific writer.\")),mdx(\"p\",null,mdx(\"strong\",{parentName:\"p\"},\"During this course you will\"),\":\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Brainstorm and develop adventure ideas.\"),mdx(\"li\",{parentName:\"ul\"},\"Invent interesting settings and locations.\"),mdx(\"li\",{parentName:\"ul\"},\"Develop cool characters your players will enjoy interacting with.\"),mdx(\"li\",{parentName:\"ul\"},\"Plot your adventure using a simple but solid story structure.\"),mdx(\"li\",{parentName:\"ul\"},\"Design exciting challenges and encounters.\"),mdx(\"li\",{parentName:\"ul\"},\"Use outlining to organize your ideas into the first draft.\"),mdx(\"li\",{parentName:\"ul\"},\"Write vivid descriptions of your world and characters.\"),mdx(\"li\",{parentName:\"ul\"},\"Playtest your adventure, receive player feedback, and implement improvements.\"),mdx(\"li\",{parentName:\"ul\"},\"Create the final PDF of your adventure with appealing design and illustrations.\"),mdx(\"li\",{parentName:\"ul\"},\"Publish and market your adventure (if you want).\")),mdx(\"p\",null,mdx(\"strong\",{parentName:\"p\"},\"In addition to that you will get access to\"),\":\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Our supportive and encouraging Discord community.\"),mdx(\"li\",{parentName:\"ul\"},\"Adventure templates that will dramatically simplify your writing process.\"),mdx(\"li\",{parentName:\"ul\"},\"Adventure prompts tool that will help you to generate unlimited ideas very quickly.\")),mdx(\"p\",null,\"To sum up - this course will guide you through the story creation process step by step, provide the structure, deadlines, and the community support which will make sure that you can successfully complete your own adventure!\"),mdx(\"h2\",n({},{id:\"why-one-shot-adventures\"}),\"Why One-Shot Adventures?\"),mdx(\"p\",null,\"A one-shot adventure is a self-contained story that can be completed in one 3-4 hour game session. Creating a one-shot is the perfect way to learn everything you need to know to create engaging and entertaining stories. \"),mdx(\"p\",null,\"It is an attainable goal that you can accomplish during the next couple of weeks, and achieving it will give you all the skills you need to take on more ambitious projects, such as longer adventures and campaigns.\"),mdx(\"h2\",n({},{id:\"why-should-you-follow-this-course\"}),\"Why should you follow this course?\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Learn By Doing\"),mdx(\"br\",{parentName:\"li\"}),\"Learn to make adventures by jumping in and creating an adventure of your own. No more abstract theory than absolutely necessary. Clear and approachable steps that will take you to your goal as quickly as possible.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Easy for novice GMs\"),mdx(\"br\",{parentName:\"li\"}),\"I will show you a simple and straightforward creative process that will help you to write your first adventure even if you've never done it before.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"No more writer's block\"),mdx(\"br\",{parentName:\"li\"}),\"No more staring at a blank page in confusion. I mean, writing will still often be challenging, but at least you won't find yourself feeling stuck and not understanding why. You will always have a plan, and a list of clear and attainable goals, specific tasks to accomplish. \"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Peace of mind\"),mdx(\"br\",{parentName:\"li\"}),\"Following all the steps and answering all the questions gives you all the information you need to run a well-crafted adventure. You don't have to worry about missing anything important.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Clarity and flow\"),mdx(\"br\",{parentName:\"li\"}),'The most valuable part of my process is breaking down the adventure writing into a series of small, specific, attainable steps. No task is too complicated or overwhelming, every step has clear instructions. Accomplishing small tasks at the appropriate level of difficulty is how we get into the \"flow\", the state that makes writing fun and satisfying.'),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Modular design\"),mdx(\"br\",{parentName:\"li\"}),`As you follow my process, you will design your adventure in a way that gives you the flexibility to tweak and change the story in response to the players' actions. The adventures you create will not \"railroad\" players down to one specific path, they will feel interactive, players will feel like they have impact on the world and the outcome of the story. `),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"Prep what matters, don't prep what doesn't\"),mdx(\"br\",{parentName:\"li\"}),\"Spend your energy only on things that actually enhance the game, don't spend hours developing ideas that never get used.\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"strong\",{parentName:\"li\"},\"High prep or improv-heavy games\"),mdx(\"br\",{parentName:\"li\"}),\"This process works well for both low-prep improv-focused GMs, as well as for people who prefer more detailed prep. \")))}MDXContent.isMDXComponent=!0;\n","scope":{}}